HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
/**
  * @brief TIM
  */
typedef struct
{
  __IO uint32_t CR1;         /*!< TIM control register 1,              Address offset: 0x00 */
  __IO uint32_t CR2;         /*!< TIM control register 2,              Address offset: 0x04 */
  __IO uint32_t SMCR;        /*!< TIM slave mode control register,     Address offset: 0x08 */
  __IO uint32_t DIER;        /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  __IO uint32_t SR;          /*!< TIM status register,                 Address offset: 0x10 */
  __IO uint32_t EGR;         /*!< TIM event generation register,       Address offset: 0x14 */
  __IO uint32_t CCMR1;       /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  __IO uint32_t CCMR2;       /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  __IO uint32_t CCER;        /*!< TIM capture/compare enable register, Address offset: 0x20 */
  __IO uint32_t CNT;         /*!< TIM counter register,                Address offset: 0x24 */
  __IO uint32_t PSC;         /*!< TIM prescaler,                       Address offset: 0x28 */
  __IO uint32_t ARR;         /*!< TIM auto-reload register,            Address offset: 0x2C */
  __IO uint32_t RCR;         /*!< TIM repetition counter register,     Address offset: 0x30 */
  __IO uint32_t CCR1;        /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  __IO uint32_t CCR2;        /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  __IO uint32_t CCR3;        /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  __IO uint32_t CCR4;        /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  __IO uint32_t BDTR;        /*!< TIM break and dead-time register,    Address offset: 0x44 */
  __IO uint32_t DCR;         /*!< TIM DMA control register,            Address offset: 0x48 */
  __IO uint32_t DMAR;        /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  __IO uint32_t OR;          /*!< TIM option register,                 Address offset: 0x50 */
#if defined(STM32F373xC) || defined(STM32F378xx)
#else
  __IO uint32_t CCMR3;       /*!< TIM capture/compare mode register 3, Address offset: 0x54 */
  __IO uint32_t CCR5;        /*!< TIM capture/compare register5,       Address offset: 0x58 */
  __IO uint32_t CCR6;        /*!< TIM capture/compare register 4,      Address offset: 0x5C */
#endif
} TIM_TypeDef;

/**
  * @brief Touch Sensing Controller (TSC)
  */
typedef struct
{
  __IO uint32_t CR;            /*!< TSC control register,                                     Address offset: 0x00 */
  __IO uint32_t IER;           /*!< TSC interrupt enable register,                            Address offset: 0x04 */
  __IO uint32_t ICR;           /*!< TSC interrupt clear register,                             Address offset: 0x08 */
  __IO uint32_t ISR;           /*!< TSC interrupt status register,                            Address offset: 0x0C */
  __IO uint32_t IOHCR;         /*!< TSC I/O hysteresis control register,                      Address offset: 0x10 */
  uint32_t      RESERVED1;     /*!< Reserved,                                                 Address offset: 0x14 */
  __IO uint32_t IOASCR;        /*!< TSC I/O analog switch control register,                   Address offset: 0x18 */
  uint32_t      RESERVED2;     /*!< Reserved,                                                 Address offset: 0x1C */
  __IO uint32_t IOSCR;         /*!< TSC I/O sampling control register,                        Address offset: 0x20 */
  uint32_t      RESERVED3;     /*!< Reserved,                                                 Address offset: 0x24 */
  __IO uint32_t IOCCR;         /*!< TSC I/O channel control register,                         Address offset: 0x28 */
  uint32_t      RESERVED4;     /*!< Reserved,                                                 Address offset: 0x2C */
  __IO uint32_t IOGCSR;        /*!< TSC I/O group control status register,                    Address offset: 0x30 */
  __IO uint32_t IOGXCR[8];     /*!< TSC I/O group x counter register,                         Address offset: 0x34-50 */
} TSC_TypeDef;

/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */

typedef struct
{
  __IO uint32_t CR1;    /*!< USART Control register 1,                 Address offset: 0x00 */
  __IO uint32_t CR2;    /*!< USART Control register 2,                 Address offset: 0x04 */
  __IO uint32_t CR3;    /*!< USART Control register 3,                 Address offset: 0x08 */
  __IO uint32_t BRR;    /*!< USART Baud rate register,                 Address offset: 0x0C */
  __IO uint32_t GTPR;   /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
  __IO uint32_t RTOR;   /*!< USART Receiver Time Out register,         Address offset: 0x14 */
  __IO uint32_t RQR;    /*!< USART Request register,                   Address offset: 0x18 */
  __IO uint32_t ISR;    /*!< USART Interrupt and status register,      Address offset: 0x1C */
  __IO uint32_t ICR;    /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
  __IO uint16_t RDR;    /*!< USART Receive Data register,              Address offset: 0x24 */
  uint16_t  RESERVED1;  /*!< Reserved, 0x26                                                 */
  __IO uint16_t TDR;    /*!< USART Transmit Data register,             Address offset: 0x28 */
  uint16_t  RESERVED2;  /*!< Reserved, 0x2A                                                 */
} USART_TypeDef;

#if defined (STM32F302x8) ||  defined (STM32F302xC) ||defined (STM32F302xE) || defined (STM32F303xC) || defined (STM32F303xE) || defined (STM32F373xC)
/** 
  * @brief Universal Serial Bus Full Speed Device
  */
  
typedef struct
{
  __IO uint16_t EP0R;            /*!< USB Endpoint 0 register,                Address offset: 0x00 */ 
  __IO uint16_t RESERVED0;       /*!< Reserved */     
  __IO uint16_t EP1R;            /*!< USB Endpoint 1 register,                Address offset: 0x04 */
  __IO uint16_t RESERVED1;       /*!< Reserved */       
  __IO uint16_t EP2R;            /*!< USB Endpoint 2 register,                Address offset: 0x08 */
  __IO uint16_t RESERVED2;       /*!< Reserved */       
  __IO uint16_t EP3R;            /*!< USB Endpoint 3 register,                Address offset: 0x0C */ 
  __IO uint16_t RESERVED3;       /*!< Reserved */       
  __IO uint16_t EP4R;            /*!< USB Endpoint 4 register,                Address offset: 0x10 */
  __IO uint16_t RESERVED4;       /*!< Reserved */       
  __IO uint16_t EP5R;            /*!< USB Endpoint 5 register,                Address offset: 0x14 */
  __IO uint16_t RESERVED5;       /*!< Reserved */       
  __IO uint16_t EP6R;            /*!< USB Endpoint 6 register,                Address offset: 0x18 */
  __IO uint16_t RESERVED6;       /*!< Reserved */       
  __IO uint16_t EP7R;            /*!< USB Endpoint 7 register,                Address offset: 0x1C */
  __IO uint16_t RESERVED7[17];   /*!< Reserved */     
  __IO uint16_t CNTR;            /*!< Control register,                       Address offset: 0x40 */
  __IO uint16_t RESERVED8;       /*!< Reserved */       
  __IO uint16_t ISTR;            /*!< Interrupt status register,              Address offset: 0x44 */
  __IO uint16_t RESERVED9;       /*!< Reserved */       
  __IO uint16_t FNR;             /*!< Frame number register,                  Address offset: 0x48 */
  __IO uint16_t RESERVEDA;       /*!< Reserved */       
  __IO uint16_t DADDR;           /*!< Device address register,                Address offset: 0x4C */
  __IO uint16_t RESERVEDB;       /*!< Reserved */       
  __IO uint16_t BTABLE;          /*!< Buffer Table address register,          Address offset: 0x50 */
  __IO uint16_t RESERVEDC;       /*!< Reserved */
#if defined(STM32F302x8) || defined(STM32F302xE) || defined(STM32F303xE)
  __IO uint16_t LPMCSR;          /*!< LPM Control and Status register,        Address offset: 0x54 */
  __IO uint16_t RESERVEDD;       /*!< Reserved */
#endif
} USB_TypeDef;

#endif
/**
  * @brief Window WATCHDOG
  */
typedef struct
{
  __IO uint32_t CR;   /*!< WWDG Control register,       Address offset: 0x00 */
  __IO uint32_t CFR;  /*!< WWDG Configuration register, Address offset: 0x04 */
  __IO uint32_t SR;   /*!< WWDG Status register,        Address offset: 0x08 */
} WWDG_TypeDef;

/** @addtogroup Peripheral_memory_map
  * @{
  */

#define FLASH_BASE            ((uint32_t)0x08000000U) /*!< FLASH base address in the alias region */
#if defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F398xx)
#define CCMDATARAM_BASE       ((uint32_t)0x10000000U) /*!< CCM(core coupled memory) data RAM base address in the alias region     */
#endif
#define SRAM_BASE             ((uint32_t)0x20000000U) /*!< SRAM base address in the alias region */
#define PERIPH_BASE           ((uint32_t)0x40000000U) /*!< Peripheral base address in the alias region */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define FMC_BASE              ((uint32_t)0x60000000U) /*!< FMC base address                                                             */
#define FMC_R_BASE            ((uint32_t)0xA0000000U) /*!< FMC registers base address                                                   */

#endif
#define SRAM_BB_BASE          ((uint32_t)0x22000000U) /*!< SRAM base address in the bit-band region */
#define PERIPH_BB_BASE        ((uint32_t)0x42000000U) /*!< Peripheral base address in the bit-band region */


/*!< Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000U)
#define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000U)
#define AHB2PERIPH_BASE       (PERIPH_BASE + 0x08000000U)
#if defined (STM32F301x8) || defined (STM32F302x8) || defined (STM32F318xx) || defined (STM32F302xC)|| defined (STM32F303xC) || defined (STM32F358xx) || defined (STM32F303x8) || defined (STM32F334x8)|| defined (STM32F328xx) || defined (STM32F302xE) || defined (STM32F303xE) || defined (STM32F398xx)
#define AHB3PERIPH_BASE       (PERIPH_BASE + 0x10000000U)
#endif

/*!< APB1 peripherals */
#define TIM2_BASE             (APB1PERIPH_BASE + 0x00000000U)
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define TIM3_BASE             (APB1PERIPH_BASE + 0x00000400U)
#endif
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define TIM4_BASE             (APB1PERIPH_BASE + 0x00000800U)
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#define TIM5_BASE             (APB1PERIPH_BASE + 0x00000C00U)
#endif
#define TIM6_BASE             (APB1PERIPH_BASE + 0x00001000U)
#if defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define TIM7_BASE             (APB1PERIPH_BASE + 0x00001400U)
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#define TIM12_BASE            (APB1PERIPH_BASE + 0x00001800U)
#define TIM13_BASE            (APB1PERIPH_BASE + 0x00001C00U)
#define TIM14_BASE            (APB1PERIPH_BASE + 0x00002000U)
#endif
#define RTC_BASE              (APB1PERIPH_BASE + 0x00002800U)
#define WWDG_BASE             (APB1PERIPH_BASE + 0x00002C00U)
#define IWDG_BASE             (APB1PERIPH_BASE + 0x00003000U)
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx)|| defined(STM32F398xx)
#define I2S2ext_BASE          (APB1PERIPH_BASE + 0x00003400U)
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx) || defined(STM32F398xx)
#define SPI2_BASE             (APB1PERIPH_BASE + 0x00003800U)
#define SPI3_BASE             (APB1PERIPH_BASE + 0x00003C00U)
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx)|| defined(STM32F398xx)
#define I2S3ext_BASE          (APB1PERIPH_BASE + 0x00004000U)
#endif
#define USART2_BASE           (APB1PERIPH_BASE + 0x00004400U)
#define USART3_BASE           (APB1PERIPH_BASE + 0x00004800U)
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
#define UART4_BASE            (APB1PERIPH_BASE + 0x00004C00U)
#define UART5_BASE            (APB1PERIPH_BASE + 0x00005000U)
#endif
#define I2C1_BASE             (APB1PERIPH_BASE + 0x00005400U)
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx) || defined(STM32F398xx)
#define I2C2_BASE             (APB1PERIPH_BASE + 0x00005800U)
#endif
#if defined (STM32F302x8) || defined (STM32F302xC) || defined (STM32F373xC) || defined (STM32F303xC) || defined (STM32F302xE) || defined (STM32F303xE)
#define USB_BASE              (APB1PERIPH_BASE + 0x00005C00U) /*!< USB_IP Peripheral Registers base address */
#define USB_PMAADDR           (APB1PERIPH_BASE + 0x00006000U) /*!< USB_IP Packet Memory Area base address */
#endif
#if defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define CAN_BASE              (APB1PERIPH_BASE + 0x00006400U)
#endif
#define PWR_BASE              (APB1PERIPH_BASE + 0x00007000U)
#define DAC1_BASE             (APB1PERIPH_BASE + 0x00007400U)
#if defined(STM32F303x8) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F373xC) || defined(STM32F378xx)
#define DAC2_BASE             (APB1PERIPH_BASE + 0x00009800U)
#endif
#define DAC_BASE               DAC1_BASE
#if defined (STM32F378xx) || defined (STM32F373xC)
#define CEC_BASE              (APB1PERIPH_BASE + 0x00007800U)
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xE) || defined(STM32F303xE) || defined(STM32F318xx) || defined(STM32F398xx)
#define I2C3_BASE             (APB1PERIPH_BASE + 0x00007800U)
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#define TIM18_BASE            (APB1PERIPH_BASE + 0x00009C00U)
#endif

/*!< APB2 peripherals */
#define SYSCFG_BASE           (APB2PERIPH_BASE + 0x00000000U)
#if defined(STM32F373xC) || defined(STM32F378xx)
#define COMP_BASE             (APB2PERIPH_BASE + 0x0000001CU)
#else
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE)|| defined(STM32F358xx)||defined(STM32F398xx)
#define COMP1_BASE            (APB2PERIPH_BASE + 0x0000001CU)
#endif
#define COMP2_BASE            (APB2PERIPH_BASE + 0x00000020U)
#if defined(STM32F303xC) || defined(STM32F303xE) ||defined(STM32F358xx) || defined(STM32F398xx)
#define COMP3_BASE            (APB2PERIPH_BASE + 0x00000024U)
#endif
#define COMP4_BASE            (APB2PERIPH_BASE + 0x00000028U)
#if defined(STM32F303xC) || defined(STM32F303xE) ||defined(STM32F358xx) || defined(STM32F398xx)
#define COMP5_BASE            (APB2PERIPH_BASE + 0x0000002CU)
#endif
#define COMP6_BASE            (APB2PERIPH_BASE + 0x00000030U)
#if defined(STM32F303xC) || defined(STM32F303xE) ||defined(STM32F358xx) || defined(STM32F398xx)
#define COMP7_BASE            (APB2PERIPH_BASE + 0x00000034U)
#endif
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE)|| defined(STM32F358xx)||defined(STM32F398xx)
#define COMP_BASE             COMP1_BASE
#else
#define COMP_BASE             COMP2_BASE
#endif
#endif
#if defined (STM32F302xC) || defined (STM32F302xE) || defined (STM32F303xC) || defined (STM32F303xE) ||defined (STM32F358xx) ||  defined (STM32F398xx)
#define OPAMP1_BASE           (APB2PERIPH_BASE + 0x00000038U)
#endif
#if defined (STM32F301x8) || defined (STM32F302x8) || defined (STM32F318xx) || defined (STM32F302xC) || defined (STM32F303xC) || defined (STM32F358xx) || defined (STM32F303x8) || defined (STM32F334x8) || defined (STM32F328xx) || defined (STM32F302xE) || defined (STM32F303xE) || defined (STM32F398xx) 
#define OPAMP2_BASE           (APB2PERIPH_BASE + 0x0000003CU)
#endif
#if defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
#define OPAMP3_BASE           (APB2PERIPH_BASE + 0x00000040U)
#define OPAMP4_BASE           (APB2PERIPH_BASE + 0x00000044U)
#endif
#if defined (STM32F301x8) || defined (STM32F302x8) || defined (STM32F303x8)  || defined (STM32F318xx) || defined (STM32F334x8) || defined (STM32F328xx)
#define OPAMP_BASE            OPAMP2_BASE
#endif
#if defined (STM32F302xC)|| defined (STM32F303xC) || defined (STM32F358xx) || defined (STM32F302xE) || defined (STM32F303xE) || defined (STM32F398xx)
#define OPAMP_BASE            OPAMP1_BASE
#endif
#define EXTI_BASE             (APB2PERIPH_BASE + 0x00000400U)
#if defined (STM32F373xC) || defined (STM32F378xx)
#define ADC1_BASE             (APB2PERIPH_BASE + 0x00002400U)
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#else
#define TIM1_BASE             (APB2PERIPH_BASE + 0x00002C00U)
#endif
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define SPI1_BASE             (APB2PERIPH_BASE + 0x00003000U)
#endif
#if defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
#define TIM8_BASE             (APB2PERIPH_BASE + 0x00003400U)
#endif
#define USART1_BASE           (APB2PERIPH_BASE + 0x00003800U)
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define SPI4_BASE             (APB2PERIPH_BASE + 0x00003C00U)
#endif
#define TIM15_BASE            (APB2PERIPH_BASE + 0x00004000U)
#define TIM16_BASE            (APB2PERIPH_BASE + 0x00004400U)
#define TIM17_BASE            (APB2PERIPH_BASE + 0x00004800U)
#if defined(STM32F373xC) || defined(STM32F378xx)
#define TIM19_BASE            (APB2PERIPH_BASE + 0x00005C00U)
#endif
#if defined(STM32F303xE) || defined(STM32F398xx)
#define TIM20_BASE            (APB2PERIPH_BASE + 0x00005000U)
#endif
#if defined(STM32F334x8)
#define HRTIM1_BASE           (APB2PERIPH_BASE + 0x00007400U)
#define HRTIM1_TIMA_BASE      (HRTIM1_BASE + 0x00000080U)
#define HRTIM1_TIMB_BASE      (HRTIM1_BASE + 0x00000100U)
#define HRTIM1_TIMC_BASE      (HRTIM1_BASE + 0x00000180U)
#define HRTIM1_TIMD_BASE      (HRTIM1_BASE + 0x00000200U)
#define HRTIM1_TIME_BASE      (HRTIM1_BASE + 0x00000280U)
#define HRTIM1_COMMON_BASE    (HRTIM1_BASE + 0x00000380U)
#endif
#if defined (STM32F378xx) || defined (STM32F373xC)
#define SDADC1_BASE           (APB2PERIPH_BASE + 0x00006000U)
#define SDADC2_BASE           (APB2PERIPH_BASE + 0x00006400U)
#define SDADC3_BASE           (APB2PERIPH_BASE + 0x00006800U)
#endif

/*!< AHB1 peripherals */
#define DMA1_BASE             (AHB1PERIPH_BASE + 0x00000000U)
#define DMA1_Channel1_BASE    (AHB1PERIPH_BASE + 0x00000008U)
#define DMA1_Channel2_BASE    (AHB1PERIPH_BASE + 0x0000001CU)
#define DMA1_Channel3_BASE    (AHB1PERIPH_BASE + 0x00000030U)
#define DMA1_Channel4_BASE    (AHB1PERIPH_BASE + 0x00000044U)
#define DMA1_Channel5_BASE    (AHB1PERIPH_BASE + 0x00000058U)
#define DMA1_Channel6_BASE    (AHB1PERIPH_BASE + 0x0000006CU)
#define DMA1_Channel7_BASE    (AHB1PERIPH_BASE + 0x00000080U)
#if defined (STM32F302xC) || defined (STM32F303xC) || defined (STM32F358xx) || defined (STM32F302xE) || defined (STM32F303xE) || defined (STM32F398xx) || defined (STM32F373xC) || defined (STM32F378xx)
#define DMA2_BASE             (AHB1PERIPH_BASE + 0x00000400U)
#define DMA2_Channel1_BASE    (AHB1PERIPH_BASE + 0x00000408U)
#define DMA2_Channel2_BASE    (AHB1PERIPH_BASE + 0x0000041CU)
#define DMA2_Channel3_BASE    (AHB1PERIPH_BASE + 0x00000430U)
#define DMA2_Channel4_BASE    (AHB1PERIPH_BASE + 0x00000444U)
#define DMA2_Channel5_BASE    (AHB1PERIPH_BASE + 0x00000458U)
#endif
#define RCC_BASE              (AHB1PERIPH_BASE + 0x00001000U)
#define FLASH_R_BASE          (AHB1PERIPH_BASE + 0x00002000U) /*!< Flash registers base address */
#define OB_BASE               ((uint32_t)0x1FFFF800U)         /*!< Flash Option Bytes base address */
#define FLASHSIZE_BASE        ((uint32_t)0x1FFFF7CCU)         /*!< FLASH Size register base address */
#define UID_BASE              ((uint32_t)0x1FFFF7ACU)         /*!< Unique device ID register base address */
#define CRC_BASE              (AHB1PERIPH_BASE + 0x00003000U)
#define TSC_BASE              (AHB1PERIPH_BASE + 0x00004000U)

/*!< AHB2 peripherals */
#define GPIOA_BASE            (AHB2PERIPH_BASE + 0x00000000U)
#define GPIOB_BASE            (AHB2PERIPH_BASE + 0x00000400U)
#define GPIOC_BASE            (AHB2PERIPH_BASE + 0x00000800U)
#define GPIOD_BASE            (AHB2PERIPH_BASE + 0x00000C00U)
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define GPIOE_BASE            (AHB2PERIPH_BASE + 0x00001000U)
#endif
#define GPIOF_BASE            (AHB2PERIPH_BASE + 0x00001400U)
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define GPIOG_BASE            (AHB2PERIPH_BASE + 0x00001800U)
#define GPIOH_BASE            (AHB2PERIPH_BASE + 0x00001C00U)
#endif

