HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
#if defined (STM32F301x8) || defined (STM32F302x8) || defined (STM32F318xx) || defined (STM32F302xC)|| defined (STM32F303xC) || defined (STM32F358xx) || defined (STM32F303x8) || defined (STM32F334x8)|| defined (STM32F328xx) || defined (STM32F302xE) || defined (STM32F303xE) || defined (STM32F398xx)
/*!< AHB3 peripherals */
#define ADC1_BASE             (AHB3PERIPH_BASE + 0x00000000U)
#if defined (STM32F302xC) || defined (STM32F302xE) || defined (STM32F303x8) || defined (STM32F303xC)|| defined (STM32F303xE) || defined (STM32F328xx) || defined (STM32F334x8) || defined (STM32F358xx)|| defined (STM32F398xx) 
#define ADC2_BASE             (AHB3PERIPH_BASE + 0x00000100U)
#define ADC1_2_COMMON_BASE    (AHB3PERIPH_BASE + 0x00000300U)
#else
#define ADC1_COMMON_BASE      (AHB3PERIPH_BASE + 0x00000300U)
#endif
#if defined (STM32F303xE) || defined (STM32F358xx) || defined (STM32F398xx) || defined (STM32F303xC) 
#define ADC3_BASE             (AHB3PERIPH_BASE + 0x00000400U)
#define ADC4_BASE             (AHB3PERIPH_BASE + 0x00000500U)
#define ADC3_4_COMMON_BASE    (AHB3PERIPH_BASE + 0x00000700U)
#endif

#endif
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
/*!< FMC Bankx base address */
#define FMC_BANK1             (FMC_BASE)               /*!< FMC Bank1 base address   */
#define FMC_BANK1_1           (FMC_BANK1)              /*!< FMC Bank1_1 base address */
#define FMC_BANK1_2           (FMC_BANK1 + 0x04000000U) /*!< FMC Bank1_2 base address */
#define FMC_BANK1_3           (FMC_BANK1 + 0x08000000U) /*!< FMC Bank1_3 base address */
#define FMC_BANK1_4           (FMC_BANK1 + 0x0C000000U) /*!< FMC Bank1_4 base address */

#define FMC_BANK2             (FMC_BASE + 0x10000000U)  /*!< FMC Bank2 base address   */
#define FMC_BANK3             (FMC_BASE + 0x20000000U)  /*!< FMC Bank3 base address   */
#define FMC_BANK4             (FMC_BASE + 0x30000000U)  /*!< FMC Bank4 base address   */

/*!< FMC Bankx registers base address */
#define FMC_Bank1_R_BASE      (FMC_R_BASE + 0x0000U)
#define FMC_Bank1E_R_BASE     (FMC_R_BASE + 0x0104U)
#define FMC_Bank2_3_R_BASE    (FMC_R_BASE + 0x0060U)
#define FMC_Bank4_R_BASE      (FMC_R_BASE + 0x00A0U)

#endif
#define DBGMCU_BASE          ((uint32_t)0xE0042000U) /*!< Debug MCU registers base address */
/**
  * @}
  */

/** @addtogroup Peripheral_declaration
  * @{
  */
#if defined(STM32F334x8)
#define HRTIM1              ((HRTIM_TypeDef *) HRTIM1_BASE)
#define HRTIM1_TIMA         ((HRTIM_TIM_TypeDef *) HRTIM1_TIMA_BASE)
#define HRTIM1_TIMB         ((HRTIM_TIM_TypeDef *) HRTIM1_TIMB_BASE)
#define HRTIM1_TIMC         ((HRTIM_TIM_TypeDef *) HRTIM1_TIMC_BASE)
#define HRTIM1_TIMD         ((HRTIM_TIM_TypeDef *) HRTIM1_TIMD_BASE)
#define HRTIM1_TIME         ((HRTIM_TIM_TypeDef *) HRTIM1_TIME_BASE)
#define HRTIM1_COMMON       ((HRTIM_Common_TypeDef *) HRTIM1_COMMON_BASE)
#endif
#define TIM2                ((TIM_TypeDef *) TIM2_BASE)
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define TIM3                ((TIM_TypeDef *) TIM3_BASE)
#endif
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define TIM4                ((TIM_TypeDef *) TIM4_BASE)
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#define TIM5                ((TIM_TypeDef *) TIM5_BASE)
#endif
#define TIM6                ((TIM_TypeDef *) TIM6_BASE)
#if defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define TIM7                ((TIM_TypeDef *) TIM7_BASE)
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#define TIM12               ((TIM_TypeDef *) TIM12_BASE)
#define TIM13               ((TIM_TypeDef *) TIM13_BASE)
#define TIM14               ((TIM_TypeDef *) TIM14_BASE)
#endif
#define RTC                 ((RTC_TypeDef *) RTC_BASE)
#define WWDG                ((WWDG_TypeDef *) WWDG_BASE)
#define IWDG                ((IWDG_TypeDef *) IWDG_BASE)
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx)|| defined(STM32F398xx)
#define I2S2ext             ((SPI_TypeDef *) I2S2ext_BASE)
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx) || defined(STM32F398xx)
#define SPI2                ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                ((SPI_TypeDef *) SPI3_BASE)
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx)|| defined(STM32F398xx)
#define I2S3ext             ((SPI_TypeDef *) I2S3ext_BASE)
#endif
#define USART2              ((USART_TypeDef *) USART2_BASE)
#define USART3              ((USART_TypeDef *) USART3_BASE)
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
#define UART4               ((USART_TypeDef *) UART4_BASE)
#define UART5               ((USART_TypeDef *) UART5_BASE)
#endif
#define I2C1                ((I2C_TypeDef *) I2C1_BASE)
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx) || defined(STM32F398xx)
#define I2C2                ((I2C_TypeDef *) I2C2_BASE)
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xE) || defined(STM32F303xE) || defined(STM32F318xx) || defined(STM32F398xx)
#define I2C3                ((I2C_TypeDef *) I2C3_BASE)
#endif
#if defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define CAN                 ((CAN_TypeDef *) CAN_BASE)
#endif
#define PWR                 ((PWR_TypeDef *) PWR_BASE)
#define DAC                 ((DAC_TypeDef *) DAC_BASE)
#define DAC1                ((DAC_TypeDef *) DAC1_BASE)
#if defined(STM32F303x8) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F373xC) || defined(STM32F378xx)
#define DAC2                ((DAC_TypeDef *) DAC2_BASE)
#endif
#if defined (STM32F378xx) || defined (STM32F373xC)
#define CEC                 ((CEC_TypeDef *) CEC_BASE)
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#define COMP                ((COMP1_2_TypeDef *) COMP_BASE)
#define COMP1               ((COMP_TypeDef *) COMP_BASE)
#define COMP2               ((COMP_TypeDef *) (COMP_BASE + 0x00000002U))
#else
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE)|| defined(STM32F358xx)||defined(STM32F398xx)
#define COMP                ((COMP_TypeDef *) COMP_BASE)
#define COMP1               ((COMP_TypeDef *) COMP1_BASE)
#else
#define COMP                ((COMP_TypeDef *) COMP_BASE)
#endif
#define COMP2               ((COMP_TypeDef *) COMP2_BASE)
#if defined(STM32F303xC) || defined(STM32F303xE) ||defined(STM32F358xx) || defined(STM32F398xx)
#define COMP3               ((COMP_TypeDef *) COMP3_BASE)
#endif
#define COMP4               ((COMP_TypeDef *) COMP4_BASE)
#if defined(STM32F303xC) || defined(STM32F303xE) ||defined(STM32F358xx) || defined(STM32F398xx)
#define COMP5               ((COMP_TypeDef *) COMP5_BASE)
#endif
#define COMP6               ((COMP_TypeDef *) COMP6_BASE)
#if defined(STM32F303xC) || defined(STM32F303xE) ||defined(STM32F358xx) || defined(STM32F398xx)
#define COMP7               ((COMP_TypeDef *) COMP7_BASE)
#endif
#endif
#if defined (STM32F302xC) || defined (STM32F302xE) || defined (STM32F303xC) || defined (STM32F303xE) ||defined (STM32F358xx) ||  defined (STM32F398xx)
#define OPAMP1              ((OPAMP_TypeDef *) OPAMP1_BASE)
#endif
#if defined (STM32F301x8) || defined (STM32F302x8) || defined (STM32F318xx) || defined (STM32F302xC) || defined (STM32F303xC) || defined (STM32F358xx) || defined (STM32F303x8) || defined (STM32F334x8) || defined (STM32F328xx) || defined (STM32F302xE) || defined (STM32F303xE) || defined (STM32F398xx) 
#define OPAMP               ((OPAMP_TypeDef *) OPAMP_BASE)
#define OPAMP2              ((OPAMP_TypeDef *) OPAMP2_BASE)
#if defined(STM32F303xC) || defined(STM32F303xE) ||defined(STM32F358xx) || defined(STM32F398xx)
#define OPAMP3              ((OPAMP_TypeDef *) OPAMP3_BASE)
#define OPAMP4              ((OPAMP_TypeDef *) OPAMP4_BASE)
#endif
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#define TIM18               ((TIM_TypeDef *) TIM18_BASE)
#endif
#define SYSCFG              ((SYSCFG_TypeDef *) SYSCFG_BASE)
#define EXTI                ((EXTI_TypeDef *) EXTI_BASE)
#if defined(STM32F373xC) || defined(STM32F378xx)
#else
#define TIM1                ((TIM_TypeDef *) TIM1_BASE)
#endif
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define SPI1                ((SPI_TypeDef *) SPI1_BASE)
#endif
#if defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
#define TIM8                ((TIM_TypeDef *) TIM8_BASE)
#endif
#define USART1              ((USART_TypeDef *) USART1_BASE)
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define SPI4                ((SPI_TypeDef *) SPI4_BASE)
#endif
#define TIM15               ((TIM_TypeDef *) TIM15_BASE)
#define TIM16               ((TIM_TypeDef *) TIM16_BASE)
#define TIM17               ((TIM_TypeDef *) TIM17_BASE)
#if defined(STM32F373xC) || defined(STM32F378xx)
#define TIM19               ((TIM_TypeDef *) TIM19_BASE)
#endif
#if defined(STM32F303xE) || defined(STM32F398xx)
#define TIM20               ((TIM_TypeDef *) TIM20_BASE)
#endif
#define DBGMCU              ((DBGMCU_TypeDef *) DBGMCU_BASE)
#if defined (STM32F378xx) || defined (STM32F373xC)
#define SDADC1              ((SDADC_TypeDef *) SDADC1_BASE)
#define SDADC2              ((SDADC_TypeDef *) SDADC2_BASE)
#define SDADC3              ((SDADC_TypeDef *) SDADC3_BASE)
#endif
#define DMA1                ((DMA_TypeDef *) DMA1_BASE)
#define DMA1_Channel1       ((DMA_Channel_TypeDef *) DMA1_Channel1_BASE)
#define DMA1_Channel2       ((DMA_Channel_TypeDef *) DMA1_Channel2_BASE)
#define DMA1_Channel3       ((DMA_Channel_TypeDef *) DMA1_Channel3_BASE)
#define DMA1_Channel4       ((DMA_Channel_TypeDef *) DMA1_Channel4_BASE)
#define DMA1_Channel5       ((DMA_Channel_TypeDef *) DMA1_Channel5_BASE)
#define DMA1_Channel6       ((DMA_Channel_TypeDef *) DMA1_Channel6_BASE)
#define DMA1_Channel7       ((DMA_Channel_TypeDef *) DMA1_Channel7_BASE)
#if defined (STM32F302xC) || defined (STM32F303xC) || defined (STM32F358xx) || defined (STM32F302xE) || defined (STM32F303xE) || defined (STM32F398xx) || defined (STM32F373xC) || defined (STM32F378xx)
#define DMA2                ((DMA_TypeDef *) DMA2_BASE)
#define DMA2_Channel1       ((DMA_Channel_TypeDef *) DMA2_Channel1_BASE)
#define DMA2_Channel2       ((DMA_Channel_TypeDef *) DMA2_Channel2_BASE)
#define DMA2_Channel3       ((DMA_Channel_TypeDef *) DMA2_Channel3_BASE)
#define DMA2_Channel4       ((DMA_Channel_TypeDef *) DMA2_Channel4_BASE)
#define DMA2_Channel5       ((DMA_Channel_TypeDef *) DMA2_Channel5_BASE)
#endif
#define RCC                 ((RCC_TypeDef *) RCC_BASE)
#define FLASH               ((FLASH_TypeDef *) FLASH_R_BASE)
#define OB                  ((OB_TypeDef *) OB_BASE)
#define CRC                 ((CRC_TypeDef *) CRC_BASE)
#define TSC                 ((TSC_TypeDef *) TSC_BASE)
#define GPIOA               ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB               ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC               ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD               ((GPIO_TypeDef *) GPIOD_BASE)
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define GPIOE               ((GPIO_TypeDef *) GPIOE_BASE)
#endif
#define GPIOF               ((GPIO_TypeDef *) GPIOF_BASE)
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define GPIOG               ((GPIO_TypeDef *) GPIOG_BASE)
#define GPIOH               ((GPIO_TypeDef *) GPIOH_BASE)
#endif
#define ADC1                ((ADC_TypeDef *) ADC1_BASE)
#if defined (STM32F302xC) || defined (STM32F302xE) || defined (STM32F303x8) || defined (STM32F303xC)|| defined (STM32F303xE) || defined (STM32F328xx) || defined (STM32F334x8) || defined (STM32F358xx)|| defined (STM32F398xx) 
#define ADC2                ((ADC_TypeDef *) ADC2_BASE)
#if defined (STM32F303xE) || defined (STM32F358xx) || defined (STM32F398xx) || defined (STM32F303xC) 
#define ADC3                ((ADC_TypeDef *) ADC3_BASE)
#define ADC4                ((ADC_TypeDef *) ADC4_BASE)
#endif
#endif
#if defined (STM32F302xC) || defined (STM32F302xE) || defined (STM32F303x8) || defined (STM32F303xC)|| defined (STM32F303xE) || defined (STM32F328xx) || defined (STM32F334x8) || defined (STM32F358xx)|| defined (STM32F398xx) 
#define ADC12_COMMON        ((ADC_Common_TypeDef *) ADC1_2_COMMON_BASE)
#if defined (STM32F303xE) || defined (STM32F358xx) || defined (STM32F398xx) || defined (STM32F303xC) 
#define ADC34_COMMON        ((ADC_Common_TypeDef *) ADC3_4_COMMON_BASE)
#endif
#endif
#if defined (STM32F373xC) || defined (STM32F378xx)
#define ADC1_COMMON         ((ADC_Common_TypeDef *) ADC1_BASE)
#endif
#if defined (STM32F302xC) || defined (STM32F302xE) || defined (STM32F303x8) || defined (STM32F303xC)|| defined (STM32F303xE) || defined (STM32F328xx) || defined (STM32F334x8) || defined (STM32F358xx)|| defined (STM32F398xx) 
/* Legacy defines */
#define ADC1_2_COMMON       ADC12_COMMON
#if defined (STM32F303xE) || defined (STM32F358xx) || defined (STM32F398xx) || defined (STM32F303xC) 
#define ADC3_4_COMMON       ADC34_COMMON
#endif
#endif
#if defined (STM32F301x8) || defined (STM32F302x8) || defined (STM32F318xx)
#define ADC1_COMMON         ((ADC_Common_TypeDef *) ADC1_COMMON_BASE)
#endif
#if defined (STM32F302x8) || defined (STM32F302xC) || defined (STM32F373xC) || defined (STM32F303xC) || defined (STM32F302xE) || defined (STM32F303xE)
#define USB                 ((USB_TypeDef *) USB_BASE)
#endif
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define FMC_Bank1           ((FMC_Bank1_TypeDef *) FMC_Bank1_R_BASE)
#define FMC_Bank1E          ((FMC_Bank1E_TypeDef *) FMC_Bank1E_R_BASE)
#define FMC_Bank2_3         ((FMC_Bank2_3_TypeDef *) FMC_Bank2_3_R_BASE)
#define FMC_Bank4           ((FMC_Bank4_TypeDef *) FMC_Bank4_R_BASE)
#endif

/**
  * @}
  */

/** @addtogroup Exported_constants
  * @{
  */

  /** @addtogroup Peripheral_Registers_Bits_Definition
  * @{
  */

/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter SAR (ADC)               */
/*                                                                            */
/******************************************************************************/

