HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
/*
 * @brief Specific device feature definitions (not present on all devices in the STM32F3 family)
 */
#if defined (STM32F302xC) || defined (STM32F302xE) || defined (STM32F303x8) || defined (STM32F303xC) || defined (STM32F303xE) || defined (STM32F328xx) || defined (STM32F334x8) || defined (STM32F358xx) || defined (STM32F398xx)
#define ADC_MULTIMODE_SUPPORT                          /*!< ADC feature available only on specific devices: multimode available on devices with several ADC instances */
#endif
#if defined (STM32F301x8) || defined (STM32F302x8) || defined (STM32F318xx) || defined (STM32F373xC) || defined (STM32F378xx)
/* Note: No specific macro feature on this device */
#endif

#if defined (STM32F378xx) || defined (STM32F373xC)
/********************  Bit definition for ADC_SR register  ********************/
#define  ADC_SR_AWD                          ((uint32_t)0x00000001U)  /*!< Analog watchdog flag */
#define  ADC_SR_EOC                          ((uint32_t)0x00000002U)  /*!< End of conversion */
#define  ADC_SR_JEOC                         ((uint32_t)0x00000004U)  /*!< Injected channel end of conversion */
#define  ADC_SR_JSTRT                        ((uint32_t)0x00000008U)  /*!< Injected channel Start flag */
#define  ADC_SR_STRT                         ((uint32_t)0x00000010U)  /*!< Regular channel Start flag */

/*******************  Bit definition for ADC_CR1 register  ********************/
#define  ADC_CR1_AWDCH                       ((uint32_t)0x0000001FU)  /*!< AWDCH[4:0] bits (Analog watchdog channel select bits) */
#define  ADC_CR1_AWDCH_0                     ((uint32_t)0x00000001U)  /*!< Bit 0 */
#define  ADC_CR1_AWDCH_1                     ((uint32_t)0x00000002U)  /*!< Bit 1 */
#define  ADC_CR1_AWDCH_2                     ((uint32_t)0x00000004U)  /*!< Bit 2 */
#define  ADC_CR1_AWDCH_3                     ((uint32_t)0x00000008U)  /*!< Bit 3 */
#define  ADC_CR1_AWDCH_4                     ((uint32_t)0x00000010U)  /*!< Bit 4 */
#define  ADC_CR1_EOCIE                       ((uint32_t)0x00000020U)  /*!< Interrupt enable for EOC */
#define  ADC_CR1_AWDIE                       ((uint32_t)0x00000040U)  /*!< Analog Watchdog interrupt enable */
#define  ADC_CR1_JEOCIE                      ((uint32_t)0x00000080U)  /*!< Interrupt enable for injected channels */
#define  ADC_CR1_SCAN                        ((uint32_t)0x00000100U)  /*!< Scan mode */
#define  ADC_CR1_AWDSGL                      ((uint32_t)0x00000200U)  /*!< Enable the watchdog on a single channel in scan mode */
#define  ADC_CR1_JAUTO                       ((uint32_t)0x00000400U)  /*!< Automatic injected group conversion */
#define  ADC_CR1_DISCEN                      ((uint32_t)0x00000800U)  /*!< Discontinuous mode on regular channels */
#define  ADC_CR1_JDISCEN                     ((uint32_t)0x00001000U)  /*!< Discontinuous mode on injected channels */
#define  ADC_CR1_DISCNUM                     ((uint32_t)0x0000E000U)  /*!< DISCNUM[2:0] bits (Discontinuous mode channel count) */
#define  ADC_CR1_DISCNUM_0                   ((uint32_t)0x00002000U)  /*!< Bit 0 */
#define  ADC_CR1_DISCNUM_1                   ((uint32_t)0x00004000U)  /*!< Bit 1 */
#define  ADC_CR1_DISCNUM_2                   ((uint32_t)0x00008000U)  /*!< Bit 2 */
#define  ADC_CR1_JAWDEN                      ((uint32_t)0x00400000U)  /*!< Analog watchdog enable on injected channels */
#define  ADC_CR1_AWDEN                       ((uint32_t)0x00800000U)  /*!< Analog watchdog enable on regular channels */

/*******************  Bit definition for ADC_CR2 register  ********************/
#define  ADC_CR2_ADON                        ((uint32_t)0x00000001U)  /*!< A/D Converter ON / OFF */
#define  ADC_CR2_CONT                        ((uint32_t)0x00000002U)  /*!< Continuous Conversion */
#define  ADC_CR2_CAL                         ((uint32_t)0x00000004U)  /*!< A/D Calibration */
#define  ADC_CR2_RSTCAL                      ((uint32_t)0x00000008U)  /*!< Reset Calibration */
#define  ADC_CR2_DMA                         ((uint32_t)0x00000100U)  /*!< Direct Memory access mode */
#define  ADC_CR2_ALIGN                       ((uint32_t)0x00000800U)  /*!< Data Alignment */
#define  ADC_CR2_JEXTSEL                     ((uint32_t)0x00007000U)  /*!< JEXTSEL[2:0] bits (External event select for injected group) */
#define  ADC_CR2_JEXTSEL_0                   ((uint32_t)0x00001000U)  /*!< Bit 0 */
#define  ADC_CR2_JEXTSEL_1                   ((uint32_t)0x00002000U)  /*!< Bit 1 */
#define  ADC_CR2_JEXTSEL_2                   ((uint32_t)0x00004000U)  /*!< Bit 2 */
#define  ADC_CR2_JEXTTRIG                    ((uint32_t)0x00008000U)  /*!< External Trigger Conversion mode for injected channels */
#define  ADC_CR2_EXTSEL                      ((uint32_t)0x000E0000U)  /*!< EXTSEL[2:0] bits (External Event Select for regular group) */
#define  ADC_CR2_EXTSEL_0                    ((uint32_t)0x00020000U)  /*!< Bit 0 */
#define  ADC_CR2_EXTSEL_1                    ((uint32_t)0x00040000U)  /*!< Bit 1 */
#define  ADC_CR2_EXTSEL_2                    ((uint32_t)0x00080000U)  /*!< Bit 2 */
#define  ADC_CR2_EXTTRIG                     ((uint32_t)0x00100000U)  /*!< External Trigger Conversion mode for regular channels */
#define  ADC_CR2_JSWSTART                    ((uint32_t)0x00200000U)  /*!< Start Conversion of injected channels */
#define  ADC_CR2_SWSTART                     ((uint32_t)0x00400000U)  /*!< Start Conversion of regular channels */
#define  ADC_CR2_TSVREFE                     ((uint32_t)0x00800000U)  /*!< Temperature Sensor and VREFINT Enable */

/******************  Bit definition for ADC_SMPR1 register  *******************/
#define  ADC_SMPR1_SMP10                     ((uint32_t)0x00000007U)  /*!< SMP10[2:0] bits (Channel 10 Sample time selection) */
#define  ADC_SMPR1_SMP10_0                   ((uint32_t)0x00000001U)  /*!< Bit 0 */
#define  ADC_SMPR1_SMP10_1                   ((uint32_t)0x00000002U)  /*!< Bit 1 */
#define  ADC_SMPR1_SMP10_2                   ((uint32_t)0x00000004U)  /*!< Bit 2 */
#define  ADC_SMPR1_SMP11                     ((uint32_t)0x00000038U)  /*!< SMP11[2:0] bits (Channel 11 Sample time selection) */
#define  ADC_SMPR1_SMP11_0                   ((uint32_t)0x00000008U)  /*!< Bit 0 */
#define  ADC_SMPR1_SMP11_1                   ((uint32_t)0x00000010U)  /*!< Bit 1 */
#define  ADC_SMPR1_SMP11_2                   ((uint32_t)0x00000020U)  /*!< Bit 2 */
#define  ADC_SMPR1_SMP12                     ((uint32_t)0x000001C0U)  /*!< SMP12[2:0] bits (Channel 12 Sample time selection) */
#define  ADC_SMPR1_SMP12_0                   ((uint32_t)0x00000040U)  /*!< Bit 0 */
#define  ADC_SMPR1_SMP12_1                   ((uint32_t)0x00000080U)  /*!< Bit 1 */
#define  ADC_SMPR1_SMP12_2                   ((uint32_t)0x00000100U)  /*!< Bit 2 */
#define  ADC_SMPR1_SMP13                     ((uint32_t)0x00000E00U)  /*!< SMP13[2:0] bits (Channel 13 Sample time selection) */
#define  ADC_SMPR1_SMP13_0                   ((uint32_t)0x00000200U)  /*!< Bit 0 */
#define  ADC_SMPR1_SMP13_1                   ((uint32_t)0x00000400U)  /*!< Bit 1 */
#define  ADC_SMPR1_SMP13_2                   ((uint32_t)0x00000800U)  /*!< Bit 2 */
#define  ADC_SMPR1_SMP14                     ((uint32_t)0x00007000U)  /*!< SMP14[2:0] bits (Channel 14 Sample time selection) */
#define  ADC_SMPR1_SMP14_0                   ((uint32_t)0x00001000U)  /*!< Bit 0 */
#define  ADC_SMPR1_SMP14_1                   ((uint32_t)0x00002000U)  /*!< Bit 1 */
#define  ADC_SMPR1_SMP14_2                   ((uint32_t)0x00004000U)  /*!< Bit 2 */
#define  ADC_SMPR1_SMP15                     ((uint32_t)0x00038000U)  /*!< SMP15[2:0] bits (Channel 15 Sample time selection) */
#define  ADC_SMPR1_SMP15_0                   ((uint32_t)0x00008000U)  /*!< Bit 0 */
#define  ADC_SMPR1_SMP15_1                   ((uint32_t)0x00010000U)  /*!< Bit 1 */
#define  ADC_SMPR1_SMP15_2                   ((uint32_t)0x00020000U)  /*!< Bit 2 */
#define  ADC_SMPR1_SMP16                     ((uint32_t)0x001C0000U)  /*!< SMP16[2:0] bits (Channel 16 Sample time selection) */
#define  ADC_SMPR1_SMP16_0                   ((uint32_t)0x00040000U)  /*!< Bit 0 */
#define  ADC_SMPR1_SMP16_1                   ((uint32_t)0x00080000U)  /*!< Bit 1 */
#define  ADC_SMPR1_SMP16_2                   ((uint32_t)0x00100000U)  /*!< Bit 2 */
#define  ADC_SMPR1_SMP17                     ((uint32_t)0x00E00000U)  /*!< SMP17[2:0] bits (Channel 17 Sample time selection) */
#define  ADC_SMPR1_SMP17_0                   ((uint32_t)0x00200000U)  /*!< Bit 0 */
#define  ADC_SMPR1_SMP17_1                   ((uint32_t)0x00400000U)  /*!< Bit 1 */
#define  ADC_SMPR1_SMP17_2                   ((uint32_t)0x00800000U)  /*!< Bit 2 */
#define  ADC_SMPR1_SMP18                     ((uint32_t)0x07000000U)  /*!< SMP18[2:0] bits (Channel 18 Sample time selection) */
#define  ADC_SMPR1_SMP18_0                   ((uint32_t)0x01000000U)  /*!< Bit 0 */
#define  ADC_SMPR1_SMP18_1                   ((uint32_t)0x02000000U)  /*!< Bit 1 */
#define  ADC_SMPR1_SMP18_2                   ((uint32_t)0x04000000U)  /*!< Bit 2 */

