HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
#define ADC34_CCR_DELAY             ((uint32_t)0x00000F00U) /*!< Delay between 2 sampling phases */
#define ADC34_CCR_DELAY_0           ((uint32_t)0x00000100U) /*!< DELAY bit 0 */
#define ADC34_CCR_DELAY_1           ((uint32_t)0x00000200U) /*!< DELAY bit 1 */
#define ADC34_CCR_DELAY_2           ((uint32_t)0x00000400U) /*!< DELAY bit 2 */
#define ADC34_CCR_DELAY_3           ((uint32_t)0x00000800U) /*!< DELAY bit 3 */

#define ADC34_CCR_DMACFG            ((uint32_t)0x00002000U) /*!< DMA configuration for multi-ADC mode */
#define ADC34_CCR_MDMA              ((uint32_t)0x0000C000U) /*!< DMA mode for multi-ADC mode */
#define ADC34_CCR_MDMA_0            ((uint32_t)0x00004000U) /*!< MDMA bit 0 */
#define ADC34_CCR_MDMA_1            ((uint32_t)0x00008000U) /*!< MDMA bit 1 */

#define ADC34_CCR_CKMODE            ((uint32_t)0x00030000U) /*!< ADC clock mode */
#define ADC34_CCR_CKMODE_0          ((uint32_t)0x00010000U) /*!< CKMODE bit 0 */
#define ADC34_CCR_CKMODE_1          ((uint32_t)0x00020000U) /*!< CKMODE bit 1 */

#define ADC34_CCR_VREFEN            ((uint32_t)0x00400000U) /*!< VREFINT enable */
#define ADC34_CCR_TSEN              ((uint32_t)0x00800000U) /*!< Temperature sensor enable */
#define ADC34_CCR_VBATEN            ((uint32_t)0x01000000U) /*!< VBAT enable */

#endif
/***************  Bit definition for ADC12_COMMON_CDR register  ***************/
#define ADC12_CDR_RDATA_MST         ((uint32_t)0x0000FFFFU) /*!< Regular Data of the master ADC */
#define ADC12_CDR_RDATA_MST_0       ((uint32_t)0x00000001U) /*!< RDATA_MST bit 0 */
#define ADC12_CDR_RDATA_MST_1       ((uint32_t)0x00000002U) /*!< RDATA_MST bit 1 */
#define ADC12_CDR_RDATA_MST_2       ((uint32_t)0x00000004U) /*!< RDATA_MST bit 2 */
#define ADC12_CDR_RDATA_MST_3       ((uint32_t)0x00000008U) /*!< RDATA_MST bit 3 */
#define ADC12_CDR_RDATA_MST_4       ((uint32_t)0x00000010U) /*!< RDATA_MST bit 4 */
#define ADC12_CDR_RDATA_MST_5       ((uint32_t)0x00000020U) /*!< RDATA_MST bit 5 */
#define ADC12_CDR_RDATA_MST_6       ((uint32_t)0x00000040U) /*!< RDATA_MST bit 6 */
#define ADC12_CDR_RDATA_MST_7       ((uint32_t)0x00000080U) /*!< RDATA_MST bit 7 */
#define ADC12_CDR_RDATA_MST_8       ((uint32_t)0x00000100U) /*!< RDATA_MST bit 8 */
#define ADC12_CDR_RDATA_MST_9       ((uint32_t)0x00000200U) /*!< RDATA_MST bit 9 */
#define ADC12_CDR_RDATA_MST_10      ((uint32_t)0x00000400U) /*!< RDATA_MST bit 10 */
#define ADC12_CDR_RDATA_MST_11      ((uint32_t)0x00000800U) /*!< RDATA_MST bit 11 */
#define ADC12_CDR_RDATA_MST_12      ((uint32_t)0x00001000U) /*!< RDATA_MST bit 12 */
#define ADC12_CDR_RDATA_MST_13      ((uint32_t)0x00002000U) /*!< RDATA_MST bit 13 */
#define ADC12_CDR_RDATA_MST_14      ((uint32_t)0x00004000U) /*!< RDATA_MST bit 14 */
#define ADC12_CDR_RDATA_MST_15      ((uint32_t)0x00008000U) /*!< RDATA_MST bit 15 */

#define ADC12_CDR_RDATA_SLV         ((uint32_t)0xFFFF0000U) /*!< Regular Data of the master ADC */
#define ADC12_CDR_RDATA_SLV_0       ((uint32_t)0x00010000U) /*!< RDATA_SLV bit 0 */
#define ADC12_CDR_RDATA_SLV_1       ((uint32_t)0x00020000U) /*!< RDATA_SLV bit 1 */
#define ADC12_CDR_RDATA_SLV_2       ((uint32_t)0x00040000U) /*!< RDATA_SLV bit 2 */
#define ADC12_CDR_RDATA_SLV_3       ((uint32_t)0x00080000U) /*!< RDATA_SLV bit 3 */
#define ADC12_CDR_RDATA_SLV_4       ((uint32_t)0x00100000U) /*!< RDATA_SLV bit 4 */
#define ADC12_CDR_RDATA_SLV_5       ((uint32_t)0x00200000U) /*!< RDATA_SLV bit 5 */
#define ADC12_CDR_RDATA_SLV_6       ((uint32_t)0x00400000U) /*!< RDATA_SLV bit 6 */
#define ADC12_CDR_RDATA_SLV_7       ((uint32_t)0x00800000U) /*!< RDATA_SLV bit 7 */
#define ADC12_CDR_RDATA_SLV_8       ((uint32_t)0x01000000U) /*!< RDATA_SLV bit 8 */
#define ADC12_CDR_RDATA_SLV_9       ((uint32_t)0x02000000U) /*!< RDATA_SLV bit 9 */
#define ADC12_CDR_RDATA_SLV_10      ((uint32_t)0x04000000U) /*!< RDATA_SLV bit 10 */
#define ADC12_CDR_RDATA_SLV_11      ((uint32_t)0x08000000U) /*!< RDATA_SLV bit 11 */
#define ADC12_CDR_RDATA_SLV_12      ((uint32_t)0x10000000U) /*!< RDATA_SLV bit 12 */
#define ADC12_CDR_RDATA_SLV_13      ((uint32_t)0x20000000U) /*!< RDATA_SLV bit 13 */
#define ADC12_CDR_RDATA_SLV_14      ((uint32_t)0x40000000U) /*!< RDATA_SLV bit 14 */
#define ADC12_CDR_RDATA_SLV_15      ((uint32_t)0x80000000U) /*!< RDATA_SLV bit 15 */
#if defined(STM32F303xC) || defined(STM32F303xE) ||defined(STM32F358xx) || defined(STM32F398xx)

/***************  Bit definition for ADC34_COMMON_CDR register  ***************/
#define ADC34_CDR_RDATA_MST         ((uint32_t)0x0000FFFFU) /*!< Regular Data of the master ADC */
#define ADC34_CDR_RDATA_MST_0       ((uint32_t)0x00000001U) /*!< RDATA_MST bit 0 */
#define ADC34_CDR_RDATA_MST_1       ((uint32_t)0x00000002U) /*!< RDATA_MST bit 1 */
#define ADC34_CDR_RDATA_MST_2       ((uint32_t)0x00000004U) /*!< RDATA_MST bit 2 */
#define ADC34_CDR_RDATA_MST_3       ((uint32_t)0x00000008U) /*!< RDATA_MST bit 3 */
#define ADC34_CDR_RDATA_MST_4       ((uint32_t)0x00000010U) /*!< RDATA_MST bit 4 */
#define ADC34_CDR_RDATA_MST_5       ((uint32_t)0x00000020U) /*!< RDATA_MST bit 5 */
#define ADC34_CDR_RDATA_MST_6       ((uint32_t)0x00000040U) /*!< RDATA_MST bit 6 */
#define ADC34_CDR_RDATA_MST_7       ((uint32_t)0x00000080U) /*!< RDATA_MST bit 7 */
#define ADC34_CDR_RDATA_MST_8       ((uint32_t)0x00000100U) /*!< RDATA_MST bit 8 */
#define ADC34_CDR_RDATA_MST_9       ((uint32_t)0x00000200U) /*!< RDATA_MST bit 9 */
#define ADC34_CDR_RDATA_MST_10      ((uint32_t)0x00000400U) /*!< RDATA_MST bit 10 */
#define ADC34_CDR_RDATA_MST_11      ((uint32_t)0x00000800U) /*!< RDATA_MST bit 11 */
#define ADC34_CDR_RDATA_MST_12      ((uint32_t)0x00001000U) /*!< RDATA_MST bit 12 */
#define ADC34_CDR_RDATA_MST_13      ((uint32_t)0x00002000U) /*!< RDATA_MST bit 13 */
#define ADC34_CDR_RDATA_MST_14      ((uint32_t)0x00004000U) /*!< RDATA_MST bit 14 */
#define ADC34_CDR_RDATA_MST_15      ((uint32_t)0x00008000U) /*!< RDATA_MST bit 15 */

#define ADC34_CDR_RDATA_SLV         ((uint32_t)0xFFFF0000U) /*!< Regular Data of the master ADC */
#define ADC34_CDR_RDATA_SLV_0       ((uint32_t)0x00010000U) /*!< RDATA_SLV bit 0 */
#define ADC34_CDR_RDATA_SLV_1       ((uint32_t)0x00020000U) /*!< RDATA_SLV bit 1 */
#define ADC34_CDR_RDATA_SLV_2       ((uint32_t)0x00040000U) /*!< RDATA_SLV bit 2 */
#define ADC34_CDR_RDATA_SLV_3       ((uint32_t)0x00080000U) /*!< RDATA_SLV bit 3 */
#define ADC34_CDR_RDATA_SLV_4       ((uint32_t)0x00100000U) /*!< RDATA_SLV bit 4 */
#define ADC34_CDR_RDATA_SLV_5       ((uint32_t)0x00200000U) /*!< RDATA_SLV bit 5 */
#define ADC34_CDR_RDATA_SLV_6       ((uint32_t)0x00400000U) /*!< RDATA_SLV bit 6 */
#define ADC34_CDR_RDATA_SLV_7       ((uint32_t)0x00800000U) /*!< RDATA_SLV bit 7 */
#define ADC34_CDR_RDATA_SLV_8       ((uint32_t)0x01000000U) /*!< RDATA_SLV bit 8 */
#define ADC34_CDR_RDATA_SLV_9       ((uint32_t)0x02000000U) /*!< RDATA_SLV bit 9 */
#define ADC34_CDR_RDATA_SLV_10      ((uint32_t)0x04000000U) /*!< RDATA_SLV bit 10 */
#define ADC34_CDR_RDATA_SLV_11      ((uint32_t)0x08000000U) /*!< RDATA_SLV bit 11 */
#define ADC34_CDR_RDATA_SLV_12      ((uint32_t)0x10000000U) /*!< RDATA_SLV bit 12 */
#define ADC34_CDR_RDATA_SLV_13      ((uint32_t)0x20000000U) /*!< RDATA_SLV bit 13 */
#define ADC34_CDR_RDATA_SLV_14      ((uint32_t)0x40000000U) /*!< RDATA_SLV bit 14 */
#define ADC34_CDR_RDATA_SLV_15      ((uint32_t)0x80000000U) /*!< RDATA_SLV bit 15 */
#endif
#else
/***************  Bit definition for ADC1_COMMON_CSR register  ***************/
#define ADC1_CSR_ADRDY_MST         ((uint32_t)0x00000001U) /*!< Master ADC ready */
#define ADC1_CSR_ADRDY_EOSMP_MST   ((uint32_t)0x00000002U) /*!< End of sampling phase flag of the master ADC */
#define ADC1_CSR_ADRDY_EOC_MST     ((uint32_t)0x00000004U) /*!< End of regular conversion of the master ADC */
#define ADC1_CSR_ADRDY_EOS_MST     ((uint32_t)0x00000008U) /*!< End of regular sequence flag of the master ADC */
#define ADC1_CSR_ADRDY_OVR_MST     ((uint32_t)0x00000010U) /*!< Overrun flag of the master ADC */
#define ADC1_CSR_ADRDY_JEOC_MST    ((uint32_t)0x00000020U) /*!< End of injected conversion of the master ADC */
#define ADC1_CSR_ADRDY_JEOS_MST    ((uint32_t)0x00000040U) /*!< End of injected sequence flag of the master ADC */
#define ADC1_CSR_AWD1_MST          ((uint32_t)0x00000080U) /*!< Analog watchdog 1 flag of the master ADC */
#define ADC1_CSR_AWD2_MST          ((uint32_t)0x00000100U) /*!< Analog watchdog 2 flag of the master ADC */
#define ADC1_CSR_AWD3_MST          ((uint32_t)0x00000200U) /*!< Analog watchdog 3 flag of the master ADC */
#define ADC1_CSR_JQOVF_MST         ((uint32_t)0x00000400U) /*!< Injected context queue overflow flag of the master ADC */
#define ADC1_CSR_ADRDY_SLV         ((uint32_t)0x00010000U) /*!< Slave ADC ready */
#define ADC1_CSR_ADRDY_EOSMP_SLV   ((uint32_t)0x00020000U) /*!< End of sampling phase flag of the slave ADC */
#define ADC1_CSR_ADRDY_EOC_SLV     ((uint32_t)0x00040000U) /*!< End of regular conversion of the slave ADC */
#define ADC1_CSR_ADRDY_EOS_SLV     ((uint32_t)0x00080000U) /*!< End of regular sequence flag of the slave ADC */
#define ADC1_CSR_ADRDY_OVR_SLV     ((uint32_t)0x00100000U) /*!< Overrun flag of the slave ADC */
#define ADC1_CSR_ADRDY_JEOC_SLV    ((uint32_t)0x00200000U) /*!< End of injected conversion of the slave ADC */
#define ADC1_CSR_ADRDY_JEOS_SLV    ((uint32_t)0x00400000U) /*!< End of injected sequence flag of the slave ADC */
#define ADC1_CSR_AWD1_SLV          ((uint32_t)0x00800000U) /*!< Analog watchdog 1 flag of the slave ADC */
#define ADC1_CSR_AWD2_SLV          ((uint32_t)0x01000000U) /*!< Analog watchdog 2 flag of the slave ADC */
#define ADC1_CSR_AWD3_SLV          ((uint32_t)0x02000000U) /*!< Analog watchdog 3 flag of the slave ADC */
#define ADC1_CSR_JQOVF_SLV         ((uint32_t)0x04000000U) /*!< Injected context queue overflow flag of the slave ADC */

/***************  Bit definition for ADC1_COMMON_CCR register  ***************/
#define ADC1_CCR_MULTI             ((uint32_t)0x0000001FU) /*!< Multi ADC mode selection */
#define ADC1_CCR_MULTI_0           ((uint32_t)0x00000001U) /*!< MULTI bit 0 */
#define ADC1_CCR_MULTI_1           ((uint32_t)0x00000002U) /*!< MULTI bit 1 */
#define ADC1_CCR_MULTI_2           ((uint32_t)0x00000004U) /*!< MULTI bit 2 */
#define ADC1_CCR_MULTI_3           ((uint32_t)0x00000008U) /*!< MULTI bit 3 */
#define ADC1_CCR_MULTI_4           ((uint32_t)0x00000010U) /*!< MULTI bit 4 */
#define ADC1_CCR_DELAY             ((uint32_t)0x00000F00U) /*!< Delay between 2 sampling phases */
#define ADC1_CCR_DELAY_0           ((uint32_t)0x00000100U) /*!< DELAY bit 0 */
#define ADC1_CCR_DELAY_1           ((uint32_t)0x00000200U) /*!< DELAY bit 1 */
#define ADC1_CCR_DELAY_2           ((uint32_t)0x00000400U) /*!< DELAY bit 2 */
#define ADC1_CCR_DELAY_3           ((uint32_t)0x00000800U) /*!< DELAY bit 3 */
#define ADC1_CCR_DMACFG            ((uint32_t)0x00002000U) /*!< DMA configuration for multi-ADC mode */
#define ADC1_CCR_MDMA              ((uint32_t)0x0000C000U) /*!< DMA mode for multi-ADC mode */
#define ADC1_CCR_MDMA_0            ((uint32_t)0x00004000U) /*!< MDMA bit 0 */
#define ADC1_CCR_MDMA_1            ((uint32_t)0x00008000U) /*!< MDMA bit 1 */
#define ADC1_CCR_CKMODE            ((uint32_t)0x00030000U) /*!< ADC clock mode */
#define ADC1_CCR_CKMODE_0          ((uint32_t)0x00010000U) /*!< CKMODE bit 0 */
#define ADC1_CCR_CKMODE_1          ((uint32_t)0x00020000U) /*!< CKMODE bit 1 */
#define ADC1_CCR_VREFEN            ((uint32_t)0x00400000U) /*!< VREFINT enable */
#define ADC1_CCR_TSEN              ((uint32_t)0x00800000U) /*!< Temperature sensor enable */
#define ADC1_CCR_VBATEN            ((uint32_t)0x01000000U) /*!< VBAT enable */

