HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
/***************  Bit definition for ADC1_COMMON_CDR register  ***************/
#define ADC1_CDR_RDATA_MST         ((uint32_t)0x0000FFFFU) /*!< Regular Data of the master ADC */
#define ADC1_CDR_RDATA_MST_0       ((uint32_t)0x00000001U) /*!< RDATA_MST bit 0 */
#define ADC1_CDR_RDATA_MST_1       ((uint32_t)0x00000002U) /*!< RDATA_MST bit 1 */
#define ADC1_CDR_RDATA_MST_2       ((uint32_t)0x00000004U) /*!< RDATA_MST bit 2 */
#define ADC1_CDR_RDATA_MST_3       ((uint32_t)0x00000008U) /*!< RDATA_MST bit 3 */
#define ADC1_CDR_RDATA_MST_4       ((uint32_t)0x00000010U) /*!< RDATA_MST bit 4 */
#define ADC1_CDR_RDATA_MST_5       ((uint32_t)0x00000020U) /*!< RDATA_MST bit 5 */
#define ADC1_CDR_RDATA_MST_6       ((uint32_t)0x00000040U) /*!< RDATA_MST bit 6 */
#define ADC1_CDR_RDATA_MST_7       ((uint32_t)0x00000080U) /*!< RDATA_MST bit 7 */
#define ADC1_CDR_RDATA_MST_8       ((uint32_t)0x00000100U) /*!< RDATA_MST bit 8 */
#define ADC1_CDR_RDATA_MST_9       ((uint32_t)0x00000200U) /*!< RDATA_MST bit 9 */
#define ADC1_CDR_RDATA_MST_10      ((uint32_t)0x00000400U) /*!< RDATA_MST bit 10 */
#define ADC1_CDR_RDATA_MST_11      ((uint32_t)0x00000800U) /*!< RDATA_MST bit 11 */
#define ADC1_CDR_RDATA_MST_12      ((uint32_t)0x00001000U) /*!< RDATA_MST bit 12 */
#define ADC1_CDR_RDATA_MST_13      ((uint32_t)0x00002000U) /*!< RDATA_MST bit 13 */
#define ADC1_CDR_RDATA_MST_14      ((uint32_t)0x00004000U) /*!< RDATA_MST bit 14 */
#define ADC1_CDR_RDATA_MST_15      ((uint32_t)0x00008000U) /*!< RDATA_MST bit 15 */

#define ADC1_CDR_RDATA_SLV         ((uint32_t)0xFFFF0000U) /*!< Regular Data of the master ADC */
#define ADC1_CDR_RDATA_SLV_0       ((uint32_t)0x00010000U) /*!< RDATA_SLV bit 0 */
#define ADC1_CDR_RDATA_SLV_1       ((uint32_t)0x00020000U) /*!< RDATA_SLV bit 1 */
#define ADC1_CDR_RDATA_SLV_2       ((uint32_t)0x00040000U) /*!< RDATA_SLV bit 2 */
#define ADC1_CDR_RDATA_SLV_3       ((uint32_t)0x00080000U) /*!< RDATA_SLV bit 3 */
#define ADC1_CDR_RDATA_SLV_4       ((uint32_t)0x00100000U) /*!< RDATA_SLV bit 4 */
#define ADC1_CDR_RDATA_SLV_5       ((uint32_t)0x00200000U) /*!< RDATA_SLV bit 5 */
#define ADC1_CDR_RDATA_SLV_6       ((uint32_t)0x00400000U) /*!< RDATA_SLV bit 6 */
#define ADC1_CDR_RDATA_SLV_7       ((uint32_t)0x00800000U) /*!< RDATA_SLV bit 7 */
#define ADC1_CDR_RDATA_SLV_8       ((uint32_t)0x01000000U) /*!< RDATA_SLV bit 8 */
#define ADC1_CDR_RDATA_SLV_9       ((uint32_t)0x02000000U) /*!< RDATA_SLV bit 9 */
#define ADC1_CDR_RDATA_SLV_10      ((uint32_t)0x04000000U) /*!< RDATA_SLV bit 10 */
#define ADC1_CDR_RDATA_SLV_11      ((uint32_t)0x08000000U) /*!< RDATA_SLV bit 11 */
#define ADC1_CDR_RDATA_SLV_12      ((uint32_t)0x10000000U) /*!< RDATA_SLV bit 12 */
#define ADC1_CDR_RDATA_SLV_13      ((uint32_t)0x20000000U) /*!< RDATA_SLV bit 13 */
#define ADC1_CDR_RDATA_SLV_14      ((uint32_t)0x40000000U) /*!< RDATA_SLV bit 14 */
#define ADC1_CDR_RDATA_SLV_15      ((uint32_t)0x80000000U) /*!< RDATA_SLV bit 15 */
#endif

/********************  Bit definition for ADC_CSR register  *******************/
#define ADC_CSR_ADRDY_MST       ((uint32_t)0x00000001U) /*!< ADC multimode master ready flag */
#define ADC_CSR_EOSMP_MST       ((uint32_t)0x00000002U) /*!< ADC multimode master group regular end of sampling flag */
#define ADC_CSR_EOC_MST         ((uint32_t)0x00000004U) /*!< ADC multimode master group regular end of unitary conversion flag */
#define ADC_CSR_EOS_MST         ((uint32_t)0x00000008U) /*!< ADC multimode master group regular end of sequence conversions flag */
#define ADC_CSR_OVR_MST         ((uint32_t)0x00000010U) /*!< ADC multimode master group regular overrun flag */
#define ADC_CSR_JEOC_MST        ((uint32_t)0x00000020U) /*!< ADC multimode master group injected end of unitary conversion flag */
#define ADC_CSR_JEOS_MST        ((uint32_t)0x00000040U) /*!< ADC multimode master group injected end of sequence conversions flag */
#define ADC_CSR_AWD1_MST        ((uint32_t)0x00000080U) /*!< ADC multimode master analog watchdog 1 flag */
#define ADC_CSR_AWD2_MST        ((uint32_t)0x00000100U) /*!< ADC multimode master analog watchdog 2 flag */
#define ADC_CSR_AWD3_MST        ((uint32_t)0x00000200U) /*!< ADC multimode master analog watchdog 3 flag */
#define ADC_CSR_JQOVF_MST       ((uint32_t)0x00000400U) /*!< ADC multimode master group injected contexts queue overflow flag */

#define ADC_CSR_ADRDY_SLV       ((uint32_t)0x00010000U) /*!< ADC multimode slave ready flag */
#define ADC_CSR_EOSMP_SLV       ((uint32_t)0x00020000U) /*!< ADC multimode slave group regular end of sampling flag */
#define ADC_CSR_EOC_SLV         ((uint32_t)0x00040000U) /*!< ADC multimode slave group regular end of unitary conversion flag */
#define ADC_CSR_EOS_SLV         ((uint32_t)0x00080000U) /*!< ADC multimode slave group regular end of sequence conversions flag */
#define ADC_CSR_OVR_SLV         ((uint32_t)0x00100000U) /*!< ADC multimode slave group regular overrun flag */
#define ADC_CSR_JEOC_SLV        ((uint32_t)0x00200000U) /*!< ADC multimode slave group injected end of unitary conversion flag */
#define ADC_CSR_JEOS_SLV        ((uint32_t)0x00400000U) /*!< ADC multimode slave group injected end of sequence conversions flag */
#define ADC_CSR_AWD1_SLV        ((uint32_t)0x00800000U) /*!< ADC multimode slave analog watchdog 1 flag */
#define ADC_CSR_AWD2_SLV        ((uint32_t)0x01000000U) /*!< ADC multimode slave analog watchdog 2 flag */
#define ADC_CSR_AWD3_SLV        ((uint32_t)0x02000000U) /*!< ADC multimode slave analog watchdog 3 flag */
#define ADC_CSR_JQOVF_SLV       ((uint32_t)0x04000000U) /*!< ADC multimode slave group injected contexts queue overflow flag */

/* Legacy defines */
#define ADC_CSR_ADRDY_EOSMP_MST   ADC_CSR_EOSMP_MST
#define ADC_CSR_ADRDY_EOC_MST     ADC_CSR_EOC_MST
#define ADC_CSR_ADRDY_EOS_MST     ADC_CSR_EOS_MST
#define ADC_CSR_ADRDY_OVR_MST     ADC_CSR_OVR_MST
#define ADC_CSR_ADRDY_JEOC_MST    ADC_CSR_JEOC_MST
#define ADC_CSR_ADRDY_JEOS_MST    ADC_CSR_JEOS_MST

#define ADC_CSR_ADRDY_EOSMP_SLV   ADC_CSR_EOSMP_SLV
#define ADC_CSR_ADRDY_EOC_SLV     ADC_CSR_EOC_SLV
#define ADC_CSR_ADRDY_EOS_SLV     ADC_CSR_EOS_SLV
#define ADC_CSR_ADRDY_OVR_SLV     ADC_CSR_OVR_SLV
#define ADC_CSR_ADRDY_JEOC_SLV    ADC_CSR_JEOC_SLV
#define ADC_CSR_ADRDY_JEOS_SLV    ADC_CSR_JEOS_SLV

/********************  Bit definition for ADC_CCR register  *******************/
#define ADC_CCR_DUAL            ((uint32_t)0x0000001FU) /*!< ADC multimode mode selection */
#define ADC_CCR_DUAL_0          ((uint32_t)0x00000001U) /*!< bit 0 */
#define ADC_CCR_DUAL_1          ((uint32_t)0x00000002U) /*!< bit 1 */
#define ADC_CCR_DUAL_2          ((uint32_t)0x00000004U) /*!< bit 2 */
#define ADC_CCR_DUAL_3          ((uint32_t)0x00000008U) /*!< bit 3 */
#define ADC_CCR_DUAL_4          ((uint32_t)0x00000010U) /*!< bit 4 */

#define ADC_CCR_DELAY           ((uint32_t)0x00000F00U) /*!< ADC multimode delay between 2 sampling phases */
#define ADC_CCR_DELAY_0         ((uint32_t)0x00000100U) /*!< bit 0 */
#define ADC_CCR_DELAY_1         ((uint32_t)0x00000200U) /*!< bit 1 */
#define ADC_CCR_DELAY_2         ((uint32_t)0x00000400U) /*!< bit 2 */
#define ADC_CCR_DELAY_3         ((uint32_t)0x00000800U) /*!< bit 3 */

#define ADC_CCR_DMACFG          ((uint32_t)0x00002000U) /*!< ADC multimode DMA transfer configuration */

