HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
#if defined(STM32F334x8)
#define  EXTI_IMR2_IM   ((uint32_t)0x00000001U)
#else
#define  EXTI_IMR2_IM   ((uint32_t)0x0000000FU)
#endif

/*******************  Bit definition for EXTI_EMR2 ****************************/
#define  EXTI_EMR2_MR32                      ((uint32_t)0x00000001U)        /*!< Event Mask on line 32 */
#define  EXTI_EMR2_MR33                      ((uint32_t)0x00000002U)        /*!< Event Mask on line 33 */
#define  EXTI_EMR2_MR34                      ((uint32_t)0x00000004U)        /*!< Event Mask on line 34 */
#define  EXTI_EMR2_MR35                      ((uint32_t)0x00000008U)        /*!< Event Mask on line 34 */

/* References Defines */
#define  EXTI_EMR2_EM32 EXTI_EMR2_MR32
#define  EXTI_EMR2_EM33 EXTI_EMR2_MR33
#define  EXTI_EMR2_EM34 EXTI_EMR2_MR34
#define  EXTI_EMR2_EM35 EXTI_EMR2_MR35

/******************  Bit definition for EXTI_RTSR2 register ********************/
#define  EXTI_RTSR2_TR32                     ((uint32_t)0x00000001U)         /*!< Rising trigger event configuration bit of line 32 */
#define  EXTI_RTSR2_TR33                     ((uint32_t)0x00000002U)         /*!< Rising trigger event configuration bit of line 33 */

/* References Defines */
#define  EXTI_RTSR2_RT32 EXTI_RTSR2_TR32
#define  EXTI_RTSR2_RT33 EXTI_RTSR2_TR33

/******************  Bit definition for EXTI_FTSR2 register  ******************/
#define  EXTI_FTSR2_TR32                     ((uint32_t)0x00000001U)        /*!< Falling trigger event configuration bit of line 32 */
#define  EXTI_FTSR2_TR33                     ((uint32_t)0x00000002U)        /*!< Falling trigger event configuration bit of line 33 */

/* References Defines */
#define  EXTI_FTSR2_FT32 EXTI_FTSR2_TR32
#define  EXTI_FTSR2_FT33 EXTI_FTSR2_TR33

/******************  Bit definition for EXTI_SWIER2 register  *****************/
#define  EXTI_SWIER2_SWIER32                 ((uint32_t)0x00000001U)        /*!< Software Interrupt on line 32 */
#define  EXTI_SWIER2_SWIER33                 ((uint32_t)0x00000002U)        /*!< Software Interrupt on line 33 */

/* References Defines */
#define  EXTI_SWIER2_SWI32 EXTI_SWIER2_SWIER32
#define  EXTI_SWIER2_SWI33 EXTI_SWIER2_SWIER33

/*******************  Bit definition for EXTI_PR2 register  *******************/
#define  EXTI_PR2_PR32                       ((uint32_t)0x00000001U)        /*!< Pending bit for line 32 */
#define  EXTI_PR2_PR33                       ((uint32_t)0x00000002U)        /*!< Pending bit for line 33 */

/* References Defines */
#define  EXTI_PR2_PIF32 EXTI_PR2_PR32
#define  EXTI_PR2_PIF33 EXTI_PR2_PR33

#endif
/******************************************************************************/
/*                                                                            */
/*                                    FLASH                                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for FLASH_ACR register  ******************/
#define  FLASH_ACR_LATENCY                   ((uint32_t)0x00000007U)        /*!< LATENCY[2:0] bits (Latency) */
#define  FLASH_ACR_LATENCY_0                 ((uint32_t)0x00000001U)        /*!< Bit 0 */
#define  FLASH_ACR_LATENCY_1                 ((uint32_t)0x00000002U)        /*!< Bit 1 */
#define  FLASH_ACR_LATENCY_2                 ((uint32_t)0x00000004U)        /*!< Bit 2 */

#if defined(STM32F373xC) || defined(STM32F378xx)
#else
#define  FLASH_ACR_HLFCYA                    ((uint32_t)0x00000008U)        /*!< Flash Half Cycle Access Enable */
#endif
#define  FLASH_ACR_PRFTBE                    ((uint32_t)0x00000010U)        /*!< Prefetch Buffer Enable */
#define  FLASH_ACR_PRFTBS                    ((uint32_t)0x00000020U)        /*!< Prefetch Buffer Status */

/******************  Bit definition for FLASH_KEYR register  ******************/
#define  FLASH_KEYR_FKEYR                    ((uint32_t)0xFFFFFFFFU)        /*!< FPEC Key */

#if defined(STM32F373xC) || defined(STM32F378xx)
#else
#define  RDP_KEY                             ((uint32_t)0x000000A5U)        /*!< RDP Key */
#endif
#define  FLASH_KEY1                          ((uint32_t)0x45670123U)        /*!< FPEC Key1 */
#define  FLASH_KEY2                          ((uint32_t)0xCDEF89ABU)        /*!< FPEC Key2 */

/*****************  Bit definition for FLASH_OPTKEYR register  ****************/
#define  FLASH_OPTKEYR_OPTKEYR               ((uint32_t)0xFFFFFFFFU)        /*!< Option Byte Key */

#define  FLASH_OPTKEY1                       FLASH_KEY1                    /*!< Option Byte Key1 */
#define  FLASH_OPTKEY2                       FLASH_KEY2                    /*!< Option Byte Key2 */

/******************  Bit definition for FLASH_SR register  *******************/
#define  FLASH_SR_BSY                        ((uint32_t)0x00000001U)        /*!< Busy */
#define  FLASH_SR_PGERR                      ((uint32_t)0x00000004U)        /*!< Programming Error */
#define  FLASH_SR_WRPERR                     ((uint32_t)0x00000010U)        /*!< Write Protection Error */
#define  FLASH_SR_EOP                        ((uint32_t)0x00000020U)        /*!< End of operation */

/*******************  Bit definition for FLASH_CR register  *******************/
#define  FLASH_CR_PG                         ((uint32_t)0x00000001U)        /*!< Programming */
#define  FLASH_CR_PER                        ((uint32_t)0x00000002U)        /*!< Page Erase */
#define  FLASH_CR_MER                        ((uint32_t)0x00000004U)        /*!< Mass Erase */
#define  FLASH_CR_OPTPG                      ((uint32_t)0x00000010U)        /*!< Option Byte Programming */
#define  FLASH_CR_OPTER                      ((uint32_t)0x00000020U)        /*!< Option Byte Erase */
#define  FLASH_CR_STRT                       ((uint32_t)0x00000040U)        /*!< Start */
#define  FLASH_CR_LOCK                       ((uint32_t)0x00000080U)        /*!< Lock */
#define  FLASH_CR_OPTWRE                     ((uint32_t)0x00000200U)        /*!< Option Bytes Write Enable */
#define  FLASH_CR_ERRIE                      ((uint32_t)0x00000400U)        /*!< Error Interrupt Enable */
#define  FLASH_CR_EOPIE                      ((uint32_t)0x00001000U)        /*!< End of operation interrupt enable */
#define  FLASH_CR_OBL_LAUNCH                 ((uint32_t)0x00002000U)        /*!< OptionBytes Loader Launch */

/*******************  Bit definition for FLASH_AR register  *******************/
#define  FLASH_AR_FAR                        ((uint32_t)0xFFFFFFFFU)        /*!< Flash Address */

/******************  Bit definition for FLASH_OBR register  *******************/
#define  FLASH_OBR_OPTERR                    ((uint32_t)0x00000001U)        /*!< Option Byte Error */
#if defined(STM32F373xC) || defined(STM32F378xx)
#define  FLASH_OBR_LEVEL1_PROT               ((uint32_t)0x00000002U)        /*!< Level 1 Read protection status */
#define  FLASH_OBR_LEVEL2_PROT               ((uint32_t)0x00000004U)        /*!< Level 2 Read protection status */
#else
#define  FLASH_OBR_RDPRT                     ((uint32_t)0x00000006U)        /*!< Read protection */
#define  FLASH_OBR_RDPRT_1                   ((uint32_t)0x00000002U)        /*!< Read protection Level 1 */
#define  FLASH_OBR_RDPRT_2                   ((uint32_t)0x00000006U)        /*!< Read protection Level 2 */
#endif

#if defined(STM32F373xC) || defined(STM32F378xx)
#define  FLASH_OBR_USER                      ((uint32_t)0x0000F700U)        /*!< User Option Bytes */
#else
#define  FLASH_OBR_USER                      ((uint32_t)0x00007700U)        /*!< User Option Bytes */
#endif
#define  FLASH_OBR_IWDG_SW                   ((uint32_t)0x00000100U)        /*!< IWDG SW */
#define  FLASH_OBR_nRST_STOP                 ((uint32_t)0x00000200U)        /*!< nRST_STOP */
#define  FLASH_OBR_nRST_STDBY                ((uint32_t)0x00000400U)        /*!< nRST_STDBY */
#define  FLASH_OBR_nBOOT1                    ((uint32_t)0x00001000U)        /*!< nBOOT1 */
#define  FLASH_OBR_VDDA_MONITOR              ((uint32_t)0x00002000U)        /*!< VDDA_MONITOR */
#define  FLASH_OBR_SRAM_PE                   ((uint32_t)0x00004000U)        /*!< SRAM_PE */
#if defined (STM32F378xx) || defined (STM32F373xC)
#define  FLASH_OBR_SDADC12_VDD_MONITOR       ((uint32_t)0x00008000U)        /*!< SDADC12_VDD_MONITOR */
#endif
#define  FLASH_OBR_DATA0                     ((uint32_t)0x00FF0000U) /*!< Data0 */
#define  FLASH_OBR_DATA1                     ((uint32_t)0xFF000000U) /*!< Data1 */

