HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
/*******************  Bit definition for FMC_SR4 register  *******************/
#define  FMC_SR4_IRS                        ((uint32_t)0x01)               /*!<Interrupt Rising Edge status                */
#define  FMC_SR4_ILS                        ((uint32_t)0x02)               /*!<Interrupt Level status                      */
#define  FMC_SR4_IFS                        ((uint32_t)0x04)               /*!<Interrupt Falling Edge status               */
#define  FMC_SR4_IREN                       ((uint32_t)0x08)               /*!<Interrupt Rising Edge detection Enable bit  */
#define  FMC_SR4_ILEN                       ((uint32_t)0x10)               /*!<Interrupt Level detection Enable bit        */
#define  FMC_SR4_IFEN                       ((uint32_t)0x20)               /*!<Interrupt Falling Edge detection Enable bit */
#define  FMC_SR4_FEMPT                      ((uint32_t)0x40)               /*!<FIFO empty                                  */

/******************  Bit definition for FMC_PMEMx register  ******************/
#define  FMC_PMEMx_MEMSETx                  ((uint32_t)0x000000FFU)        /*!<MEMSETx[7:0] bits (Common memory x setup time) */
#define  FMC_PMEMx_MEMSETx_0                ((uint32_t)0x00000001U)        /*!<Bit 0 */
#define  FMC_PMEMx_MEMSETx_1                ((uint32_t)0x00000002U)        /*!<Bit 1 */
#define  FMC_PMEMx_MEMSETx_2                ((uint32_t)0x00000004U)        /*!<Bit 2 */
#define  FMC_PMEMx_MEMSETx_3                ((uint32_t)0x00000008U)        /*!<Bit 3 */
#define  FMC_PMEMx_MEMSETx_4                ((uint32_t)0x00000010U)        /*!<Bit 4 */
#define  FMC_PMEMx_MEMSETx_5                ((uint32_t)0x00000020U)        /*!<Bit 5 */
#define  FMC_PMEMx_MEMSETx_6                ((uint32_t)0x00000040U)        /*!<Bit 6 */
#define  FMC_PMEMx_MEMSETx_7                ((uint32_t)0x00000080U)        /*!<Bit 7 */

#define  FMC_PMEMx_MEMWAITx                 ((uint32_t)0x0000FF00U)        /*!<MEMWAITx[7:0] bits (Common memory x wait time) */
#define  FMC_PMEMx_MEMWAITx_0               ((uint32_t)0x00000100U)        /*!<Bit 0 */
#define  FMC_PMEMx_MEMWAITx_1               ((uint32_t)0x00000200U)        /*!<Bit 1 */
#define  FMC_PMEMx_MEMWAITx_2               ((uint32_t)0x00000400U)        /*!<Bit 2 */
#define  FMC_PMEMx_MEMWAITx_3               ((uint32_t)0x00000800U)        /*!<Bit 3 */
#define  FMC_PMEMx_MEMWAITx_4               ((uint32_t)0x00001000U)        /*!<Bit 4 */
#define  FMC_PMEMx_MEMWAITx_5               ((uint32_t)0x00002000U)        /*!<Bit 5 */
#define  FMC_PMEMx_MEMWAITx_6               ((uint32_t)0x00004000U)        /*!<Bit 6 */
#define  FMC_PMEMx_MEMWAITx_7               ((uint32_t)0x00008000U)        /*!<Bit 7 */

#define  FMC_PMEMx_MEMHOLDx                 ((uint32_t)0x00FF0000U)        /*!<MEMHOLDx[7:0] bits (Common memory x hold time) */
#define  FMC_PMEMx_MEMHOLDx_0               ((uint32_t)0x00010000U)        /*!<Bit 0 */
#define  FMC_PMEMx_MEMHOLDx_1               ((uint32_t)0x00020000U)        /*!<Bit 1 */
#define  FMC_PMEMx_MEMHOLDx_2               ((uint32_t)0x00040000U)        /*!<Bit 2 */
#define  FMC_PMEMx_MEMHOLDx_3               ((uint32_t)0x00080000U)        /*!<Bit 3 */
#define  FMC_PMEMx_MEMHOLDx_4               ((uint32_t)0x00100000U)        /*!<Bit 4 */
#define  FMC_PMEMx_MEMHOLDx_5               ((uint32_t)0x00200000U)        /*!<Bit 5 */
#define  FMC_PMEMx_MEMHOLDx_6               ((uint32_t)0x00400000U)        /*!<Bit 6 */
#define  FMC_PMEMx_MEMHOLDx_7               ((uint32_t)0x00800000U)        /*!<Bit 7 */

#define  FMC_PMEMx_MEMHIZx                  ((uint32_t)0xFF000000U)        /*!<MEMHIZx[7:0] bits (Common memory x databus HiZ time) */
#define  FMC_PMEMx_MEMHIZx_0                ((uint32_t)0x01000000U)        /*!<Bit 0 */
#define  FMC_PMEMx_MEMHIZx_1                ((uint32_t)0x02000000U)        /*!<Bit 1 */
#define  FMC_PMEMx_MEMHIZx_2                ((uint32_t)0x04000000U)        /*!<Bit 2 */
#define  FMC_PMEMx_MEMHIZx_3                ((uint32_t)0x08000000U)        /*!<Bit 3 */
#define  FMC_PMEMx_MEMHIZx_4                ((uint32_t)0x10000000U)        /*!<Bit 4 */
#define  FMC_PMEMx_MEMHIZx_5                ((uint32_t)0x20000000U)        /*!<Bit 5 */
#define  FMC_PMEMx_MEMHIZx_6                ((uint32_t)0x40000000U)        /*!<Bit 6 */
#define  FMC_PMEMx_MEMHIZx_7                ((uint32_t)0x80000000U)        /*!<Bit 7 */

/******************  Bit definition for FMC_PMEM2 register  ******************/
#define  FMC_PMEM2_MEMSET2                  ((uint32_t)0x000000FFU)        /*!<MEMSET2[7:0] bits (Common memory 2 setup time) */
#define  FMC_PMEM2_MEMSET2_0                ((uint32_t)0x00000001U)        /*!<Bit 0 */
#define  FMC_PMEM2_MEMSET2_1                ((uint32_t)0x00000002U)        /*!<Bit 1 */
#define  FMC_PMEM2_MEMSET2_2                ((uint32_t)0x00000004U)        /*!<Bit 2 */
#define  FMC_PMEM2_MEMSET2_3                ((uint32_t)0x00000008U)        /*!<Bit 3 */
#define  FMC_PMEM2_MEMSET2_4                ((uint32_t)0x00000010U)        /*!<Bit 4 */
#define  FMC_PMEM2_MEMSET2_5                ((uint32_t)0x00000020U)        /*!<Bit 5 */
#define  FMC_PMEM2_MEMSET2_6                ((uint32_t)0x00000040U)        /*!<Bit 6 */
#define  FMC_PMEM2_MEMSET2_7                ((uint32_t)0x00000080U)        /*!<Bit 7 */

#define  FMC_PMEM2_MEMWAIT2                 ((uint32_t)0x0000FF00U)        /*!<MEMWAIT2[7:0] bits (Common memory 2 wait time) */
#define  FMC_PMEM2_MEMWAIT2_0               ((uint32_t)0x00000100U)        /*!<Bit 0 */
#define  FMC_PMEM2_MEMWAIT2_1               ((uint32_t)0x00000200U)        /*!<Bit 1 */
#define  FMC_PMEM2_MEMWAIT2_2               ((uint32_t)0x00000400U)        /*!<Bit 2 */
#define  FMC_PMEM2_MEMWAIT2_3               ((uint32_t)0x00000800U)        /*!<Bit 3 */
#define  FMC_PMEM2_MEMWAIT2_4               ((uint32_t)0x00001000U)        /*!<Bit 4 */
#define  FMC_PMEM2_MEMWAIT2_5               ((uint32_t)0x00002000U)        /*!<Bit 5 */
#define  FMC_PMEM2_MEMWAIT2_6               ((uint32_t)0x00004000U)        /*!<Bit 6 */
#define  FMC_PMEM2_MEMWAIT2_7               ((uint32_t)0x00008000U)        /*!<Bit 7 */

#define  FMC_PMEM2_MEMHOLD2                 ((uint32_t)0x00FF0000U)        /*!<MEMHOLD2[7:0] bits (Common memory 2 hold time) */
#define  FMC_PMEM2_MEMHOLD2_0               ((uint32_t)0x00010000U)        /*!<Bit 0 */
#define  FMC_PMEM2_MEMHOLD2_1               ((uint32_t)0x00020000U)        /*!<Bit 1 */
#define  FMC_PMEM2_MEMHOLD2_2               ((uint32_t)0x00040000U)        /*!<Bit 2 */
#define  FMC_PMEM2_MEMHOLD2_3               ((uint32_t)0x00080000U)        /*!<Bit 3 */
#define  FMC_PMEM2_MEMHOLD2_4               ((uint32_t)0x00100000U)        /*!<Bit 4 */
#define  FMC_PMEM2_MEMHOLD2_5               ((uint32_t)0x00200000U)        /*!<Bit 5 */
#define  FMC_PMEM2_MEMHOLD2_6               ((uint32_t)0x00400000U)        /*!<Bit 6 */
#define  FMC_PMEM2_MEMHOLD2_7               ((uint32_t)0x00800000U)        /*!<Bit 7 */

#define  FMC_PMEM2_MEMHIZ2                  ((uint32_t)0xFF000000U)        /*!<MEMHIZ2[7:0] bits (Common memory 2 databus HiZ time) */
#define  FMC_PMEM2_MEMHIZ2_0                ((uint32_t)0x01000000U)        /*!<Bit 0 */
#define  FMC_PMEM2_MEMHIZ2_1                ((uint32_t)0x02000000U)        /*!<Bit 1 */
#define  FMC_PMEM2_MEMHIZ2_2                ((uint32_t)0x04000000U)        /*!<Bit 2 */
#define  FMC_PMEM2_MEMHIZ2_3                ((uint32_t)0x08000000U)        /*!<Bit 3 */
#define  FMC_PMEM2_MEMHIZ2_4                ((uint32_t)0x10000000U)        /*!<Bit 4 */
#define  FMC_PMEM2_MEMHIZ2_5                ((uint32_t)0x20000000U)        /*!<Bit 5 */
#define  FMC_PMEM2_MEMHIZ2_6                ((uint32_t)0x40000000U)        /*!<Bit 6 */
#define  FMC_PMEM2_MEMHIZ2_7                ((uint32_t)0x80000000U)        /*!<Bit 7 */

/******************  Bit definition for FMC_PMEM3 register  ******************/
#define  FMC_PMEM3_MEMSET3                  ((uint32_t)0x000000FFU)        /*!<MEMSET3[7:0] bits (Common memory 3 setup time) */
#define  FMC_PMEM3_MEMSET3_0                ((uint32_t)0x00000001U)        /*!<Bit 0 */
#define  FMC_PMEM3_MEMSET3_1                ((uint32_t)0x00000002U)        /*!<Bit 1 */
#define  FMC_PMEM3_MEMSET3_2                ((uint32_t)0x00000004U)        /*!<Bit 2 */
#define  FMC_PMEM3_MEMSET3_3                ((uint32_t)0x00000008U)        /*!<Bit 3 */
#define  FMC_PMEM3_MEMSET3_4                ((uint32_t)0x00000010U)        /*!<Bit 4 */
#define  FMC_PMEM3_MEMSET3_5                ((uint32_t)0x00000020U)        /*!<Bit 5 */
#define  FMC_PMEM3_MEMSET3_6                ((uint32_t)0x00000040U)        /*!<Bit 6 */
#define  FMC_PMEM3_MEMSET3_7                ((uint32_t)0x00000080U)        /*!<Bit 7 */

#define  FMC_PMEM3_MEMWAIT3                 ((uint32_t)0x0000FF00U)        /*!<MEMWAIT3[7:0] bits (Common memory 3 wait time) */
#define  FMC_PMEM3_MEMWAIT3_0               ((uint32_t)0x00000100U)        /*!<Bit 0 */
#define  FMC_PMEM3_MEMWAIT3_1               ((uint32_t)0x00000200U)        /*!<Bit 1 */
#define  FMC_PMEM3_MEMWAIT3_2               ((uint32_t)0x00000400U)        /*!<Bit 2 */
#define  FMC_PMEM3_MEMWAIT3_3               ((uint32_t)0x00000800U)        /*!<Bit 3 */
#define  FMC_PMEM3_MEMWAIT3_4               ((uint32_t)0x00001000U)        /*!<Bit 4 */
#define  FMC_PMEM3_MEMWAIT3_5               ((uint32_t)0x00002000U)        /*!<Bit 5 */
#define  FMC_PMEM3_MEMWAIT3_6               ((uint32_t)0x00004000U)        /*!<Bit 6 */
#define  FMC_PMEM3_MEMWAIT3_7               ((uint32_t)0x00008000U)        /*!<Bit 7 */

#define  FMC_PMEM3_MEMHOLD3                 ((uint32_t)0x00FF0000U)        /*!<MEMHOLD3[7:0] bits (Common memory 3 hold time) */
#define  FMC_PMEM3_MEMHOLD3_0               ((uint32_t)0x00010000U)        /*!<Bit 0 */
#define  FMC_PMEM3_MEMHOLD3_1               ((uint32_t)0x00020000U)        /*!<Bit 1 */
#define  FMC_PMEM3_MEMHOLD3_2               ((uint32_t)0x00040000U)        /*!<Bit 2 */
#define  FMC_PMEM3_MEMHOLD3_3               ((uint32_t)0x00080000U)        /*!<Bit 3 */
#define  FMC_PMEM3_MEMHOLD3_4               ((uint32_t)0x00100000U)        /*!<Bit 4 */
#define  FMC_PMEM3_MEMHOLD3_5               ((uint32_t)0x00200000U)        /*!<Bit 5 */
#define  FMC_PMEM3_MEMHOLD3_6               ((uint32_t)0x00400000U)        /*!<Bit 6 */
#define  FMC_PMEM3_MEMHOLD3_7               ((uint32_t)0x00800000U)        /*!<Bit 7 */

