HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
#define  FMC_PMEM3_MEMHIZ3                  ((uint32_t)0xFF000000U)        /*!<MEMHIZ3[7:0] bits (Common memory 3 databus HiZ time) */
#define  FMC_PMEM3_MEMHIZ3_0                ((uint32_t)0x01000000U)        /*!<Bit 0 */
#define  FMC_PMEM3_MEMHIZ3_1                ((uint32_t)0x02000000U)        /*!<Bit 1 */
#define  FMC_PMEM3_MEMHIZ3_2                ((uint32_t)0x04000000U)        /*!<Bit 2 */
#define  FMC_PMEM3_MEMHIZ3_3                ((uint32_t)0x08000000U)        /*!<Bit 3 */
#define  FMC_PMEM3_MEMHIZ3_4                ((uint32_t)0x10000000U)        /*!<Bit 4 */
#define  FMC_PMEM3_MEMHIZ3_5                ((uint32_t)0x20000000U)        /*!<Bit 5 */
#define  FMC_PMEM3_MEMHIZ3_6                ((uint32_t)0x40000000U)        /*!<Bit 6 */
#define  FMC_PMEM3_MEMHIZ3_7                ((uint32_t)0x80000000U)        /*!<Bit 7 */

/******************  Bit definition for FMC_PMEM4 register  ******************/
#define  FMC_PMEM4_MEMSET4                  ((uint32_t)0x000000FFU)        /*!<MEMSET4[7:0] bits (Common memory 4 setup time) */
#define  FMC_PMEM4_MEMSET4_0                ((uint32_t)0x00000001U)        /*!<Bit 0 */
#define  FMC_PMEM4_MEMSET4_1                ((uint32_t)0x00000002U)        /*!<Bit 1 */
#define  FMC_PMEM4_MEMSET4_2                ((uint32_t)0x00000004U)        /*!<Bit 2 */
#define  FMC_PMEM4_MEMSET4_3                ((uint32_t)0x00000008U)        /*!<Bit 3 */
#define  FMC_PMEM4_MEMSET4_4                ((uint32_t)0x00000010U)        /*!<Bit 4 */
#define  FMC_PMEM4_MEMSET4_5                ((uint32_t)0x00000020U)        /*!<Bit 5 */
#define  FMC_PMEM4_MEMSET4_6                ((uint32_t)0x00000040U)        /*!<Bit 6 */
#define  FMC_PMEM4_MEMSET4_7                ((uint32_t)0x00000080U)        /*!<Bit 7 */

#define  FMC_PMEM4_MEMWAIT4                 ((uint32_t)0x0000FF00U)        /*!<MEMWAIT4[7:0] bits (Common memory 4 wait time) */
#define  FMC_PMEM4_MEMWAIT4_0               ((uint32_t)0x00000100U)        /*!<Bit 0 */
#define  FMC_PMEM4_MEMWAIT4_1               ((uint32_t)0x00000200U)        /*!<Bit 1 */
#define  FMC_PMEM4_MEMWAIT4_2               ((uint32_t)0x00000400U)        /*!<Bit 2 */
#define  FMC_PMEM4_MEMWAIT4_3               ((uint32_t)0x00000800U)        /*!<Bit 3 */
#define  FMC_PMEM4_MEMWAIT4_4               ((uint32_t)0x00001000U)        /*!<Bit 4 */
#define  FMC_PMEM4_MEMWAIT4_5               ((uint32_t)0x00002000U)        /*!<Bit 5 */
#define  FMC_PMEM4_MEMWAIT4_6               ((uint32_t)0x00004000U)        /*!<Bit 6 */
#define  FMC_PMEM4_MEMWAIT4_7               ((uint32_t)0x00008000U)        /*!<Bit 7 */

#define  FMC_PMEM4_MEMHOLD4                 ((uint32_t)0x00FF0000U)        /*!<MEMHOLD4[7:0] bits (Common memory 4 hold time) */
#define  FMC_PMEM4_MEMHOLD4_0               ((uint32_t)0x00010000U)        /*!<Bit 0 */
#define  FMC_PMEM4_MEMHOLD4_1               ((uint32_t)0x00020000U)        /*!<Bit 1 */
#define  FMC_PMEM4_MEMHOLD4_2               ((uint32_t)0x00040000U)        /*!<Bit 2 */
#define  FMC_PMEM4_MEMHOLD4_3               ((uint32_t)0x00080000U)        /*!<Bit 3 */
#define  FMC_PMEM4_MEMHOLD4_4               ((uint32_t)0x00100000U)        /*!<Bit 4 */
#define  FMC_PMEM4_MEMHOLD4_5               ((uint32_t)0x00200000U)        /*!<Bit 5 */
#define  FMC_PMEM4_MEMHOLD4_6               ((uint32_t)0x00400000U)        /*!<Bit 6 */
#define  FMC_PMEM4_MEMHOLD4_7               ((uint32_t)0x00800000U)        /*!<Bit 7 */

#define  FMC_PMEM4_MEMHIZ4                  ((uint32_t)0xFF000000U)        /*!<MEMHIZ4[7:0] bits (Common memory 4 databus HiZ time) */
#define  FMC_PMEM4_MEMHIZ4_0                ((uint32_t)0x01000000U)        /*!<Bit 0 */
#define  FMC_PMEM4_MEMHIZ4_1                ((uint32_t)0x02000000U)        /*!<Bit 1 */
#define  FMC_PMEM4_MEMHIZ4_2                ((uint32_t)0x04000000U)        /*!<Bit 2 */
#define  FMC_PMEM4_MEMHIZ4_3                ((uint32_t)0x08000000U)        /*!<Bit 3 */
#define  FMC_PMEM4_MEMHIZ4_4                ((uint32_t)0x10000000U)        /*!<Bit 4 */
#define  FMC_PMEM4_MEMHIZ4_5                ((uint32_t)0x20000000U)        /*!<Bit 5 */
#define  FMC_PMEM4_MEMHIZ4_6                ((uint32_t)0x40000000U)        /*!<Bit 6 */
#define  FMC_PMEM4_MEMHIZ4_7                ((uint32_t)0x80000000U)        /*!<Bit 7 */

/******************  Bit definition for FMC_PATTx register  ******************/
#define  FMC_PATTx_ATTSETx                  ((uint32_t)0x000000FFU)        /*!<ATTSETx[7:0] bits (Attribute memory x setup time) */
#define  FMC_PATTx_ATTSETx_0                ((uint32_t)0x00000001U)        /*!<Bit 0 */
#define  FMC_PATTx_ATTSETx_1                ((uint32_t)0x00000002U)        /*!<Bit 1 */
#define  FMC_PATTx_ATTSETx_2                ((uint32_t)0x00000004U)        /*!<Bit 2 */
#define  FMC_PATTx_ATTSETx_3                ((uint32_t)0x00000008U)        /*!<Bit 3 */
#define  FMC_PATTx_ATTSETx_4                ((uint32_t)0x00000010U)        /*!<Bit 4 */
#define  FMC_PATTx_ATTSETx_5                ((uint32_t)0x00000020U)        /*!<Bit 5 */
#define  FMC_PATTx_ATTSETx_6                ((uint32_t)0x00000040U)        /*!<Bit 6 */
#define  FMC_PATTx_ATTSETx_7                ((uint32_t)0x00000080U)        /*!<Bit 7 */

#define  FMC_PATTx_ATTWAITx                 ((uint32_t)0x0000FF00U)        /*!<ATTWAITx[7:0] bits (Attribute memory x wait time) */
#define  FMC_PATTx_ATTWAITx_0               ((uint32_t)0x00000100U)        /*!<Bit 0 */
#define  FMC_PATTx_ATTWAITx_1               ((uint32_t)0x00000200U)        /*!<Bit 1 */
#define  FMC_PATTx_ATTWAITx_2               ((uint32_t)0x00000400U)        /*!<Bit 2 */
#define  FMC_PATTx_ATTWAITx_3               ((uint32_t)0x00000800U)        /*!<Bit 3 */
#define  FMC_PATTx_ATTWAITx_4               ((uint32_t)0x00001000U)        /*!<Bit 4 */
#define  FMC_PATTx_ATTWAITx_5               ((uint32_t)0x00002000U)        /*!<Bit 5 */
#define  FMC_PATTx_ATTWAITx_6               ((uint32_t)0x00004000U)        /*!<Bit 6 */
#define  FMC_PATTx_ATTWAITx_7               ((uint32_t)0x00008000U)        /*!<Bit 7 */

#define  FMC_PATTx_ATTHOLDx                 ((uint32_t)0x00FF0000U)        /*!<ATTHOLDx[7:0] bits (Attribute memory x hold time) */
#define  FMC_PATTx_ATTHOLDx_0               ((uint32_t)0x00010000U)        /*!<Bit 0 */
#define  FMC_PATTx_ATTHOLDx_1               ((uint32_t)0x00020000U)        /*!<Bit 1 */
#define  FMC_PATTx_ATTHOLDx_2               ((uint32_t)0x00040000U)        /*!<Bit 2 */
#define  FMC_PATTx_ATTHOLDx_3               ((uint32_t)0x00080000U)        /*!<Bit 3 */
#define  FMC_PATTx_ATTHOLDx_4               ((uint32_t)0x00100000U)        /*!<Bit 4 */
#define  FMC_PATTx_ATTHOLDx_5               ((uint32_t)0x00200000U)        /*!<Bit 5 */
#define  FMC_PATTx_ATTHOLDx_6               ((uint32_t)0x00400000U)        /*!<Bit 6 */
#define  FMC_PATTx_ATTHOLDx_7               ((uint32_t)0x00800000U)        /*!<Bit 7 */

#define  FMC_PATTx_ATTHIZx                  ((uint32_t)0xFF000000U)        /*!<ATTHIZx[7:0] bits (Attribute memory x databus HiZ time) */
#define  FMC_PATTx_ATTHIZx_0                ((uint32_t)0x01000000U)        /*!<Bit 0 */
#define  FMC_PATTx_ATTHIZx_1                ((uint32_t)0x02000000U)        /*!<Bit 1 */
#define  FMC_PATTx_ATTHIZx_2                ((uint32_t)0x04000000U)        /*!<Bit 2 */
#define  FMC_PATTx_ATTHIZx_3                ((uint32_t)0x08000000U)        /*!<Bit 3 */
#define  FMC_PATTx_ATTHIZx_4                ((uint32_t)0x10000000U)        /*!<Bit 4 */
#define  FMC_PATTx_ATTHIZx_5                ((uint32_t)0x20000000U)        /*!<Bit 5 */
#define  FMC_PATTx_ATTHIZx_6                ((uint32_t)0x40000000U)        /*!<Bit 6 */
#define  FMC_PATTx_ATTHIZx_7                ((uint32_t)0x80000000U)        /*!<Bit 7 */

