HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
#define  RCC_CFGR_PLLMUL2                    ((uint32_t)0x00000000U)        /*!< PLL input clock*2 */
#define  RCC_CFGR_PLLMUL3                    ((uint32_t)0x00040000U)        /*!< PLL input clock*3 */
#define  RCC_CFGR_PLLMUL4                    ((uint32_t)0x00080000U)        /*!< PLL input clock*4 */
#define  RCC_CFGR_PLLMUL5                    ((uint32_t)0x000C0000U)        /*!< PLL input clock*5 */
#define  RCC_CFGR_PLLMUL6                    ((uint32_t)0x00100000U)        /*!< PLL input clock*6 */
#define  RCC_CFGR_PLLMUL7                    ((uint32_t)0x00140000U)        /*!< PLL input clock*7 */
#define  RCC_CFGR_PLLMUL8                    ((uint32_t)0x00180000U)        /*!< PLL input clock*8 */
#define  RCC_CFGR_PLLMUL9                    ((uint32_t)0x001C0000U)        /*!< PLL input clock*9 */
#define  RCC_CFGR_PLLMUL10                   ((uint32_t)0x00200000U)        /*!< PLL input clock10 */
#define  RCC_CFGR_PLLMUL11                   ((uint32_t)0x00240000U)        /*!< PLL input clock*11 */
#define  RCC_CFGR_PLLMUL12                   ((uint32_t)0x00280000U)        /*!< PLL input clock*12 */
#define  RCC_CFGR_PLLMUL13                   ((uint32_t)0x002C0000U)        /*!< PLL input clock*13 */
#define  RCC_CFGR_PLLMUL14                   ((uint32_t)0x00300000U)        /*!< PLL input clock*14 */
#define  RCC_CFGR_PLLMUL15                   ((uint32_t)0x00340000U)        /*!< PLL input clock*15 */
#define  RCC_CFGR_PLLMUL16                   ((uint32_t)0x00380000U)        /*!< PLL input clock*16 */

#if defined (STM32F302x8) || defined (STM32F302xC) || defined (STM32F373xC) || defined (STM32F303xC) || defined (STM32F302xE) || defined (STM32F303xE)
/*!< USB configuration */
#define  RCC_CFGR_USBPRE                     ((uint32_t)0x00400000U)        /*!< USB prescaler */

#define  RCC_CFGR_USBPRE_DIV1_5              ((uint32_t)0x00000000U)        /*!< USB prescaler is PLL clock divided by 1.5 */
#define  RCC_CFGR_USBPRE_DIV1                ((uint32_t)0x00400000U)        /*!< USB prescaler is PLL clock divided by 1 */

#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx)|| defined(STM32F398xx)
/*!< I2S configuration */
#define  RCC_CFGR_I2SSRC                     ((uint32_t)0x00800000U)        /*!< I2S external clock source selection */

#define  RCC_CFGR_I2SSRC_SYSCLK              ((uint32_t)0x00000000U)        /*!< System clock selected as I2S clock source */
#define  RCC_CFGR_I2SSRC_EXT                 ((uint32_t)0x00800000U)        /*!< External clock selected as I2S clock source */

#endif
/*!< MCO configuration */
#define  RCC_CFGR_MCO                        ((uint32_t)0x07000000U)        /*!< MCO[2:0] bits (Microcontroller Clock Output) */
#define  RCC_CFGR_MCO_0                      ((uint32_t)0x01000000U)        /*!< Bit 0 */
#define  RCC_CFGR_MCO_1                      ((uint32_t)0x02000000U)        /*!< Bit 1 */
#define  RCC_CFGR_MCO_2                      ((uint32_t)0x04000000U)        /*!< Bit 2 */

#define  RCC_CFGR_MCO_NOCLOCK                ((uint32_t)0x00000000U)        /*!< No clock */
#define  RCC_CFGR_MCO_LSI                    ((uint32_t)0x02000000U)        /*!< LSI clock selected as MCO source */
#define  RCC_CFGR_MCO_LSE                    ((uint32_t)0x03000000U)        /*!< LSE clock selected as MCO source */
#define  RCC_CFGR_MCO_SYSCLK                 ((uint32_t)0x04000000U)        /*!< System clock selected as MCO source */
#define  RCC_CFGR_MCO_HSI                    ((uint32_t)0x05000000U)        /*!< HSI clock selected as MCO source */
#define  RCC_CFGR_MCO_HSE                    ((uint32_t)0x06000000U)        /*!< HSE clock selected as MCO source  */
#define  RCC_CFGR_MCO_PLL                    ((uint32_t)0x07000000U)        /*!< PLL clock divided by 2 selected as MCO source */

#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xE) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F398xx) || defined(STM32F303x8) || defined(STM32F328xx) || defined(STM32F334x8)
#define  RCC_CFGR_MCOPRE                     ((uint32_t)0x70000000U)        /*!< MCOPRE[3:0] bits (Microcontroller Clock Output Prescaler) */
#define  RCC_CFGR_MCOPRE_0                   ((uint32_t)0x10000000U)        /*!< Bit 0 */
#define  RCC_CFGR_MCOPRE_1                   ((uint32_t)0x20000000U)        /*!< Bit 1 */
#define  RCC_CFGR_MCOPRE_2                   ((uint32_t)0x40000000U)        /*!< Bit 2 */

#define  RCC_CFGR_MCOPRE_DIV1                ((uint32_t)0x00000000U)        /*!< MCO is divided by 1 */
#define  RCC_CFGR_MCOPRE_DIV2                ((uint32_t)0x10000000U)        /*!< MCO is divided by 2 */
#define  RCC_CFGR_MCOPRE_DIV4                ((uint32_t)0x20000000U)        /*!< MCO is divided by 4 */
#define  RCC_CFGR_MCOPRE_DIV8                ((uint32_t)0x30000000U)        /*!< MCO is divided by 8 */
#define  RCC_CFGR_MCOPRE_DIV16               ((uint32_t)0x40000000U)        /*!< MCO is divided by 16 */
#define  RCC_CFGR_MCOPRE_DIV32               ((uint32_t)0x50000000U)        /*!< MCO is divided by 32 */
#define  RCC_CFGR_MCOPRE_DIV64               ((uint32_t)0x60000000U)        /*!< MCO is divided by 64 */
#define  RCC_CFGR_MCOPRE_DIV128              ((uint32_t)0x70000000U)        /*!< MCO is divided by 128 */

#endif
#if defined(STM32F302xC) || defined(STM32F303xC) || defined(STM32F358xx)
#define  RCC_CFGR_MCOF                       ((uint32_t)0x10000000U)        /*!< Microcontroller Clock Output Flag */
#endif
#if defined(STM32F303x8) || defined(STM32F328xx) || defined(STM32F303xE) || defined(STM32F398xx) || defined(STM32F334x8) || defined(STM32F302x8) || defined(STM32F302xE) || defined(STM32F301x8) || defined(STM32F318xx)
#define  RCC_CFGR_PLLNODIV                   ((uint32_t)0x80000000U)        /*!< Do not divide PLL to MCO */

#endif
/* Reference defines */
#define RCC_CFGR_MCOSEL                      RCC_CFGR_MCO
#define RCC_CFGR_MCOSEL_0                    RCC_CFGR_MCO_0
#define RCC_CFGR_MCOSEL_1                    RCC_CFGR_MCO_1
#define RCC_CFGR_MCOSEL_2                    RCC_CFGR_MCO_2
#define RCC_CFGR_MCOSEL_NOCLOCK              RCC_CFGR_MCO_NOCLOCK
#define RCC_CFGR_MCOSEL_LSI                  RCC_CFGR_MCO_LSI
#define RCC_CFGR_MCOSEL_LSE                  RCC_CFGR_MCO_LSE
#define RCC_CFGR_MCOSEL_SYSCLK               RCC_CFGR_MCO_SYSCLK
#define RCC_CFGR_MCOSEL_HSI                  RCC_CFGR_MCO_HSI
#define RCC_CFGR_MCOSEL_HSE                  RCC_CFGR_MCO_HSE
#define RCC_CFGR_MCOSEL_PLL_DIV2             RCC_CFGR_MCO_PLL

#if defined (STM32F378xx) || defined (STM32F373xC)
/*!< SDADCPRE configuration */
#define  RCC_CFGR_SDADCPRE                   ((uint32_t)0xF8000000U)        /*!< SDADCPRE[4:0] bits (Sigma Delta ADC prescaler) */
#define  RCC_CFGR_SDADCPRE_0                 ((uint32_t)0x08000000U)        /*!< Bit 0 */
#define  RCC_CFGR_SDADCPRE_1                 ((uint32_t)0x10000000U)        /*!< Bit 1 */
#define  RCC_CFGR_SDADCPRE_2                 ((uint32_t)0x20000000U)        /*!< Bit 2 */
#define  RCC_CFGR_SDADCPRE_3                 ((uint32_t)0x40000000U)        /*!< Bit 3 */
#define  RCC_CFGR_SDADCPRE_4                 ((uint32_t)0x80000000U)        /*!< Bit 4 */

#define  RCC_CFGR_SDADCPRE_DIV1              ((uint32_t)0x00000000U)        /*!< SDADC CLK not divided */
#define  RCC_CFGR_SDADCPRE_DIV2              ((uint32_t)0x80000000U)        /*!< SDADC CLK divided by 2 */
#define  RCC_CFGR_SDADCPRE_DIV4              ((uint32_t)0x88000000U)        /*!< SDADC CLK divided by 4 */
#define  RCC_CFGR_SDADCPRE_DIV6              ((uint32_t)0x90000000U)        /*!< SDADC CLK divided by 6 */
#define  RCC_CFGR_SDADCPRE_DIV8              ((uint32_t)0x98000000U)        /*!< SDADC CLK divided by 8 */
#define  RCC_CFGR_SDADCPRE_DIV10             ((uint32_t)0xA0000000U)        /*!< SDADC CLK divided by 10 */
#define  RCC_CFGR_SDADCPRE_DIV12             ((uint32_t)0xA8000000U)        /*!< SDADC CLK divided by 12 */
#define  RCC_CFGR_SDADCPRE_DIV14             ((uint32_t)0xB0000000U)        /*!< SDADC CLK divided by 14 */
#define  RCC_CFGR_SDADCPRE_DIV16             ((uint32_t)0xB8000000U)        /*!< SDADC CLK divided by 16 */
#define  RCC_CFGR_SDADCPRE_DIV20             ((uint32_t)0xC0000000U)        /*!< SDADC CLK divided by 20 */
#define  RCC_CFGR_SDADCPRE_DIV24             ((uint32_t)0xC8000000U)        /*!< SDADC CLK divided by 24 */
#define  RCC_CFGR_SDADCPRE_DIV28             ((uint32_t)0xD0000000U)        /*!< SDADC CLK divided by 28 */
#define  RCC_CFGR_SDADCPRE_DIV32             ((uint32_t)0xD8000000U)        /*!< SDADC CLK divided by 32 */
#define  RCC_CFGR_SDADCPRE_DIV36             ((uint32_t)0xE0000000U)        /*!< SDADC CLK divided by 36 */
#define  RCC_CFGR_SDADCPRE_DIV40             ((uint32_t)0xE8000000U)        /*!< SDADC CLK divided by 40 */
#define  RCC_CFGR_SDADCPRE_DIV44             ((uint32_t)0xF0000000U)        /*!< SDADC CLK divided by 44 */
#define  RCC_CFGR_SDADCPRE_DIV48             ((uint32_t)0xF8000000U)        /*!< SDADC CLK divided by 48 */

#endif
/*********************  Bit definition for RCC_CIR register  ********************/
#define  RCC_CIR_LSIRDYF                     ((uint32_t)0x00000001U)        /*!< LSI Ready Interrupt flag */
#define  RCC_CIR_LSERDYF                     ((uint32_t)0x00000002U)        /*!< LSE Ready Interrupt flag */
#define  RCC_CIR_HSIRDYF                     ((uint32_t)0x00000004U)        /*!< HSI Ready Interrupt flag */
#define  RCC_CIR_HSERDYF                     ((uint32_t)0x00000008U)        /*!< HSE Ready Interrupt flag */
#define  RCC_CIR_PLLRDYF                     ((uint32_t)0x00000010U)        /*!< PLL Ready Interrupt flag */
#define  RCC_CIR_CSSF                        ((uint32_t)0x00000080U)        /*!< Clock Security System Interrupt flag */
#define  RCC_CIR_LSIRDYIE                    ((uint32_t)0x00000100U)        /*!< LSI Ready Interrupt Enable */
#define  RCC_CIR_LSERDYIE                    ((uint32_t)0x00000200U)        /*!< LSE Ready Interrupt Enable */
#define  RCC_CIR_HSIRDYIE                    ((uint32_t)0x00000400U)        /*!< HSI Ready Interrupt Enable */
#define  RCC_CIR_HSERDYIE                    ((uint32_t)0x00000800U)        /*!< HSE Ready Interrupt Enable */
#define  RCC_CIR_PLLRDYIE                    ((uint32_t)0x00001000U)        /*!< PLL Ready Interrupt Enable */
#define  RCC_CIR_LSIRDYC                     ((uint32_t)0x00010000U)        /*!< LSI Ready Interrupt Clear */
#define  RCC_CIR_LSERDYC                     ((uint32_t)0x00020000U)        /*!< LSE Ready Interrupt Clear */
#define  RCC_CIR_HSIRDYC                     ((uint32_t)0x00040000U)        /*!< HSI Ready Interrupt Clear */
#define  RCC_CIR_HSERDYC                     ((uint32_t)0x00080000U)        /*!< HSE Ready Interrupt Clear */
#define  RCC_CIR_PLLRDYC                     ((uint32_t)0x00100000U)        /*!< PLL Ready Interrupt Clear */
#define  RCC_CIR_CSSC                        ((uint32_t)0x00800000U)        /*!< Clock Security System Interrupt Clear */

/******************  Bit definition for RCC_APB2RSTR register  *****************/
#define  RCC_APB2RSTR_SYSCFGRST              ((uint32_t)0x00000001U)        /*!< SYSCFG reset */
#if defined(STM32F373xC) || defined(STM32F378xx)
#define  RCC_APB2RSTR_ADC1RST                ((uint32_t)0x00000200U)        /*!< ADC1 reset */
#else
#define  RCC_APB2RSTR_TIM1RST                ((uint32_t)0x00000800U)        /*!< TIM1 reset */
#endif
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define  RCC_APB2RSTR_SPI1RST                ((uint32_t)0x00001000U)        /*!< SPI1 reset */
#endif
#if defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
#define  RCC_APB2RSTR_TIM8RST                ((uint32_t)0x00002000U)        /*!< TIM8 reset */
#endif
#define  RCC_APB2RSTR_USART1RST              ((uint32_t)0x00004000U)        /*!< USART1 reset */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define  RCC_APB2RSTR_SPI4RST                ((uint32_t)0x00008000U)        /*!< SPI4 reset */
#endif
#define  RCC_APB2RSTR_TIM15RST               ((uint32_t)0x00010000U)        /*!< TIM15 reset */
#define  RCC_APB2RSTR_TIM16RST               ((uint32_t)0x00020000U)        /*!< TIM16 reset */
#define  RCC_APB2RSTR_TIM17RST               ((uint32_t)0x00040000U)        /*!< TIM17 reset */
#if defined(STM32F373xC) || defined(STM32F378xx)
#define  RCC_APB2RSTR_TIM19RST               ((uint32_t)0x00080000U)        /*!< TIM19 reset */
#endif
#if defined(STM32F303xE) || defined(STM32F398xx)
#define  RCC_APB2RSTR_TIM20RST               ((uint32_t)0x00100000U)        /*!< TIM20 reset */
#endif
#if defined(STM32F334x8)
#define  RCC_APB2RSTR_HRTIM1RST              ((uint32_t)0x20000000U)        /*!< HRTIM1 reset */
#endif
#if defined (STM32F378xx) || defined (STM32F373xC)
#define  RCC_APB2RSTR_SDADC1RST              ((uint32_t)0x01000000U)        /*!< SDADC1 reset */
#define  RCC_APB2RSTR_SDADC2RST              ((uint32_t)0x02000000U)        /*!< SDADC2 reset */
#define  RCC_APB2RSTR_SDADC3RST              ((uint32_t)0x04000000U)        /*!< SDADC3 reset */
#endif

/******************  Bit definition for RCC_APB1RSTR register  ******************/
#define  RCC_APB1RSTR_TIM2RST                ((uint32_t)0x00000001U)        /*!< Timer 2 reset */
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define  RCC_APB1RSTR_TIM3RST                ((uint32_t)0x00000002U)        /*!< Timer 3 reset */
#endif
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define  RCC_APB1RSTR_TIM4RST                ((uint32_t)0x00000004U)        /*!< Timer 4 reset */
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#define  RCC_APB1RSTR_TIM5RST                ((uint32_t)0x00000008U)        /*!< Timer 5 reset */
#endif
#define  RCC_APB1RSTR_TIM6RST                ((uint32_t)0x00000010U)        /*!< Timer 6 reset */
#if defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define  RCC_APB1RSTR_TIM7RST                ((uint32_t)0x00000020U)        /*!< Timer 7 reset */
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#define  RCC_APB1RSTR_TIM12RST               ((uint32_t)0x00000040U)        /*!< Timer 12 reset */
#define  RCC_APB1RSTR_TIM13RST               ((uint32_t)0x00000080U)        /*!< Timer 13 reset */
#define  RCC_APB1RSTR_TIM14RST               ((uint32_t)0x00000100U)        /*!< Timer 14 reset */
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#define  RCC_APB1RSTR_TIM18RST               ((uint32_t)0x00000200U)        /*!< Timer 18 reset */
#endif
#define  RCC_APB1RSTR_WWDGRST                ((uint32_t)0x00000800U)        /*!< Window Watchdog reset */
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx) || defined(STM32F398xx)
#define  RCC_APB1RSTR_SPI2RST                ((uint32_t)0x00004000U)        /*!< SPI2 reset */
#define  RCC_APB1RSTR_SPI3RST                ((uint32_t)0x00008000U)        /*!< SPI3 reset */
#endif
#define  RCC_APB1RSTR_USART2RST              ((uint32_t)0x00020000U)        /*!< USART 2 reset */
#define  RCC_APB1RSTR_USART3RST              ((uint32_t)0x00040000U)        /*!< USART 3 reset */
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
#define  RCC_APB1RSTR_UART4RST               ((uint32_t)0x00080000U)        /*!< UART 4 reset */
#define  RCC_APB1RSTR_UART5RST               ((uint32_t)0x00100000U)        /*!< UART 5 reset */
#endif
#define  RCC_APB1RSTR_I2C1RST                ((uint32_t)0x00200000U)        /*!< I2C 1 reset */
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx) || defined(STM32F398xx)
#define  RCC_APB1RSTR_I2C2RST                ((uint32_t)0x00400000U)        /*!< I2C 2 reset */
#endif
#if defined (STM32F302x8) || defined (STM32F302xC) || defined (STM32F373xC) || defined (STM32F303xC) || defined (STM32F302xE) || defined (STM32F303xE)
#define  RCC_APB1RSTR_USBRST                 ((uint32_t)0x00800000U)        /*!< USB reset */
#endif
#if defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define  RCC_APB1RSTR_CANRST                 ((uint32_t)0x02000000U)        /*!< CAN reset */
#endif
#if defined(STM32F303x8) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F373xC) || defined(STM32F378xx)
#define  RCC_APB1RSTR_DAC2RST                ((uint32_t)0x04000000U)        /*!< DAC 2 reset */
#endif
#define  RCC_APB1RSTR_PWRRST                 ((uint32_t)0x10000000U)        /*!< PWR reset */
#define  RCC_APB1RSTR_DAC1RST                ((uint32_t)0x20000000U)        /*!< DAC 1 reset */
#if defined (STM32F378xx) || defined (STM32F373xC)
#define  RCC_APB1RSTR_CECRST                 ((uint32_t)0x40000000U)        /*!< CEC reset */
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xE) || defined(STM32F303xE) || defined(STM32F318xx) || defined(STM32F398xx)
#define  RCC_APB1RSTR_I2C3RST                ((uint32_t)0x40000000U)        /*!< I2C 3 reset */
#endif

/******************  Bit definition for RCC_AHBENR register  ******************/
#define  RCC_AHBENR_DMA1EN                   ((uint32_t)0x00000001U)        /*!< DMA1 clock enable */
#if defined (STM32F302xC) || defined (STM32F303xC) || defined (STM32F358xx) || defined (STM32F302xE) || defined (STM32F303xE) || defined (STM32F398xx) || defined (STM32F373xC) || defined (STM32F378xx)
#define  RCC_AHBENR_DMA2EN                   ((uint32_t)0x00000002U)        /*!< DMA2 clock enable */
#endif
#define  RCC_AHBENR_SRAMEN                   ((uint32_t)0x00000004U)        /*!< SRAM interface clock enable */
#define  RCC_AHBENR_FLITFEN                  ((uint32_t)0x00000010U)        /*!< FLITF clock enable */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define  RCC_AHBENR_FMCEN                    ((uint32_t)0x00000020U)        /*!< FMC clock enable */
#endif
#define  RCC_AHBENR_CRCEN                    ((uint32_t)0x00000040U)        /*!< CRC clock enable */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define  RCC_AHBENR_GPIOHEN                  ((uint32_t)0x00010000U)        /*!< GPIOH clock enable */
#endif
#define  RCC_AHBENR_GPIOAEN                  ((uint32_t)0x00020000U)        /*!< GPIOA clock enable */
#define  RCC_AHBENR_GPIOBEN                  ((uint32_t)0x00040000U)        /*!< GPIOB clock enable */
#define  RCC_AHBENR_GPIOCEN                  ((uint32_t)0x00080000U)        /*!< GPIOC clock enable */
#define  RCC_AHBENR_GPIODEN                  ((uint32_t)0x00100000U)        /*!< GPIOD clock enable */
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define  RCC_AHBENR_GPIOEEN                  ((uint32_t)0x00200000U)        /*!< GPIOE clock enable */
#endif
#define  RCC_AHBENR_GPIOFEN                  ((uint32_t)0x00400000U)        /*!< GPIOF clock enable */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define  RCC_AHBENR_GPIOGEN                  ((uint32_t)0x00800000U)        /*!< GPIOG clock enable */
#endif
#define  RCC_AHBENR_TSCEN                     ((uint32_t)0x01000000U)       /*!< TS clock enable */
#if defined (STM32F301x8) || defined (STM32F302x8) || defined (STM32F318xx)
#define  RCC_AHBENR_ADC1EN                  ((uint32_t)0x10000000U)        /*!< ADC1 clock enable */
#endif
#if defined (STM32F302xC) || defined (STM32F302xE) || defined (STM32F303x8) || defined (STM32F303xC)|| defined (STM32F303xE) || defined (STM32F328xx) || defined (STM32F334x8) || defined (STM32F358xx)|| defined (STM32F398xx) 
#define  RCC_AHBENR_ADC12EN                  ((uint32_t)0x10000000U)        /*!< ADC1/ ADC2 clock enable */
#endif
#if defined (STM32F302xE) || defined (STM32F303xC)  || defined (STM32F303xE) || defined (STM32F358xx) || defined (STM32F398xx)
#define  RCC_AHBENR_ADC34EN                  ((uint32_t)0x20000000U)        /*!< ADC3/ ADC4 clock enable */
#endif

