HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
/*****************  Bit definition for RCC_APB2ENR register  ******************/
#define  RCC_APB2ENR_SYSCFGEN                ((uint32_t)0x00000001U)        /*!< SYSCFG clock enable */
#if defined(STM32F373xC) || defined(STM32F378xx)
#define  RCC_APB2ENR_ADC1EN                  ((uint32_t)0x00000200U)        /*!< ADC1 clock enable */
#else
#define  RCC_APB2ENR_TIM1EN                  ((uint32_t)0x00000800U)        /*!< TIM1 clock enable */
#endif
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define  RCC_APB2ENR_SPI1EN                  ((uint32_t)0x00001000U)        /*!< SPI1 clock enable */
#endif
#if defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
#define  RCC_APB2ENR_TIM8EN                  ((uint32_t)0x00002000U)        /*!< TIM8 clock enable */
#endif
#define  RCC_APB2ENR_USART1EN                ((uint32_t)0x00004000U)        /*!< USART1 clock enable */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define  RCC_APB2ENR_SPI4EN                  ((uint32_t)0x00008000U)        /*!< SPI4 clock enable */
#endif
#define  RCC_APB2ENR_TIM15EN                 ((uint32_t)0x00010000U)        /*!< TIM15 clock enable */
#define  RCC_APB2ENR_TIM16EN                 ((uint32_t)0x00020000U)        /*!< TIM16 clock enable */
#define  RCC_APB2ENR_TIM17EN                 ((uint32_t)0x00040000U)        /*!< TIM17 clock enable */
#if defined(STM32F373xC) || defined(STM32F378xx)
#define  RCC_APB2ENR_TIM19EN                 ((uint32_t)0x00080000U)        /*!< TIM19 clock enable */
#endif
#if defined(STM32F303xE) || defined(STM32F398xx)
#define  RCC_APB2ENR_TIM20EN                 ((uint32_t)0x00100000U)        /*!< TIM20 clock enable */
#endif
#if defined(STM32F334x8)
#define  RCC_APB2ENR_HRTIM1EN                ((uint32_t)0x20000000U)        /*!< HRTIM1 reset */
#endif
#if defined (STM32F378xx) || defined (STM32F373xC)
#define  RCC_APB2ENR_SDADC1EN                ((uint32_t)0x01000000U)        /*!< SDADC1 clock enable */
#define  RCC_APB2ENR_SDADC2EN                ((uint32_t)0x02000000U)        /*!< SDADC2 clock enable */
#define  RCC_APB2ENR_SDADC3EN                ((uint32_t)0x04000000U)        /*!< SDADC3 clock enable */
#endif

/******************  Bit definition for RCC_APB1ENR register  ******************/
#define  RCC_APB1ENR_TIM2EN                  ((uint32_t)0x00000001U)        /*!< Timer 2 clock enable */
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define  RCC_APB1ENR_TIM3EN                  ((uint32_t)0x00000002U)        /*!< Timer 3 clock enable */
#endif
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define  RCC_APB1ENR_TIM4EN                  ((uint32_t)0x00000004U)        /*!< Timer 4 clock enable */
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#define  RCC_APB1ENR_TIM5EN                  ((uint32_t)0x00000008U)        /*!< Timer 5 clock enable */
#endif
#define  RCC_APB1ENR_TIM6EN                  ((uint32_t)0x00000010U)        /*!< Timer 6 clock enable */
#if defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define  RCC_APB1ENR_TIM7EN                  ((uint32_t)0x00000020U)        /*!< Timer 7 clock enable */
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#define  RCC_APB1ENR_TIM12EN                 ((uint32_t)0x00000040U)        /*!< Timer 12 clock enable */
#define  RCC_APB1ENR_TIM13EN                 ((uint32_t)0x00000080U)        /*!< Timer 13 clock enable */
#define  RCC_APB1ENR_TIM14EN                 ((uint32_t)0x00000100U)        /*!< Timer 14 clock enable */
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#define  RCC_APB1ENR_TIM18EN                 ((uint32_t)0x00000200U)        /*!< Timer 18 clock enable */
#endif
#define  RCC_APB1ENR_WWDGEN                  ((uint32_t)0x00000800U)        /*!< Window Watchdog clock enable */
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx) || defined(STM32F398xx)
#define  RCC_APB1ENR_SPI2EN                  ((uint32_t)0x00004000U)        /*!< SPI2 clock enable */
#define  RCC_APB1ENR_SPI3EN                  ((uint32_t)0x00008000U)        /*!< SPI3 clock enable */
#endif
#define  RCC_APB1ENR_USART2EN                ((uint32_t)0x00020000U)        /*!< USART 2 clock enable */
#define  RCC_APB1ENR_USART3EN                ((uint32_t)0x00040000U)        /*!< USART 3 clock enable */
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
#define  RCC_APB1ENR_UART4EN                 ((uint32_t)0x00080000U)        /*!< UART 4 clock enable */
#define  RCC_APB1ENR_UART5EN                 ((uint32_t)0x00100000U)        /*!< UART 5 clock enable */
#endif
#define  RCC_APB1ENR_I2C1EN                  ((uint32_t)0x00200000U)        /*!< I2C 1 clock enable */
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx) || defined(STM32F398xx)
#define  RCC_APB1ENR_I2C2EN                  ((uint32_t)0x00400000U)        /*!< I2C 2 clock enable */
#endif
#if defined (STM32F302x8) || defined (STM32F302xC) || defined (STM32F373xC) || defined (STM32F303xC) || defined (STM32F302xE) || defined (STM32F303xE)
#define  RCC_APB1ENR_USBEN                   ((uint32_t)0x00800000U)        /*!< USB clock enable */
#endif
#if defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define  RCC_APB1ENR_CANEN                   ((uint32_t)0x02000000U)        /*!< CAN clock enable */
#endif
#if defined(STM32F303x8) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F373xC) || defined(STM32F378xx)
#define  RCC_APB1ENR_DAC2EN                  ((uint32_t)0x04000000U)        /*!< DAC 2 clock enable */
#endif
#define  RCC_APB1ENR_PWREN                   ((uint32_t)0x10000000U)        /*!< PWR clock enable */
#define  RCC_APB1ENR_DAC1EN                  ((uint32_t)0x20000000U)        /*!< DAC 1 clock enable */
#if defined (STM32F378xx) || defined (STM32F373xC)
#define  RCC_APB1ENR_CECEN                   ((uint32_t)0x40000000U)        /*!< CEC clock enable */
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xE) || defined(STM32F303xE) || defined(STM32F318xx) || defined(STM32F398xx)
#define  RCC_APB1ENR_I2C3EN                  ((uint32_t)0x40000000U)        /*!< I2C 3 clock enable */
#endif

/********************  Bit definition for RCC_BDCR register  ******************/
#define  RCC_BDCR_LSE                        ((uint32_t)0x00000007U)        /*!< External Low Speed oscillator [2:0] bits */
#define  RCC_BDCR_LSEON                      ((uint32_t)0x00000001U)        /*!< External Low Speed oscillator enable */
#define  RCC_BDCR_LSERDY                     ((uint32_t)0x00000002U)        /*!< External Low Speed oscillator Ready */
#define  RCC_BDCR_LSEBYP                     ((uint32_t)0x00000004U)        /*!< External Low Speed oscillator Bypass */

#define  RCC_BDCR_LSEDRV                     ((uint32_t)0x00000018U)        /*!< LSEDRV[1:0] bits (LSE Osc. drive capability) */
#define  RCC_BDCR_LSEDRV_0                   ((uint32_t)0x00000008U)        /*!< Bit 0 */
#define  RCC_BDCR_LSEDRV_1                   ((uint32_t)0x00000010U)        /*!< Bit 1 */

#define  RCC_BDCR_RTCSEL                     ((uint32_t)0x00000300U)        /*!< RTCSEL[1:0] bits (RTC clock source selection) */
#define  RCC_BDCR_RTCSEL_0                   ((uint32_t)0x00000100U)        /*!< Bit 0 */
#define  RCC_BDCR_RTCSEL_1                   ((uint32_t)0x00000200U)        /*!< Bit 1 */

