HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
/*!< RTC configuration */
#define  RCC_BDCR_RTCSEL_NOCLOCK             ((uint32_t)0x00000000U)        /*!< No clock */
#define  RCC_BDCR_RTCSEL_LSE                 ((uint32_t)0x00000100U)        /*!< LSE oscillator clock used as RTC clock */
#define  RCC_BDCR_RTCSEL_LSI                 ((uint32_t)0x00000200U)        /*!< LSI oscillator clock used as RTC clock */
#define  RCC_BDCR_RTCSEL_HSE                 ((uint32_t)0x00000300U)        /*!< HSE oscillator clock divided by 32 used as RTC clock */

#define  RCC_BDCR_RTCEN                      ((uint32_t)0x00008000U)        /*!< RTC clock enable */
#define  RCC_BDCR_BDRST                      ((uint32_t)0x00010000U)        /*!< Backup domain software reset  */

/********************  Bit definition for RCC_CSR register  *******************/
#define  RCC_CSR_LSION                       ((uint32_t)0x00000001U)        /*!< Internal Low Speed oscillator enable */
#define  RCC_CSR_LSIRDY                      ((uint32_t)0x00000002U)        /*!< Internal Low Speed oscillator Ready */
#if defined(STM32F318xx) || defined(STM32F328xx) ||  defined(STM32F358xx) || defined(STM32F378xx)||defined(STM32F398xx)
#else
#define  RCC_CSR_V18PWRRSTF                  ((uint32_t)0x00800000U)        /*!< V1.8 power domain reset flag */
#endif
#define  RCC_CSR_RMVF                        ((uint32_t)0x01000000U)        /*!< Remove reset flag */
#define  RCC_CSR_OBLRSTF                     ((uint32_t)0x02000000U)        /*!< OBL reset flag */
#define  RCC_CSR_PINRSTF                     ((uint32_t)0x04000000U)        /*!< PIN reset flag */
#define  RCC_CSR_PORRSTF                     ((uint32_t)0x08000000U)        /*!< POR/PDR reset flag */
#define  RCC_CSR_SFTRSTF                     ((uint32_t)0x10000000U)        /*!< Software Reset flag */
#define  RCC_CSR_IWDGRSTF                    ((uint32_t)0x20000000U)        /*!< Independent Watchdog reset flag */
#define  RCC_CSR_WWDGRSTF                    ((uint32_t)0x40000000U)        /*!< Window watchdog reset flag */
#define  RCC_CSR_LPWRRSTF                    ((uint32_t)0x80000000U)        /*!< Low-Power reset flag */

#if defined(STM32F303xC) || defined(STM32F303xE)
/* Legacy defines */
#define  RCC_CSR_VREGRSTF                    RCC_CSR_V18PWRRSTF

#endif
/*******************  Bit definition for RCC_AHBRSTR register  ****************/
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define  RCC_AHBRSTR_FMCRST                  ((uint32_t)0x00000020U)         /*!< FMC reset */
#endif
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define  RCC_AHBRSTR_GPIOHRST                ((uint32_t)0x00010000U)         /*!< GPIOH reset */
#endif
#define  RCC_AHBRSTR_GPIOARST                ((uint32_t)0x00020000U)         /*!< GPIOA reset */
#define  RCC_AHBRSTR_GPIOBRST                ((uint32_t)0x00040000U)         /*!< GPIOB reset */
#define  RCC_AHBRSTR_GPIOCRST                ((uint32_t)0x00080000U)         /*!< GPIOC reset */
#define  RCC_AHBRSTR_GPIODRST                ((uint32_t)0x00100000U)         /*!< GPIOD reset */
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define  RCC_AHBRSTR_GPIOERST                ((uint32_t)0x00200000U)         /*!< GPIOE reset */
#endif
#define  RCC_AHBRSTR_GPIOFRST                ((uint32_t)0x00400000U)         /*!< GPIOF reset */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define  RCC_AHBRSTR_GPIOGRST                ((uint32_t)0x00800000U)         /*!< GPIOG reset */
#endif
#define  RCC_AHBRSTR_TSCRST                  ((uint32_t)0x01000000U)         /*!< TSC reset */
#if defined (STM32F301x8) || defined (STM32F302x8) || defined (STM32F318xx)
#define  RCC_AHBRSTR_ADC1RST                 ((uint32_t)0x10000000U)         /*!< ADC1 reset */
#endif
#if defined (STM32F302xC) || defined (STM32F302xE) || defined (STM32F303x8) || defined (STM32F303xC)|| defined (STM32F303xE) || defined (STM32F328xx) || defined (STM32F334x8) || defined (STM32F358xx)|| defined (STM32F398xx) 
#define  RCC_AHBRSTR_ADC12RST                ((uint32_t)0x10000000U)         /*!< ADC1 & ADC2 reset */
#endif
#if defined (STM32F302xE) || defined (STM32F303xC)  || defined (STM32F303xE) || defined (STM32F358xx) || defined (STM32F398xx)
#define  RCC_AHBRSTR_ADC34RST                ((uint32_t)0x20000000U)         /*!< ADC3 & ADC4 reset */
#endif

/*******************  Bit definition for RCC_CFGR2 register  ******************/
/*!< PREDIV configuration */
#define  RCC_CFGR2_PREDIV                    ((uint32_t)0x0000000FU)        /*!< PREDIV[3:0] bits */
#define  RCC_CFGR2_PREDIV_0                  ((uint32_t)0x00000001U)        /*!< Bit 0 */
#define  RCC_CFGR2_PREDIV_1                  ((uint32_t)0x00000002U)        /*!< Bit 1 */
#define  RCC_CFGR2_PREDIV_2                  ((uint32_t)0x00000004U)        /*!< Bit 2 */
#define  RCC_CFGR2_PREDIV_3                  ((uint32_t)0x00000008U)        /*!< Bit 3 */

#define  RCC_CFGR2_PREDIV_DIV1               ((uint32_t)0x00000000U)        /*!< PREDIV input clock not divided */
#define  RCC_CFGR2_PREDIV_DIV2               ((uint32_t)0x00000001U)        /*!< PREDIV input clock divided by 2 */
#define  RCC_CFGR2_PREDIV_DIV3               ((uint32_t)0x00000002U)        /*!< PREDIV input clock divided by 3 */
#define  RCC_CFGR2_PREDIV_DIV4               ((uint32_t)0x00000003U)        /*!< PREDIV input clock divided by 4 */
#define  RCC_CFGR2_PREDIV_DIV5               ((uint32_t)0x00000004U)        /*!< PREDIV input clock divided by 5 */
#define  RCC_CFGR2_PREDIV_DIV6               ((uint32_t)0x00000005U)        /*!< PREDIV input clock divided by 6 */
#define  RCC_CFGR2_PREDIV_DIV7               ((uint32_t)0x00000006U)        /*!< PREDIV input clock divided by 7 */
#define  RCC_CFGR2_PREDIV_DIV8               ((uint32_t)0x00000007U)        /*!< PREDIV input clock divided by 8 */
#define  RCC_CFGR2_PREDIV_DIV9               ((uint32_t)0x00000008U)        /*!< PREDIV input clock divided by 9 */
#define  RCC_CFGR2_PREDIV_DIV10              ((uint32_t)0x00000009U)        /*!< PREDIV input clock divided by 10 */
#define  RCC_CFGR2_PREDIV_DIV11              ((uint32_t)0x0000000AU)        /*!< PREDIV input clock divided by 11 */
#define  RCC_CFGR2_PREDIV_DIV12              ((uint32_t)0x0000000BU)        /*!< PREDIV input clock divided by 12 */
#define  RCC_CFGR2_PREDIV_DIV13              ((uint32_t)0x0000000CU)        /*!< PREDIV input clock divided by 13 */
#define  RCC_CFGR2_PREDIV_DIV14              ((uint32_t)0x0000000DU)        /*!< PREDIV input clock divided by 14 */
#define  RCC_CFGR2_PREDIV_DIV15              ((uint32_t)0x0000000EU)        /*!< PREDIV input clock divided by 15 */
#define  RCC_CFGR2_PREDIV_DIV16              ((uint32_t)0x0000000FU)        /*!< PREDIV input clock divided by 16 */

#if defined (STM32F301x8) || defined (STM32F302x8) || defined (STM32F318xx)
/*!< ADC1PRES configuration */
#define  RCC_CFGR2_ADC1PRES                  ((uint32_t)0x000001F0U)        /*!< ADC1PRES[8:4] bits */
#define  RCC_CFGR2_ADC1PRES_0                ((uint32_t)0x00000010U)        /*!< Bit 0 */
#define  RCC_CFGR2_ADC1PRES_1                ((uint32_t)0x00000020U)        /*!< Bit 1 */
#define  RCC_CFGR2_ADC1PRES_2                ((uint32_t)0x00000040U)        /*!< Bit 2 */
#define  RCC_CFGR2_ADC1PRES_3                ((uint32_t)0x00000080U)        /*!< Bit 3 */
#define  RCC_CFGR2_ADC1PRES_4                ((uint32_t)0x00000100U)        /*!< Bit 4 */

#define  RCC_CFGR2_ADC1PRES_NO               ((uint32_t)0x00000000U)        /*!< ADC1 clock disabled, ADC1 can use AHB clock */
#define  RCC_CFGR2_ADC1PRES_DIV1             ((uint32_t)0x00000100U)        /*!< ADC1 PLL clock divided by 1 */
#define  RCC_CFGR2_ADC1PRES_DIV2             ((uint32_t)0x00000110U)        /*!< ADC1 PLL clock divided by 2 */
#define  RCC_CFGR2_ADC1PRES_DIV4             ((uint32_t)0x00000120U)        /*!< ADC1 PLL clock divided by 4 */
#define  RCC_CFGR2_ADC1PRES_DIV6             ((uint32_t)0x00000130U)        /*!< ADC1 PLL clock divided by 6 */
#define  RCC_CFGR2_ADC1PRES_DIV8             ((uint32_t)0x00000140U)        /*!< ADC1 PLL clock divided by 8 */
#define  RCC_CFGR2_ADC1PRES_DIV10            ((uint32_t)0x00000150U)        /*!< ADC1 PLL clock divided by 10 */
#define  RCC_CFGR2_ADC1PRES_DIV12            ((uint32_t)0x00000160U)        /*!< ADC1 PLL clock divided by 12 */
#define  RCC_CFGR2_ADC1PRES_DIV16            ((uint32_t)0x00000170U)        /*!< ADC1 PLL clock divided by 16 */
#define  RCC_CFGR2_ADC1PRES_DIV32            ((uint32_t)0x00000180U)        /*!< ADC1 PLL clock divided by 32 */
#define  RCC_CFGR2_ADC1PRES_DIV64            ((uint32_t)0x00000190U)        /*!< ADC1 PLL clock divided by 64 */
#define  RCC_CFGR2_ADC1PRES_DIV128           ((uint32_t)0x000001A0U)        /*!< ADC1 PLL clock divided by 128 */
#define  RCC_CFGR2_ADC1PRES_DIV256           ((uint32_t)0x000001B0U)        /*!< ADC1 PLL clock divided by 256 */

#endif
#if defined (STM32F302xC) || defined (STM32F302xE) || defined (STM32F303x8) || defined (STM32F303xC)|| defined (STM32F303xE) || defined (STM32F328xx) || defined (STM32F334x8) || defined (STM32F358xx)|| defined (STM32F398xx) 
/*!< ADCPRE12 configuration */
#define  RCC_CFGR2_ADCPRE12                  ((uint32_t)0x000001F0U)        /*!< ADCPRE12[8:4] bits */
#define  RCC_CFGR2_ADCPRE12_0                ((uint32_t)0x00000010U)        /*!< Bit 0 */
#define  RCC_CFGR2_ADCPRE12_1                ((uint32_t)0x00000020U)        /*!< Bit 1 */
#define  RCC_CFGR2_ADCPRE12_2                ((uint32_t)0x00000040U)        /*!< Bit 2 */
#define  RCC_CFGR2_ADCPRE12_3                ((uint32_t)0x00000080U)        /*!< Bit 3 */
#define  RCC_CFGR2_ADCPRE12_4                ((uint32_t)0x00000100U)        /*!< Bit 4 */

#define  RCC_CFGR2_ADCPRE12_NO               ((uint32_t)0x00000000U)        /*!< ADC12 clock disabled, ADC12 can use AHB clock */
#define  RCC_CFGR2_ADCPRE12_DIV1             ((uint32_t)0x00000100U)        /*!< ADC12 PLL clock divided by 1 */
#define  RCC_CFGR2_ADCPRE12_DIV2             ((uint32_t)0x00000110U)        /*!< ADC12 PLL clock divided by 2 */
#define  RCC_CFGR2_ADCPRE12_DIV4             ((uint32_t)0x00000120U)        /*!< ADC12 PLL clock divided by 4 */
#define  RCC_CFGR2_ADCPRE12_DIV6             ((uint32_t)0x00000130U)        /*!< ADC12 PLL clock divided by 6 */
#define  RCC_CFGR2_ADCPRE12_DIV8             ((uint32_t)0x00000140U)        /*!< ADC12 PLL clock divided by 8 */
#define  RCC_CFGR2_ADCPRE12_DIV10            ((uint32_t)0x00000150U)        /*!< ADC12 PLL clock divided by 10 */
#define  RCC_CFGR2_ADCPRE12_DIV12            ((uint32_t)0x00000160U)        /*!< ADC12 PLL clock divided by 12 */
#define  RCC_CFGR2_ADCPRE12_DIV16            ((uint32_t)0x00000170U)        /*!< ADC12 PLL clock divided by 16 */
#define  RCC_CFGR2_ADCPRE12_DIV32            ((uint32_t)0x00000180U)        /*!< ADC12 PLL clock divided by 32 */
#define  RCC_CFGR2_ADCPRE12_DIV64            ((uint32_t)0x00000190U)        /*!< ADC12 PLL clock divided by 64 */
#define  RCC_CFGR2_ADCPRE12_DIV128           ((uint32_t)0x000001A0U)        /*!< ADC12 PLL clock divided by 128 */
#define  RCC_CFGR2_ADCPRE12_DIV256           ((uint32_t)0x000001B0U)        /*!< ADC12 PLL clock divided by 256 */

#endif
#if defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
/*!< ADCPRE34 configuration */
#define  RCC_CFGR2_ADCPRE34                  ((uint32_t)0x00003E00U)        /*!< ADCPRE34[13:5] bits */
#define  RCC_CFGR2_ADCPRE34_0                ((uint32_t)0x00000200U)        /*!< Bit 0 */
#define  RCC_CFGR2_ADCPRE34_1                ((uint32_t)0x00000400U)        /*!< Bit 1 */
#define  RCC_CFGR2_ADCPRE34_2                ((uint32_t)0x00000800U)        /*!< Bit 2 */
#define  RCC_CFGR2_ADCPRE34_3                ((uint32_t)0x00001000U)        /*!< Bit 3 */
#define  RCC_CFGR2_ADCPRE34_4                ((uint32_t)0x00002000U)        /*!< Bit 4 */

#define  RCC_CFGR2_ADCPRE34_NO               ((uint32_t)0x00000000U)        /*!< ADC34 clock disabled, ADC34 can use AHB clock */
#define  RCC_CFGR2_ADCPRE34_DIV1             ((uint32_t)0x00002000U)        /*!< ADC34 PLL clock divided by 1 */
#define  RCC_CFGR2_ADCPRE34_DIV2             ((uint32_t)0x00002200U)        /*!< ADC34 PLL clock divided by 2 */
#define  RCC_CFGR2_ADCPRE34_DIV4             ((uint32_t)0x00002400U)        /*!< ADC34 PLL clock divided by 4 */
#define  RCC_CFGR2_ADCPRE34_DIV6             ((uint32_t)0x00002600U)        /*!< ADC34 PLL clock divided by 6 */
#define  RCC_CFGR2_ADCPRE34_DIV8             ((uint32_t)0x00002800U)        /*!< ADC34 PLL clock divided by 8 */
#define  RCC_CFGR2_ADCPRE34_DIV10            ((uint32_t)0x00002A00U)        /*!< ADC34 PLL clock divided by 10 */
#define  RCC_CFGR2_ADCPRE34_DIV12            ((uint32_t)0x00002C00U)        /*!< ADC34 PLL clock divided by 12 */
#define  RCC_CFGR2_ADCPRE34_DIV16            ((uint32_t)0x00002E00U)        /*!< ADC34 PLL clock divided by 16 */
#define  RCC_CFGR2_ADCPRE34_DIV32            ((uint32_t)0x00003000U)        /*!< ADC34 PLL clock divided by 32 */
#define  RCC_CFGR2_ADCPRE34_DIV64            ((uint32_t)0x00003200U)        /*!< ADC34 PLL clock divided by 64 */
#define  RCC_CFGR2_ADCPRE34_DIV128           ((uint32_t)0x00003400U)        /*!< ADC34 PLL clock divided by 128 */
#define  RCC_CFGR2_ADCPRE34_DIV256           ((uint32_t)0x00003600U)        /*!< ADC34 PLL clock divided by 256 */

#endif
/*******************  Bit definition for RCC_CFGR3 register  ******************/
#define  RCC_CFGR3_USART1SW                  ((uint32_t)0x00000003U)        /*!< USART1SW[1:0] bits */
#define  RCC_CFGR3_USART1SW_0                ((uint32_t)0x00000001U)        /*!< Bit 0 */
#define  RCC_CFGR3_USART1SW_1                ((uint32_t)0x00000002U)        /*!< Bit 1 */

