HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define  RCC_CFGR3_USART1SW_PCLK2            ((uint32_t)0x00000000U)        /*!< PCLK2 clock used as USART1 clock source */
#else
#define  RCC_CFGR3_USART1SW_PCLK1            ((uint32_t)0x00000000U)        /*!< PCLK1 clock used as USART1 clock source */
#endif
#define  RCC_CFGR3_USART1SW_SYSCLK           ((uint32_t)0x00000001U)        /*!< System clock selected as USART1 clock source */
#define  RCC_CFGR3_USART1SW_LSE              ((uint32_t)0x00000002U)        /*!< LSE oscillator clock used as USART1 clock source */
#define  RCC_CFGR3_USART1SW_HSI              ((uint32_t)0x00000003U)        /*!< HSI oscillator clock used as USART1 clock source */
/* Legacy defines */
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define  RCC_CFGR3_USART1SW_PCLK             RCC_CFGR3_USART1SW_PCLK2
#else
#define  RCC_CFGR3_USART1SW_PCLK             RCC_CFGR3_USART1SW_PCLK1
#endif

#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xE) || defined(STM32F303xE) || defined(STM32F318xx) || defined(STM32F398xx)
#define  RCC_CFGR3_I2CSW                     ((uint32_t)0x00000070U)        /*!< I2CSW bits */
#elif defined(STM32F303x8) || defined(STM32F328xx) || defined(STM32F334x8)
#define  RCC_CFGR3_I2CSW                     ((uint32_t)0x00000010U)        /*!< I2CSW bits */
#else
#define  RCC_CFGR3_I2CSW                     ((uint32_t)0x00000030U)        /*!< I2CSW bits */
#endif
#define  RCC_CFGR3_I2C1SW                    ((uint32_t)0x00000010U)        /*!< I2C1SW bits */
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx) || defined(STM32F398xx)
#define  RCC_CFGR3_I2C2SW                    ((uint32_t)0x00000020U)        /*!< I2C2SW bits */
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xE) || defined(STM32F303xE) || defined(STM32F318xx) || defined(STM32F398xx)
#define  RCC_CFGR3_I2C3SW                    ((uint32_t)0x00000040U)        /*!< I2C3SW bits */
#endif

#define  RCC_CFGR3_I2C1SW_HSI                ((uint32_t)0x00000000U)        /*!< HSI oscillator clock used as I2C1 clock source */
#define  RCC_CFGR3_I2C1SW_SYSCLK             ((uint32_t)0x00000010U)        /*!< System clock selected as I2C1 clock source */
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx) || defined(STM32F398xx)
#define  RCC_CFGR3_I2C2SW_HSI                ((uint32_t)0x00000000U)        /*!< HSI oscillator clock used as I2C2 clock source */
#define  RCC_CFGR3_I2C2SW_SYSCLK             ((uint32_t)0x00000020U)        /*!< System clock selected as I2C2 clock source */
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xE) || defined(STM32F303xE) || defined(STM32F318xx) || defined(STM32F398xx)
#define  RCC_CFGR3_I2C3SW_HSI                ((uint32_t)0x00000000U)        /*!< HSI oscillator clock used as I2C3 clock source */
#define  RCC_CFGR3_I2C3SW_SYSCLK             ((uint32_t)0x00000040U)        /*!< System clock selected as I2C3 clock source */

#endif
#if defined (STM32F378xx) || defined (STM32F373xC)
#else
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F318xx)
#define  RCC_CFGR3_TIMSW                     ((uint32_t)0x00002D00U)        /*!< TIMSW bits */
#elif defined(STM32F302xC) || defined(STM32F303xC) || defined(STM32F358xx)
#define  RCC_CFGR3_TIMSW                     ((uint32_t)0x00000300U)        /*!< TIMSW bits */
#elif defined(STM32F302xE) || defined(STM32F303xE) ||  defined(STM32F398xx)
#define  RCC_CFGR3_TIMSW                     ((uint32_t)0x0000AF00U)        /*!< TIMSW bits */
#elif defined(STM32F303x8) || defined(STM32F328xx) || defined(STM32F334x8)
#define  RCC_CFGR3_TIMSW                     ((uint32_t)0x00000100U)        /*!< TIMSW bits */
#endif
#define  RCC_CFGR3_TIM1SW                    ((uint32_t)0x00000100U)        /*!< TIM1SW bits */
#endif
#if defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
#define  RCC_CFGR3_TIM8SW                    ((uint32_t)0x00000200U)        /*!< TIM8SW bits */
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xE) || defined(STM32F303xE) || defined(STM32F318xx) || defined(STM32F398xx)
#define  RCC_CFGR3_TIM15SW                   ((uint32_t)0x00000400U)        /*!< TIM15SW bits */
#define  RCC_CFGR3_TIM16SW                   ((uint32_t)0x00000800U)        /*!< TIM16SW bits */
#define  RCC_CFGR3_TIM17SW                   ((uint32_t)0x00002000U)        /*!< TIM17SW bits */
#endif
#if defined(STM32F303xE) || defined(STM32F398xx)
#define  RCC_CFGR3_TIM20SW                   ((uint32_t)0x00008000U)        /*!< TIM20SW bits */
#endif
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define  RCC_CFGR3_TIM2SW                    ((uint32_t)0x01000000U)        /*!< TIM2SW bits */
#define  RCC_CFGR3_TIM34SW                    ((uint32_t)0x02000000U)        /*!< TIM34SW bits */
#endif
#if defined (STM32F378xx) || defined (STM32F373xC)
#else
#define  RCC_CFGR3_TIM1SW_PCLK2              ((uint32_t)0x00000000U)        /*!< PCLK2 used as TIM1 clock source */
#define  RCC_CFGR3_TIM1SW_PLL                ((uint32_t)0x00000100U)        /*!< PLL clock used as TIM1 clock source */
#endif
#if defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
#define  RCC_CFGR3_TIM8SW_PCLK2              ((uint32_t)0x00000000U)        /*!< PCLK2 used as TIM8 clock source */
#define  RCC_CFGR3_TIM8SW_PLL                ((uint32_t)0x00000200U)        /*!< PLL clock used as TIM8 clock source */
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xE) || defined(STM32F303xE) || defined(STM32F318xx) || defined(STM32F398xx)
#define  RCC_CFGR3_TIM15SW_PCLK2             ((uint32_t)0x00000000U)        /*!< PCLK2 used as TIM15 clock source */
#define  RCC_CFGR3_TIM15SW_PLL               ((uint32_t)0x00000400U)        /*!< PLL clock used as TIM15 clock source */
#define  RCC_CFGR3_TIM16SW_PCLK2             ((uint32_t)0x00000000U)        /*!< PCLK2 used as TIM16 clock source */
#define  RCC_CFGR3_TIM16SW_PLL               ((uint32_t)0x00000800U)        /*!< PLL clock used as TIM16 clock source */
#define  RCC_CFGR3_TIM17SW_PCLK2             ((uint32_t)0x00000000U)        /*!< PCLK2 used as TIM17 clock source */
#define  RCC_CFGR3_TIM17SW_PLL               ((uint32_t)0x00002000U)        /*!< PLL clock used as TIM17 clock source */
#endif
#if defined(STM32F303xE) || defined(STM32F398xx)
#define  RCC_CFGR3_TIM20SW_PCLK2              ((uint32_t)0x00000000U)        /*!< PCLK2 used as TIM20 clock source */
#define  RCC_CFGR3_TIM20SW_PLL                ((uint32_t)0x00008000U)        /*!< PLL clock used as TIM20 clock source */
#endif

#if defined (STM32F378xx) || defined (STM32F373xC)
#define  RCC_CFGR3_CECSW                     ((uint32_t)0x00000040U)        /*!< CECSW bits */

#define  RCC_CFGR3_CECSW_HSI_DIV244          ((uint32_t)0x00000000U)        /*!< HSI clock divided by 244 selected as HDMI CEC entry clock source */
#define  RCC_CFGR3_CECSW_LSE                 ((uint32_t)0x00000040U)        /*!< LSE clock selected as HDMI CEC entry clock source */

#endif
#if defined(STM32F334x8)
#define  RCC_CFGR3_HRTIMSW                   ((uint32_t)0x00001000U)        /*!< HRTIM1SW bits */
#define  RCC_CFGR3_HRTIM1SW                  ((uint32_t)0x00001000U)        /*!< HRTIM1SW bits */

#define  RCC_CFGR3_HRTIM1SW_PCLK2            ((uint32_t)0x00000000U)        /*!< PCLK2 used as  HRTIM1 clock source */
#define  RCC_CFGR3_HRTIM1SW_PLL              ((uint32_t)0x00001000U)        /*!< PLL clock used as  HRTIM1 clock source */

#endif
#if defined(STM32F303x8)||defined(STM32F334x8)||defined(STM32F328xx)||defined(STM32F301x8)||defined(STM32F302x8)||defined(STM32F318xx)
#else
#define  RCC_CFGR3_USART2SW                  ((uint32_t)0x00030000U)        /*!< USART2SW[1:0] bits */
#define  RCC_CFGR3_USART2SW_0                ((uint32_t)0x00010000U)        /*!< Bit 0 */
#define  RCC_CFGR3_USART2SW_1                ((uint32_t)0x00020000U)        /*!< Bit 1 */

