HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
#define  RCC_CFGR3_USART2SW_PCLK             ((uint32_t)0x00000000U)        /*!< PCLK1 clock used as USART2 clock source */
#define  RCC_CFGR3_USART2SW_SYSCLK           ((uint32_t)0x00010000U)        /*!< System clock selected as USART2 clock source */
#define  RCC_CFGR3_USART2SW_LSE              ((uint32_t)0x00020000U)        /*!< LSE oscillator clock used as USART2 clock source */
#define  RCC_CFGR3_USART2SW_HSI              ((uint32_t)0x00030000U)        /*!< HSI oscillator clock used as USART2 clock source */

#define  RCC_CFGR3_USART3SW                  ((uint32_t)0x000C0000U)        /*!< USART3SW[1:0] bits */
#define  RCC_CFGR3_USART3SW_0                ((uint32_t)0x00040000U)        /*!< Bit 0 */
#define  RCC_CFGR3_USART3SW_1                ((uint32_t)0x00080000U)        /*!< Bit 1 */

#define  RCC_CFGR3_USART3SW_PCLK             ((uint32_t)0x00000000U)        /*!< PCLK1 clock used as USART3 clock source */
#define  RCC_CFGR3_USART3SW_SYSCLK           ((uint32_t)0x00040000U)        /*!< System clock selected as USART3 clock source */
#define  RCC_CFGR3_USART3SW_LSE              ((uint32_t)0x00080000U)        /*!< LSE oscillator clock used as USART3 clock source */
#define  RCC_CFGR3_USART3SW_HSI              ((uint32_t)0x000C0000U)        /*!< HSI oscillator clock used as USART3 clock source */

#endif
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
#define  RCC_CFGR3_UART4SW                   ((uint32_t)0x00300000U)        /*!< UART4SW[1:0] bits */
#define  RCC_CFGR3_UART4SW_0                 ((uint32_t)0x00100000U)        /*!< Bit 0 */
#define  RCC_CFGR3_UART4SW_1                 ((uint32_t)0x00200000U)        /*!< Bit 1 */

#define  RCC_CFGR3_UART4SW_PCLK              ((uint32_t)0x00000000U)        /*!< PCLK1 clock used as UART4 clock source */
#define  RCC_CFGR3_UART4SW_SYSCLK            ((uint32_t)0x00100000U)        /*!< System clock selected as UART4 clock source */
#define  RCC_CFGR3_UART4SW_LSE               ((uint32_t)0x00200000U)        /*!< LSE oscillator clock used as UART4 clock source */
#define  RCC_CFGR3_UART4SW_HSI               ((uint32_t)0x00300000U)        /*!< HSI oscillator clock used as UART4 clock source */

#define  RCC_CFGR3_UART5SW                   ((uint32_t)0x00C00000U)        /*!< UART5SW[1:0] bits */
#define  RCC_CFGR3_UART5SW_0                 ((uint32_t)0x00400000U)        /*!< Bit 0 */
#define  RCC_CFGR3_UART5SW_1                 ((uint32_t)0x00800000U)        /*!< Bit 1 */

#define  RCC_CFGR3_UART5SW_PCLK              ((uint32_t)0x00000000U)        /*!< PCLK1 clock used as UART5 clock source */
#define  RCC_CFGR3_UART5SW_SYSCLK            ((uint32_t)0x00400000U)        /*!< System clock selected as UART5 clock source */
#define  RCC_CFGR3_UART5SW_LSE               ((uint32_t)0x00800000U)        /*!< LSE oscillator clock used as UART5 clock source */
#define  RCC_CFGR3_UART5SW_HSI               ((uint32_t)0x00C00000U)        /*!< HSI oscillator clock used as UART5 clock source */

#endif
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define  RCC_CFGR3_TIM2SW_PCLK1              ((uint32_t)0x00000000U)        /*!< PCLK1 used as TIM2 clock source */
#define  RCC_CFGR3_TIM2SW_PLL                ((uint32_t)0x01000000U)        /*!< PLL clock used as TIM2 clock source */

#define  RCC_CFGR3_TIM34SW_PCLK1              ((uint32_t)0x00000000U)        /*!< PCLK1 used as TIM3/TIM4 clock source */
#define  RCC_CFGR3_TIM34SW_PLL                ((uint32_t)0x02000000U)        /*!< PLL clock used as TIM3/TIM4 clock source */

#endif
#if defined (STM32F378xx) || defined (STM32F373xC)
#else
/* Legacy defines */
#define  RCC_CFGR3_TIM1SW_HCLK                RCC_CFGR3_TIM1SW_PCLK2
#if defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
#define  RCC_CFGR3_TIM8SW_HCLK                RCC_CFGR3_TIM8SW_PCLK2
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xE) || defined(STM32F303xE) || defined(STM32F318xx) || defined(STM32F398xx)
#define  RCC_CFGR3_TIM15SW_HCLK               RCC_CFGR3_TIM15SW_PCLK2
#define  RCC_CFGR3_TIM16SW_HCLK               RCC_CFGR3_TIM16SW_PCLK2
#define  RCC_CFGR3_TIM17SW_HCLK               RCC_CFGR3_TIM17SW_PCLK2
#endif
#if defined(STM32F303xE) || defined(STM32F398xx)
#define  RCC_CFGR3_TIM20SW_HCLK               RCC_CFGR3_TIM20SW_PCLK2
#endif
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define  RCC_CFGR3_TIM2SW_HCLK                RCC_CFGR3_TIM2SW_PCLK1
#define  RCC_CFGR3_TIM34SW_HCLK               RCC_CFGR3_TIM34SW_PCLK1
#endif
#if defined(STM32F334x8)
#define  RCC_CFGR3_HRTIM1SW_HCLK              RCC_CFGR3_HRTIM1SW_PCLK2
#endif

#endif
/******************************************************************************/
/*                                                                            */
/*                           Real-Time Clock (RTC)                            */
/*                                                                            */
/******************************************************************************/
/*
* @brief Specific device feature definitions  (not present on all devices in the STM32F3 family)
*/
#define RTC_TAMPER1_SUPPORT  /*!< TAMPER 1 feature support */
#define RTC_TAMPER2_SUPPORT  /*!< TAMPER 2 feature support */
#if defined(STM32F303x8)||defined(STM32F334x8)||defined(STM32F328xx)||defined(STM32F301x8)||defined(STM32F302x8)||defined(STM32F318xx)
#else
#define RTC_TAMPER3_SUPPORT  /*!< TAMPER 3 feature support */
#endif
#define RTC_BACKUP_SUPPORT   /*!< BACKUP register feature support */
#define RTC_WAKEUP_SUPPORT   /*!< WAKEUP feature support */

/********************  Bits definition for RTC_TR register  *******************/
#define RTC_TR_PM                            ((uint32_t)0x00400000U)
#define RTC_TR_HT                            ((uint32_t)0x00300000U)
#define RTC_TR_HT_0                          ((uint32_t)0x00100000U)
#define RTC_TR_HT_1                          ((uint32_t)0x00200000U)
#define RTC_TR_HU                            ((uint32_t)0x000F0000U)
#define RTC_TR_HU_0                          ((uint32_t)0x00010000U)
#define RTC_TR_HU_1                          ((uint32_t)0x00020000U)
#define RTC_TR_HU_2                          ((uint32_t)0x00040000U)
#define RTC_TR_HU_3                          ((uint32_t)0x00080000U)
#define RTC_TR_MNT                           ((uint32_t)0x00007000U)
#define RTC_TR_MNT_0                         ((uint32_t)0x00001000U)
#define RTC_TR_MNT_1                         ((uint32_t)0x00002000U)
#define RTC_TR_MNT_2                         ((uint32_t)0x00004000U)
#define RTC_TR_MNU                           ((uint32_t)0x00000F00U)
#define RTC_TR_MNU_0                         ((uint32_t)0x00000100U)
#define RTC_TR_MNU_1                         ((uint32_t)0x00000200U)
#define RTC_TR_MNU_2                         ((uint32_t)0x00000400U)
#define RTC_TR_MNU_3                         ((uint32_t)0x00000800U)
#define RTC_TR_ST                            ((uint32_t)0x00000070U)
#define RTC_TR_ST_0                          ((uint32_t)0x00000010U)
#define RTC_TR_ST_1                          ((uint32_t)0x00000020U)
#define RTC_TR_ST_2                          ((uint32_t)0x00000040U)
#define RTC_TR_SU                            ((uint32_t)0x0000000FU)
#define RTC_TR_SU_0                          ((uint32_t)0x00000001U)
#define RTC_TR_SU_1                          ((uint32_t)0x00000002U)
#define RTC_TR_SU_2                          ((uint32_t)0x00000004U)
#define RTC_TR_SU_3                          ((uint32_t)0x00000008U)

