HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
/*****************  Bit definition for SDADC_CR1 register  ********************/
#define  SDADC_CR1_EOCALIE                       ((uint32_t)0x00000001U)        /*!< End of calibration interrupt enable */
#define  SDADC_CR1_JEOCIE                        ((uint32_t)0x00000002U)        /*!< Injected end of conversion interrupt enable */
#define  SDADC_CR1_JOVRIE                        ((uint32_t)0x00000004U)        /*!< Injected data overrun interrupt enable */
#define  SDADC_CR1_REOCIE                        ((uint32_t)0x00000008U)        /*!< Regular end of conversion interrupt enable */
#define  SDADC_CR1_ROVRIE                        ((uint32_t)0x00000010U)        /*!< Regular data overrun interrupt enable */
#define  SDADC_CR1_REFV                          ((uint32_t)0x00000300U)        /*!< Reference voltage selection */
#define  SDADC_CR1_REFV_0                        ((uint32_t)0x00000100U)        /*!< Reference voltage selection bit 0 */
#define  SDADC_CR1_REFV_1                        ((uint32_t)0x00000200U)        /*!< Reference voltage selection bit 1 */
#define  SDADC_CR1_SLOWCK                        ((uint32_t)0x00000400U)        /*!< Slow clock mode enable */
#define  SDADC_CR1_SBI                           ((uint32_t)0x00000800U)        /*!< Enter standby mode when idle */
#define  SDADC_CR1_PDI                           ((uint32_t)0x00001000U)        /*!< Enter power down mode when idle */
#define  SDADC_CR1_JSYNC                         ((uint32_t)0x00004000U)        /*!< Launch a injected conversion synchronously with SDADC1 */
#define  SDADC_CR1_RSYNC                         ((uint32_t)0x00008000U)        /*!< Launch regular conversion synchronously with SDADC1 */
#define  SDADC_CR1_JDMAEN                        ((uint32_t)0x00010000U)        /*!< DMA channel enabled to read data for the injected channel group */
#define  SDADC_CR1_RDMAEN                        ((uint32_t)0x00020000U)        /*!< DMA channel enabled to read data for the regular channel */
#define  SDADC_CR1_INIT                          ((uint32_t)0x80000000U)        /*!< Initialization mode request */

/*****************  Bit definition for SDADC_CR2 register  ********************/
#define  SDADC_CR2_ADON                          ((uint32_t)0x00000001U)        /*!< SDADC enable */
#define  SDADC_CR2_CALIBCNT                      ((uint32_t)0x00000006U)        /*!< Number of calibration sequences to be performed */
#define  SDADC_CR2_CALIBCNT_0                    ((uint32_t)0x00000002U)        /*!< Number of calibration sequences to be performed bit 0 */
#define  SDADC_CR2_CALIBCNT_1                    ((uint32_t)0x00000004U)        /*!< Number of calibration sequences to be performed bit 1 */
#define  SDADC_CR2_STARTCALIB                    ((uint32_t)0x00000010U)        /*!< Start calibration */
#define  SDADC_CR2_JCONT                         ((uint32_t)0x00000020U)        /*!< Continuous mode selection for injected conversions */
#define  SDADC_CR2_JDS                           ((uint32_t)0x00000040U)        /*!< Delay start of injected conversions */
#define  SDADC_CR2_JEXTSEL                       ((uint32_t)0x00000F00U)        /*!< Trigger signal selection for launching injected conversions */
#define  SDADC_CR2_JEXTSEL_0                     ((uint32_t)0x00000100U)        /*!< Trigger signal selection for launching injected conversions bit 0 */
#define  SDADC_CR2_JEXTSEL_1                     ((uint32_t)0x00000200U)        /*!< Trigger signal selection for launching injected conversions bit 1 */
#define  SDADC_CR2_JEXTSEL_2                     ((uint32_t)0x00000400U)        /*!< Trigger signal selection for launching injected conversions bit 2 */
#define  SDADC_CR2_JEXTSEL_3                     ((uint32_t)0x00000800U)        /*!< Trigger signal selection for launching injected conversions bit 3 */
#define  SDADC_CR2_JEXTEN                        ((uint32_t)0x00006000U)        /*!< Trigger enable and trigger edge selection for injected conversions */
#define  SDADC_CR2_JEXTEN_0                      ((uint32_t)0x00002000U)        /*!< Trigger enable and trigger edge selection for injected conversions bit 0 */
#define  SDADC_CR2_JEXTEN_1                      ((uint32_t)0x00004000U)        /*!< Trigger enable and trigger edge selection for injected conversions bit 1 */
#define  SDADC_CR2_JSWSTART                      ((uint32_t)0x00008000U)        /*!< Start a conversion of the injected group of channels */
#define  SDADC_CR2_RCH                           ((uint32_t)0x000F0000U)        /*!< Regular channel selection */
#define  SDADC_CR2_RCH_0                         ((uint32_t)0x00010000U)        /*!< Regular channel selection bit 0 */
#define  SDADC_CR2_RCH_1                         ((uint32_t)0x00020000U)        /*!< Regular channel selection bit 1 */
#define  SDADC_CR2_RCH_2                         ((uint32_t)0x00040000U)        /*!< Regular channel selection bit 2 */
#define  SDADC_CR2_RCH_3                         ((uint32_t)0x00080000U)        /*!< Regular channel selection bit 3 */
#define  SDADC_CR2_RCONT                         ((uint32_t)0x00400000U)        /*!< Continuous mode selection for regular conversions */
#define  SDADC_CR2_RSWSTART                      ((uint32_t)0x00800000U)        /*!< Software start of a conversion on the regular channel */
#define  SDADC_CR2_FAST                          ((uint32_t)0x01000000U)        /*!< Fast conversion mode selection */

/********************  Bit definition for SDADC_ISR register  *****************/
#define  SDADC_ISR_EOCALF                        ((uint32_t)0x00000001U)        /*!< End of calibration flag */
#define  SDADC_ISR_JEOCF                         ((uint32_t)0x00000002U)        /*!< End of injected conversion flag */
#define  SDADC_ISR_JOVRF                         ((uint32_t)0x00000004U)        /*!< Injected conversion overrun flag */
#define  SDADC_ISR_REOCF                         ((uint32_t)0x00000008U)        /*!< End of regular conversion flag */
#define  SDADC_ISR_ROVRF                         ((uint32_t)0x00000010U)        /*!< Regular conversion overrun flag */
#define  SDADC_ISR_CALIBIP                       ((uint32_t)0x00001000U)        /*!< Calibration in progress status */
#define  SDADC_ISR_JCIP                          ((uint32_t)0x00002000U)        /*!< Injected conversion in progress status */
#define  SDADC_ISR_RCIP                          ((uint32_t)0x00004000U)        /*!< Regular conversion in progress status */
#define  SDADC_ISR_STABIP                        ((uint32_t)0x00008000U)        /*!< Stabilization in progress status */
#define  SDADC_ISR_INITRDY                       ((uint32_t)0x80000000U)        /*!< Initialization mode is ready */

