HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
/******************  Bit definition for SDADC_CLRISR register  ****************/
#define  SDADC_ISR_CLREOCALF                     ((uint32_t)0x00000001U)       /*!< Clear the end of calibration flag */
#define  SDADC_ISR_CLRJOVRF                      ((uint32_t)0x00000004U)       /*!< Clear the injected conversion overrun flag */
#define  SDADC_ISR_CLRROVRF                      ((uint32_t)0x00000010U)       /*!< Clear the regular conversion overrun flag */

/******************  Bit definition for SDADC_JCHGR register  *****************/
#define  SDADC_JCHGR_JCHG                        ((uint32_t)0x000001FFU)       /*!< Injected channel group selection */
#define  SDADC_JCHGR_JCHG_0                      ((uint32_t)0x00000001U)       /*!< Injected channel 0 selection */
#define  SDADC_JCHGR_JCHG_1                      ((uint32_t)0x00000002U)       /*!< Injected channel 1 selection */
#define  SDADC_JCHGR_JCHG_2                      ((uint32_t)0x00000004U)       /*!< Injected channel 2 selection */
#define  SDADC_JCHGR_JCHG_3                      ((uint32_t)0x00000008U)       /*!< Injected channel 3 selection */
#define  SDADC_JCHGR_JCHG_4                      ((uint32_t)0x00000010U)       /*!< Injected channel 4 selection */
#define  SDADC_JCHGR_JCHG_5                      ((uint32_t)0x00000020U)       /*!< Injected channel 5 selection */
#define  SDADC_JCHGR_JCHG_6                      ((uint32_t)0x00000040U)       /*!< Injected channel 6 selection */
#define  SDADC_JCHGR_JCHG_7                      ((uint32_t)0x00000080U)       /*!< Injected channel 7 selection */
#define  SDADC_JCHGR_JCHG_8                      ((uint32_t)0x00000100U)       /*!< Injected channel 8 selection */

/******************  Bit definition for SDADC_CONF0R register  ****************/
#define  SDADC_CONF0R_OFFSET0                    ((uint32_t)0x00000FFFU)       /*!< 12-bit calibration offset for configuration 0 */
#define  SDADC_CONF0R_GAIN0                      ((uint32_t)0x00700000U)       /*!< Gain setting for configuration 0 */
#define  SDADC_CONF0R_GAIN0_0                    ((uint32_t)0x00100000U)       /*!< Gain setting for configuration 0 Bit 0*/
#define  SDADC_CONF0R_GAIN0_1                    ((uint32_t)0x00200000U)       /*!< Gain setting for configuration 0 Bit 1 */
#define  SDADC_CONF0R_GAIN0_2                    ((uint32_t)0x00400000U)       /*!< Gain setting for configuration 0 Bit 2 */
#define  SDADC_CONF0R_SE0                        ((uint32_t)0x0C000000U)       /*!< Single ended mode for configuration 0 */
#define  SDADC_CONF0R_SE0_0                      ((uint32_t)0x04000000U)       /*!< Single ended mode for configuration 0 Bit 0 */
#define  SDADC_CONF0R_SE0_1                      ((uint32_t)0x08000000U)       /*!< Single ended mode for configuration 0 Bit 1 */
#define  SDADC_CONF0R_COMMON0                    ((uint32_t)0xC0000000U)       /*!< Common mode for configuration 0 */
#define  SDADC_CONF0R_COMMON0_0                  ((uint32_t)0x40000000U)       /*!< Common mode for configuration 0 Bit 0 */
#define  SDADC_CONF0R_COMMON0_1                  ((uint32_t)0x80000000U)       /*!< Common mode for configuration 0 Bit 1 */

/******************  Bit definition for SDADC_CONF1R register  ****************/
#define  SDADC_CONF1R_OFFSET1                    ((uint32_t)0x00000FFFU)       /*!< 12-bit calibration offset for configuration 1 */
#define  SDADC_CONF1R_GAIN1                      ((uint32_t)0x00700000U)       /*!< Gain setting for configuration 1 */
#define  SDADC_CONF1R_GAIN1_0                    ((uint32_t)0x00100000U)       /*!< Gain setting for configuration 1 Bit 0 */
#define  SDADC_CONF1R_GAIN1_1                    ((uint32_t)0x00200000U)       /*!< Gain setting for configuration 1 Bit 1 */
#define  SDADC_CONF1R_GAIN1_2                    ((uint32_t)0x00400000U)       /*!< Gain setting for configuration 1 Bit 2 */
#define  SDADC_CONF1R_SE1                        ((uint32_t)0x0C000000U)       /*!< Single ended mode for configuration 1 */
#define  SDADC_CONF1R_SE1_0                      ((uint32_t)0x04000000U)       /*!< Single ended mode for configuration 1 Bit 0 */
#define  SDADC_CONF1R_SE1_1                      ((uint32_t)0x08000000U)       /*!< Single ended mode for configuration 1 Bit 1 */
#define  SDADC_CONF1R_COMMON1                    ((uint32_t)0xC0000000U)       /*!< Common mode for configuration 1 */
#define  SDADC_CONF1R_COMMON1_0                  ((uint32_t)0x40000000U)       /*!< Common mode for configuration 1 Bit 0 */
#define  SDADC_CONF1R_COMMON1_1                  ((uint32_t)0x40000000U)       /*!< Common mode for configuration 1 Bit 1 */

/******************  Bit definition for SDADC_CONF2R register  ****************/
#define  SDADC_CONF2R_OFFSET2                    ((uint32_t)0x00000FFFU)       /*!< 12-bit calibration offset for configuration 2 */
#define  SDADC_CONF2R_GAIN2                      ((uint32_t)0x00700000U)       /*!< Gain setting for configuration 2 */
#define  SDADC_CONF2R_GAIN2_0                    ((uint32_t)0x00100000U)       /*!< Gain setting for configuration 2 Bit 0 */
#define  SDADC_CONF2R_GAIN2_1                    ((uint32_t)0x00200000U)       /*!< Gain setting for configuration 2 Bit 1 */
#define  SDADC_CONF2R_GAIN2_2                    ((uint32_t)0x00400000U)       /*!< Gain setting for configuration 2 Bit 2 */
#define  SDADC_CONF2R_SE2                        ((uint32_t)0x0C000000U)       /*!< Single ended mode for configuration 2 */
#define  SDADC_CONF2R_SE2_0                      ((uint32_t)0x04000000U)       /*!< Single ended mode for configuration 2 Bit 0 */
#define  SDADC_CONF2R_SE2_1                      ((uint32_t)0x08000000U)       /*!< Single ended mode for configuration 2 Bit 1 */
#define  SDADC_CONF2R_COMMON2                    ((uint32_t)0xC0000000U)       /*!< Common mode for configuration 2 */
#define  SDADC_CONF2R_COMMON2_0                  ((uint32_t)0x40000000U)       /*!< Common mode for configuration 2 Bit 0 */
#define  SDADC_CONF2R_COMMON2_1                  ((uint32_t)0x80000000U)       /*!< Common mode for configuration 2 Bit 1 */

/*****************  Bit definition for SDADC_CONFCHR1 register  ***************/
#define  SDADC_CONFCHR1_CONFCH0                  ((uint32_t)0x00000003U)      /*!< Channel 0 configuration */
#define  SDADC_CONFCHR1_CONFCH1                  ((uint32_t)0x00000030U)      /*!< Channel 1 configuration */
#define  SDADC_CONFCHR1_CONFCH2                  ((uint32_t)0x00000300U)      /*!< Channel 2 configuration */
#define  SDADC_CONFCHR1_CONFCH3                  ((uint32_t)0x00003000U)      /*!< Channel 3 configuration */
#define  SDADC_CONFCHR1_CONFCH4                  ((uint32_t)0x00030000U)      /*!< Channel 4 configuration */
#define  SDADC_CONFCHR1_CONFCH5                  ((uint32_t)0x00300000U)      /*!< Channel 5 configuration */
#define  SDADC_CONFCHR1_CONFCH6                  ((uint32_t)0x03000000U)      /*!< Channel 6 configuration */
#define  SDADC_CONFCHR1_CONFCH7                  ((uint32_t)0x30000000U)      /*!< Channel 7 configuration */

/*****************  Bit definition for SDADC_CONFCHR2 register  ***************/
#define  SDADC_CONFCHR2_CONFCH8                  ((uint32_t)0x00000003U)      /*!< Channel 8 configuration */

/*****************  Bit definition for SDADC_JDATAR register  ***************/
#define  SDADC_JDATAR_JDATA                      ((uint32_t)0x0000FFFFU)      /*!< Injected group conversion data */
#define  SDADC_JDATAR_JDATACH                    ((uint32_t)0x0F000000U)      /*!< Injected channel most recently converted */
#define  SDADC_JDATAR_JDATACH_0                  ((uint32_t)0x01000000U)      /*!< Injected channel most recently converted bit 0 */
#define  SDADC_JDATAR_JDATACH_1                  ((uint32_t)0x02000000U)      /*!< Injected channel most recently converted bit 1 */
#define  SDADC_JDATAR_JDATACH_2                  ((uint32_t)0x04000000U)      /*!< Injected channel most recently converted bit 2 */
#define  SDADC_JDATAR_JDATACH_3                  ((uint32_t)0x08000000U)      /*!< Injected channel most recently converted bit 3 */

/*****************  Bit definition for SDADC_RDATAR register  ***************/
#define  SDADC_RDATAR_RDATA                      ((uint32_t)0x0000FFFFU)      /*!< Injected group conversion data */

/*****************  Bit definition for SDADC_JDATA12R register  ***************/
#define  SDADC_JDATA12R_JDATA2                      ((uint32_t)0xFFFF0000U)      /*!< Injected group conversion data for SDADC2 */
#define  SDADC_JDATA12R_JDATA1                      ((uint32_t)0x0000FFFFU)      /*!< Injected group conversion data for SDADC1 */

/*****************  Bit definition for SDADC_RDATA12R register  ***************/
#define  SDADC_RDATA12R_RDATA2                      ((uint32_t)0xFFFF0000U)      /*!< Regular conversion data for SDADC2 */
#define  SDADC_RDATA12R_RDATA1                      ((uint32_t)0x0000FFFFU)      /*!< Regular conversion data for SDADC1 */

/*****************  Bit definition for SDADC_JDATA13R register  ***************/
#define  SDADC_JDATA13R_JDATA3                      ((uint32_t)0xFFFF0000U)      /*!< Injected group conversion data for SDADC3 */
#define  SDADC_JDATA13R_JDATA1                      ((uint32_t)0x0000FFFFU)      /*!< Injected group conversion data for SDADC1 */

/*****************  Bit definition for SDADC_RDATA13R register  ***************/
#define  SDADC_RDATA13R_RDATA3                      ((uint32_t)0xFFFF0000U)      /*!< Regular conversion data for SDADC3 */
#define  SDADC_RDATA13R_RDATA1                      ((uint32_t)0x0000FFFFU)      /*!< Regular conversion data for SDADC1 */

#endif
/******************************************************************************/
/*                                                                            */
/*                        Serial Peripheral Interface (SPI)                   */
/*                                                                            */
/******************************************************************************/

