HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
/*
 * @brief Specific device feature definitions (not present on all devices in the STM32F3 family)
 */
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx) || defined(STM32F398xx)
#define SPI_I2S_SUPPORT                       /*!< I2S support */
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx)|| defined(STM32F398xx)
#define SPI_I2S_FULLDUPLEX_SUPPORT            /*!< I2S Full-Duplex support */
#endif
#else
/* Note: No specific macro feature on this device */
#endif

/*******************  Bit definition for SPI_CR1 register  ********************/
#define  SPI_CR1_CPHA                        ((uint32_t)0x00000001U)        /*!< Clock Phase */
#define  SPI_CR1_CPOL                        ((uint32_t)0x00000002U)        /*!< Clock Polarity */
#define  SPI_CR1_MSTR                        ((uint32_t)0x00000004U)        /*!< Master Selection */
#define  SPI_CR1_BR                          ((uint32_t)0x00000038U)        /*!< BR[2:0] bits (Baud Rate Control) */
#define  SPI_CR1_BR_0                        ((uint32_t)0x00000008U)        /*!< Bit 0 */
#define  SPI_CR1_BR_1                        ((uint32_t)0x00000010U)        /*!< Bit 1 */
#define  SPI_CR1_BR_2                        ((uint32_t)0x00000020U)        /*!< Bit 2 */
#define  SPI_CR1_SPE                         ((uint32_t)0x00000040U)        /*!< SPI Enable */
#define  SPI_CR1_LSBFIRST                    ((uint32_t)0x00000080U)        /*!< Frame Format */
#define  SPI_CR1_SSI                         ((uint32_t)0x00000100U)        /*!< Internal slave select */
#define  SPI_CR1_SSM                         ((uint32_t)0x00000200U)        /*!< Software slave management */
#define  SPI_CR1_RXONLY                      ((uint32_t)0x00000400U)        /*!< Receive only */
#define  SPI_CR1_CRCL                        ((uint32_t)0x00000800U)        /*!< CRC Length */
#define  SPI_CR1_CRCNEXT                     ((uint32_t)0x00001000U)        /*!< Transmit CRC next */
#define  SPI_CR1_CRCEN                       ((uint32_t)0x00002000U)        /*!< Hardware CRC calculation enable */
#define  SPI_CR1_BIDIOE                      ((uint32_t)0x00004000U)        /*!< Output enable in bidirectional mode */
#define  SPI_CR1_BIDIMODE                    ((uint32_t)0x00008000U)        /*!< Bidirectional data mode enable */

/*******************  Bit definition for SPI_CR2 register  ********************/
#define  SPI_CR2_RXDMAEN                     ((uint32_t)0x00000001U)        /*!< Rx Buffer DMA Enable */
#define  SPI_CR2_TXDMAEN                     ((uint32_t)0x00000002U)        /*!< Tx Buffer DMA Enable */
#define  SPI_CR2_SSOE                        ((uint32_t)0x00000004U)        /*!< SS Output Enable */
#define  SPI_CR2_NSSP                        ((uint32_t)0x00000008U)        /*!< NSS pulse management Enable */
#define  SPI_CR2_FRF                         ((uint32_t)0x00000010U)        /*!< Frame Format Enable */
#define  SPI_CR2_ERRIE                       ((uint32_t)0x00000020U)        /*!< Error Interrupt Enable */
#define  SPI_CR2_RXNEIE                      ((uint32_t)0x00000040U)        /*!< RX buffer Not Empty Interrupt Enable */
#define  SPI_CR2_TXEIE                       ((uint32_t)0x00000080U)        /*!< Tx buffer Empty Interrupt Enable */
#define  SPI_CR2_DS                          ((uint32_t)0x00000F00U)        /*!< DS[3:0] Data Size */
#define  SPI_CR2_DS_0                        ((uint32_t)0x00000100U)        /*!< Bit 0 */
#define  SPI_CR2_DS_1                        ((uint32_t)0x00000200U)        /*!< Bit 1 */
#define  SPI_CR2_DS_2                        ((uint32_t)0x00000400U)        /*!< Bit 2 */
#define  SPI_CR2_DS_3                        ((uint32_t)0x00000800U)        /*!< Bit 3 */
#define  SPI_CR2_FRXTH                       ((uint32_t)0x00001000U)        /*!< FIFO reception Threshold */
#define  SPI_CR2_LDMARX                      ((uint32_t)0x00002000U)        /*!< Last DMA transfer for reception */
#define  SPI_CR2_LDMATX                      ((uint32_t)0x00004000U)        /*!< Last DMA transfer for transmission */

/********************  Bit definition for SPI_SR register  ********************/
#define  SPI_SR_RXNE                         ((uint32_t)0x00000001U)        /*!< Receive buffer Not Empty */
#define  SPI_SR_TXE                          ((uint32_t)0x00000002U)        /*!< Transmit buffer Empty */
#define  SPI_SR_CHSIDE                       ((uint32_t)0x00000004U)        /*!< Channel side */
#define  SPI_SR_UDR                          ((uint32_t)0x00000008U)        /*!< Underrun flag */
#define  SPI_SR_CRCERR                       ((uint32_t)0x00000010U)        /*!< CRC Error flag */
#define  SPI_SR_MODF                         ((uint32_t)0x00000020U)        /*!< Mode fault */
#define  SPI_SR_OVR                          ((uint32_t)0x00000040U)        /*!< Overrun flag */
#define  SPI_SR_BSY                          ((uint32_t)0x00000080U)        /*!< Busy flag */
#define  SPI_SR_FRE                          ((uint32_t)0x00000100U)        /*!< TI frame format error */
#define  SPI_SR_FRLVL                        ((uint32_t)0x00000600U)        /*!< FIFO Reception Level */
#define  SPI_SR_FRLVL_0                      ((uint32_t)0x00000200U)        /*!< Bit 0 */
#define  SPI_SR_FRLVL_1                      ((uint32_t)0x00000400U)        /*!< Bit 1 */
#define  SPI_SR_FTLVL                        ((uint32_t)0x00001800U)        /*!< FIFO Transmission Level */
#define  SPI_SR_FTLVL_0                      ((uint32_t)0x00000800U)        /*!< Bit 0 */
#define  SPI_SR_FTLVL_1                      ((uint32_t)0x00001000U)        /*!< Bit 1 */

/********************  Bit definition for SPI_DR register  ********************/
#define  SPI_DR_DR                           ((uint32_t)0x0000FFFFU)        /*!< Data Register */

