HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
/*******************  Bit definition for SPI_CRCPR register  ******************/
#define  SPI_CRCPR_CRCPOLY                   ((uint32_t)0x0000FFFFU)        /*!< CRC polynomial register */

/******************  Bit definition for SPI_RXCRCR register  ******************/
#define  SPI_RXCRCR_RXCRC                    ((uint32_t)0x0000FFFFU)        /*!< Rx CRC Register */

/******************  Bit definition for SPI_TXCRCR register  ******************/
#define  SPI_TXCRCR_TXCRC                    ((uint32_t)0x0000FFFFU)        /*!< Tx CRC Register */

#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx) || defined(STM32F398xx)
/******************  Bit definition for SPI_I2SCFGR register  *****************/
#define  SPI_I2SCFGR_CHLEN                   ((uint32_t)0x00000001U)        /*!<Channel length (number of bits per audio channel) */
#define  SPI_I2SCFGR_DATLEN                  ((uint32_t)0x00000006U)        /*!<DATLEN[1:0] bits (Data length to be transferred) */
#define  SPI_I2SCFGR_DATLEN_0                ((uint32_t)0x00000002U)        /*!<Bit 0 */
#define  SPI_I2SCFGR_DATLEN_1                ((uint32_t)0x00000004U)        /*!<Bit 1 */
#define  SPI_I2SCFGR_CKPOL                   ((uint32_t)0x00000008U)        /*!<steady state clock polarity */
#define  SPI_I2SCFGR_I2SSTD                  ((uint32_t)0x00000030U)        /*!<I2SSTD[1:0] bits (I2S standard selection) */
#define  SPI_I2SCFGR_I2SSTD_0                ((uint32_t)0x00000010U)        /*!<Bit 0 */
#define  SPI_I2SCFGR_I2SSTD_1                ((uint32_t)0x00000020U)        /*!<Bit 1 */
#define  SPI_I2SCFGR_PCMSYNC                 ((uint32_t)0x00000080U)        /*!<PCM frame synchronization */
#define  SPI_I2SCFGR_I2SCFG                  ((uint32_t)0x00000300U)        /*!<I2SCFG[1:0] bits (I2S configuration mode) */
#define  SPI_I2SCFGR_I2SCFG_0                ((uint32_t)0x00000100U)        /*!<Bit 0 */
#define  SPI_I2SCFGR_I2SCFG_1                ((uint32_t)0x00000200U)        /*!<Bit 1 */
#define  SPI_I2SCFGR_I2SE                    ((uint32_t)0x00000400U)        /*!<I2S Enable */
#define  SPI_I2SCFGR_I2SMOD                  ((uint32_t)0x00000800U)        /*!<I2S mode selection */

/******************  Bit definition for SPI_I2SPR register  *******************/
#define  SPI_I2SPR_I2SDIV                    ((uint32_t)0x000000FFU)        /*!<I2S Linear prescaler */
#define  SPI_I2SPR_ODD                       ((uint32_t)0x00000100U)        /*!<Odd factor for the prescaler */
#define  SPI_I2SPR_MCKOE                     ((uint32_t)0x00000200U)        /*!<Master Clock Output Enable */

#endif
/******************************************************************************/
/*                                                                            */
/*                        System Configuration(SYSCFG)                        */
/*                                                                            */
/******************************************************************************/
/*****************  Bit definition for SYSCFG_CFGR1 register  ****************/
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define SYSCFG_CFGR1_MEM_MODE               ((uint32_t)0x00000007U) /*!< SYSCFG_Memory Remap Config */
#else
#define SYSCFG_CFGR1_MEM_MODE               ((uint32_t)0x00000003U) /*!< SYSCFG_Memory Remap Config */
#endif
#define SYSCFG_CFGR1_MEM_MODE_0             ((uint32_t)0x00000001U) /*!< Bit 0 */
#define SYSCFG_CFGR1_MEM_MODE_1             ((uint32_t)0x00000002U) /*!< Bit 1 */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define SYSCFG_CFGR1_MEM_MODE_2             ((uint32_t)0x00000004U) /*!< Bit 2 */
#endif
#if defined (STM32F302x8) ||  defined (STM32F302xC) ||defined (STM32F302xE) || defined (STM32F303xC) || defined (STM32F303xE)
#define SYSCFG_CFGR1_USB_IT_RMP             ((uint32_t)0x00000020U) /*!< USB interrupt remap */
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#else
#define SYSCFG_CFGR1_TIM1_ITR3_RMP          ((uint32_t)0x00000040U) /*!< Timer 1 ITR3 selection */
#define SYSCFG_CFGR1_DAC1_TRIG1_RMP         ((uint32_t)0x00000080U) /*!< DAC1 Trigger1 remap */
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F318xx)
#define SYSCFG_CFGR1_DMA_RMP                ((uint32_t)0x00003800U) /*!< DMA remap mask */
#elif defined(STM32F302xC) || defined(STM32F302xE)
#define SYSCFG_CFGR1_DMA_RMP                ((uint32_t)0x00003900U) /*!< DMA remap mask */
#elif defined(STM32F303x8) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F373xC) || defined(STM32F378xx)
#define SYSCFG_CFGR1_DMA_RMP                ((uint32_t)0x0000F800U) /*!< DMA remap mask */
#else
#define SYSCFG_CFGR1_DMA_RMP                ((uint32_t)0x00007900U) /*!< DMA remap mask */
#endif
#if defined (STM32F302xC) || defined (STM32F302xE) || defined (STM32F303xC) || defined (STM32F303xE)|| defined (STM32F358xx) || defined (STM32F398xx) 
#define SYSCFG_CFGR1_ADC24_DMA_RMP          ((uint32_t)0x00000100U) /*!< ADC2 and ADC4 DMA remap */
#endif
#define SYSCFG_CFGR1_TIM16_DMA_RMP          ((uint32_t)0x00000800U) /*!< Timer 16 DMA remap */
#define SYSCFG_CFGR1_TIM17_DMA_RMP          ((uint32_t)0x00001000U) /*!< Timer 17 DMA remap */
#define SYSCFG_CFGR1_TIM6DAC1Ch1_DMA_RMP    ((uint32_t)0x00002000U) /*!< Timer 6 / DAC1 Ch1 DMA remap */
#if defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx)|| defined(STM32F398xx)
#define SYSCFG_CFGR1_TIM7DAC1Ch2_DMA_RMP    ((uint32_t)0x00004000U) /*!< Timer 7 / DAC1 Ch2 DMA remap */
#endif
#if defined(STM32F303x8) || defined(STM32F328xx) || defined(STM32F334x8)
#define SYSCFG_CFGR1_DAC2Ch1_DMA_RMP        ((uint32_t)0x00008000U) /*!< DAC2 CH1 DMA remap */
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#define SYSCFG_CFGR1_TIM18DAC2Ch1_DMA_RMP   ((uint32_t)0x00008000U) /*!< Timer 18 / DAC2 Ch1 DMA remap */
#endif
#define SYSCFG_CFGR1_I2C_PB6_FMP            ((uint32_t)0x00010000U) /*!< I2C PB6 Fast mode plus */
#define SYSCFG_CFGR1_I2C_PB7_FMP            ((uint32_t)0x00020000U) /*!< I2C PB7 Fast mode plus */
#define SYSCFG_CFGR1_I2C_PB8_FMP            ((uint32_t)0x00040000U) /*!< I2C PB8 Fast mode plus */
#define SYSCFG_CFGR1_I2C_PB9_FMP            ((uint32_t)0x00080000U) /*!< I2C PB9 Fast mode plus */
#define SYSCFG_CFGR1_I2C1_FMP               ((uint32_t)0x00100000U) /*!< I2C1 Fast mode plus */
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F318xx)|| defined(STM32F358xx) || defined(STM32F373xC) || defined(STM32F378xx) || defined(STM32F398xx)
#define SYSCFG_CFGR1_I2C2_FMP               ((uint32_t)0x00200000U) /*!< I2C2 Fast mode plus */
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#else
#define SYSCFG_CFGR1_ENCODER_MODE           ((uint32_t)0x00C00000U) /*!< Encoder Mode */
#define SYSCFG_CFGR1_ENCODER_MODE_0         ((uint32_t)0x00400000U) /*!< Encoder Mode bit 0 */
#define SYSCFG_CFGR1_ENCODER_MODE_1         ((uint32_t)0x00800000U) /*!< Encoder Mode bit 1 */
#if defined(STM32F303xC)||defined(STM32F303xE)||defined(STM32F358xx)||defined(STM32F398xx)||defined(STM32F303x8)||defined(STM32F328xx)||defined(STM32F334x8)||defined(STM32F302xC)||defined(STM32F302xE)||defined(STM32F302x8)||defined(STM32F301x8)||defined(STM32F318xx)
#define SYSCFG_CFGR1_ENCODER_MODE_TIM2      ((uint32_t)0x00400000U) /*!< TIM2 IC1 and TIM2 IC2 are connected to TIM15 IC1 and TIM15 IC2 respectively */
#endif
#if defined(STM32F303xC)||defined(STM32F303xE)||defined(STM32F358xx)||defined(STM32F398xx)||defined(STM32F303x8)||defined(STM32F328xx)||defined(STM32F334x8)||defined(STM32F302xC)
#define SYSCFG_CFGR1_ENCODER_MODE_TIM3      ((uint32_t)0x00800000U) /*!< TIM3 IC1 and TIM3 IC2 are connected to TIM15 IC1 and TIM15 IC2 respectively */
#endif
#if defined(STM32F303xC)||defined(STM32F358xx)||defined(STM32F302xC)
#define SYSCFG_CFGR1_ENCODER_MODE_TIM4      ((uint32_t)0x00C00000U) /*!< TIM4 IC1 and TIM4 IC2 are connected to TIM15 IC1 and TIM15 IC2 respectively */
#endif
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xE) || defined(STM32F303xE) || defined(STM32F318xx) || defined(STM32F398xx)
#define SYSCFG_CFGR1_I2C3_FMP               ((uint32_t)0x01000000U) /*!< I2C3 Fast mode plus */
#endif
#if defined(STM32F373xC) || defined(STM32F378xx)
#define SYSCFG_CFGR1_VBAT                   ((uint32_t)0x01000000U) /*!< VBAT monitoring */
#endif
#define SYSCFG_CFGR1_FPU_IE                 ((uint32_t)0xFC000000U) /*!< Floating Point Unit Interrupt Enable */
#define SYSCFG_CFGR1_FPU_IE_0               ((uint32_t)0x04000000U) /*!< Floating Point Unit Interrupt Enable 0 */
#define SYSCFG_CFGR1_FPU_IE_1               ((uint32_t)0x08000000U) /*!< Floating Point Unit Interrupt Enable 1 */
#define SYSCFG_CFGR1_FPU_IE_2               ((uint32_t)0x10000000U) /*!< Floating Point Unit Interrupt Enable 2 */
#define SYSCFG_CFGR1_FPU_IE_3               ((uint32_t)0x20000000U) /*!< Floating Point Unit Interrupt Enable 3 */
#define SYSCFG_CFGR1_FPU_IE_4               ((uint32_t)0x40000000U) /*!< Floating Point Unit Interrupt Enable 4 */
#define SYSCFG_CFGR1_FPU_IE_5               ((uint32_t)0x80000000U) /*!< Floating Point Unit Interrupt Enable 5 */

#if defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F398xx)
/*****************  Bit definition for SYSCFG_RCR register  *******************/
#define SYSCFG_RCR_PAGE0          ((uint32_t)0x00000001U) /*!< ICODE SRAM Write protection page 0 */
#define SYSCFG_RCR_PAGE1          ((uint32_t)0x00000002U) /*!< ICODE SRAM Write protection page 1 */
#define SYSCFG_RCR_PAGE2          ((uint32_t)0x00000004U) /*!< ICODE SRAM Write protection page 2 */
#define SYSCFG_RCR_PAGE3          ((uint32_t)0x00000008U) /*!< ICODE SRAM Write protection page 3 */
#if defined(STM32F303xC) || defined(STM32F303xE) ||defined(STM32F358xx) || defined(STM32F398xx)
#define SYSCFG_RCR_PAGE4          ((uint32_t)0x00000010U) /*!< ICODE SRAM Write protection page 4 */
#define SYSCFG_RCR_PAGE5          ((uint32_t)0x00000020U) /*!< ICODE SRAM Write protection page 5 */
#define SYSCFG_RCR_PAGE6          ((uint32_t)0x00000040U) /*!< ICODE SRAM Write protection page 6 */
#define SYSCFG_RCR_PAGE7          ((uint32_t)0x00000080U) /*!< ICODE SRAM Write protection page 7 */
#endif
#if defined(STM32F303xE) || defined(STM32F398xx)
#define SYSCFG_RCR_PAGE8          ((uint32_t)0x00000100U) /*!< ICODE SRAM Write protection page 8 */
#define SYSCFG_RCR_PAGE9          ((uint32_t)0x00000200U) /*!< ICODE SRAM Write protection page 9 */
#define SYSCFG_RCR_PAGE10         ((uint32_t)0x00000400U) /*!< ICODE SRAM Write protection page 10 */
#define SYSCFG_RCR_PAGE11         ((uint32_t)0x00000800U) /*!< ICODE SRAM Write protection page 11 */
#define SYSCFG_RCR_PAGE12         ((uint32_t)0x00001000U) /*!< ICODE SRAM Write protection page 12 */
#define SYSCFG_RCR_PAGE13         ((uint32_t)0x00002000U) /*!< ICODE SRAM Write protection page 13 */
#define SYSCFG_RCR_PAGE14         ((uint32_t)0x00004000U) /*!< ICODE SRAM Write protection page 14 */
#define SYSCFG_RCR_PAGE15         ((uint32_t)0x00008000U) /*!< ICODE SRAM Write protection page 15 */
#endif

#endif
/*****************  Bit definition for SYSCFG_EXTICR1 register  ***************/
#define SYSCFG_EXTICR1_EXTI0            ((uint32_t)0x0000000FU) /*!< EXTI 0 configuration */
#define SYSCFG_EXTICR1_EXTI1            ((uint32_t)0x000000F0U) /*!< EXTI 1 configuration */
#define SYSCFG_EXTICR1_EXTI2            ((uint32_t)0x00000F00U) /*!< EXTI 2 configuration */
#define SYSCFG_EXTICR1_EXTI3            ((uint32_t)0x0000F000U) /*!< EXTI 3 configuration */

