HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
/*!<*
  * @brief  EXTI8 configuration
  */
#define SYSCFG_EXTICR3_EXTI8_PA         ((uint32_t)0x00000000U) /*!< PA[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PB         ((uint32_t)0x00000001U) /*!< PB[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PC         ((uint32_t)0x00000002U) /*!< PC[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PD         ((uint32_t)0x00000003U) /*!< PD[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PE         ((uint32_t)0x00000004U) /*!< PE[8] pin */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define SYSCFG_EXTICR3_EXTI8_PF         ((uint32_t)0x00000005U) /*!< PF[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PG         ((uint32_t)0x00000006U) /*!< PG[8] pin */
#endif

/*!<*
  * @brief  EXTI9 configuration
  */
#define SYSCFG_EXTICR3_EXTI9_PA         ((uint32_t)0x00000000U) /*!< PA[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PB         ((uint32_t)0x00000010U) /*!< PB[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PC         ((uint32_t)0x00000020U) /*!< PC[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PD         ((uint32_t)0x00000030U) /*!< PD[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PE         ((uint32_t)0x00000040U) /*!< PE[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PF         ((uint32_t)0x00000050U) /*!< PF[9] pin */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define SYSCFG_EXTICR3_EXTI9_PG         ((uint32_t)0x00000060U) /*!< PG[9] pin */
#endif

/*!<*
  * @brief  EXTI10 configuration
  */
#define SYSCFG_EXTICR3_EXTI10_PA        ((uint32_t)0x00000000U) /*!< PA[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PB        ((uint32_t)0x00000100U) /*!< PB[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PC        ((uint32_t)0x00000200U) /*!< PC[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PD        ((uint32_t)0x00000300U) /*!< PD[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PE        ((uint32_t)0x00000400U) /*!< PE[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PF        ((uint32_t)0x00000500U) /*!< PF[10] pin */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define SYSCFG_EXTICR3_EXTI10_PG        ((uint32_t)0x00000600U) /*!< PG[10] pin */
#endif

/*!<*
  * @brief  EXTI11 configuration
  */
#define SYSCFG_EXTICR3_EXTI11_PA        ((uint32_t)0x00000000U) /*!< PA[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PB        ((uint32_t)0x00001000U) /*!< PB[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PC        ((uint32_t)0x00002000U) /*!< PC[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PD        ((uint32_t)0x00003000U) /*!< PD[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PE        ((uint32_t)0x00004000U) /*!< PE[11] pin */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define SYSCFG_EXTICR3_EXTI11_PF        ((uint32_t)0x00005000U) /*!< PF[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PG        ((uint32_t)0x00006000U) /*!< PG[11] pin */
#endif

/*****************  Bit definition for SYSCFG_EXTICR4 register  *****************/
#define SYSCFG_EXTICR4_EXTI12           ((uint32_t)0x0000000FU) /*!< EXTI 12 configuration */
#define SYSCFG_EXTICR4_EXTI13           ((uint32_t)0x000000F0U) /*!< EXTI 13 configuration */
#define SYSCFG_EXTICR4_EXTI14           ((uint32_t)0x00000F00U) /*!< EXTI 14 configuration */
#define SYSCFG_EXTICR4_EXTI15           ((uint32_t)0x0000F000U) /*!< EXTI 15 configuration */

/*!<*
  * @brief  EXTI12 configuration
  */
#define SYSCFG_EXTICR4_EXTI12_PA        ((uint32_t)0x00000000U) /*!< PA[12] pin */
#if defined(STM32F373xC) || defined(STM32F378xx)
#else
#define SYSCFG_EXTICR4_EXTI12_PB        ((uint32_t)0x00000001U) /*!< PB[12] pin */
#endif
#define SYSCFG_EXTICR4_EXTI12_PC        ((uint32_t)0x00000002U) /*!< PC[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PD        ((uint32_t)0x00000003U) /*!< PD[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PE        ((uint32_t)0x00000004U) /*!< PE[12] pin */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define SYSCFG_EXTICR4_EXTI12_PF        ((uint32_t)0x00000005U) /*!< PF[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PG        ((uint32_t)0x00000006U) /*!< PG[12] pin */
#endif

/*!<*
  * @brief  EXTI13 configuration
  */
#define SYSCFG_EXTICR4_EXTI13_PA        ((uint32_t)0x00000000U) /*!< PA[13] pin */
#if defined(STM32F373xC) || defined(STM32F378xx)
#else
#define SYSCFG_EXTICR4_EXTI13_PB        ((uint32_t)0x00000010U) /*!< PB[13] pin */
#endif
#define SYSCFG_EXTICR4_EXTI13_PC        ((uint32_t)0x00000020U) /*!< PC[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PD        ((uint32_t)0x00000030U) /*!< PD[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PE        ((uint32_t)0x00000040U) /*!< PE[13] pin */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define SYSCFG_EXTICR4_EXTI13_PF        ((uint32_t)0x00000050U) /*!< PF[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PG        ((uint32_t)0x00000060U) /*!< PG[13] pin */
#endif

/*!<*
  * @brief  EXTI14 configuration
  */
#define SYSCFG_EXTICR4_EXTI14_PA        ((uint32_t)0x00000000U) /*!< PA[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PB        ((uint32_t)0x00000100U) /*!< PB[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PC        ((uint32_t)0x00000200U) /*!< PC[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PD        ((uint32_t)0x00000300U) /*!< PD[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PE        ((uint32_t)0x00000400U) /*!< PE[14] pin */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define SYSCFG_EXTICR4_EXTI14_PF        ((uint32_t)0x00000500U) /*!< PF[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PG        ((uint32_t)0x00000600U) /*!< PG[14] pin */
#endif

/*!<*
  * @brief  EXTI15 configuration
  */
#define SYSCFG_EXTICR4_EXTI15_PA        ((uint32_t)0x00000000U) /*!< PA[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PB        ((uint32_t)0x00001000U) /*!< PB[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PC        ((uint32_t)0x00002000U) /*!< PC[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PD        ((uint32_t)0x00003000U) /*!< PD[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PE        ((uint32_t)0x00004000U) /*!< PE[15] pin */
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx)
#define SYSCFG_EXTICR4_EXTI15_PF        ((uint32_t)0x00005000U) /*!< PF[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PG        ((uint32_t)0x00006000U) /*!< PG[15] pin */
#endif

/*****************  Bit definition for SYSCFG_CFGR2 register  ****************/
#define SYSCFG_CFGR2_LOCKUP_LOCK               ((uint32_t)0x00000001U) /*!< Enables and locks the LOCKUP (Hardfault) output of CortexM4 with Break Input of TIMx */
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F318xx)
#else
#define SYSCFG_CFGR2_SRAM_PARITY_LOCK          ((uint32_t)0x00000002U) /*!< Enables and locks the SRAM_PARITY error signal with Break Input of TIMx */
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F334x8)|| defined(STM32F373xC)
#define SYSCFG_CFGR2_PVD_LOCK                  ((uint32_t)0x00000004U) /*!< Enables and locks the PVD connection with TIMx Break Input, as well as the PVDE and PLS[2:0] in the PWR_CR register */
#endif
#if defined(STM32F302xC) || defined(STM32F302xE) || defined(STM32F303x8) || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F328xx) || defined(STM32F334x8)|| defined(STM32F358xx) || defined(STM32F398xx)
#define SYSCFG_CFGR2_BYP_ADDR_PAR              ((uint32_t)0x00000010U) /*!< Disables the adddress parity check on RAM */
#endif
#if defined(STM32F301x8) || defined(STM32F302x8) || defined(STM32F318xx)
#else
#define SYSCFG_CFGR2_SRAM_PE                   ((uint32_t)0x00000100U) /*!< SRAM Parity error flag */
#endif
#if defined(STM32F303x8) || defined(STM32F328xx) || defined(STM32F334x8)

/*****************  Bit definition for SYSCFG_CFGR3 register  *****************/
#define SYSCFG_CFGR3_DMA_RMP                   ((uint32_t)0x000003FFU) /*!< DMA remap mask */
#define SYSCFG_CFGR3_SPI1_RX_DMA_RMP           ((uint32_t)0x00000003U) /*!< SPI1 RX DMA remap */
#define SYSCFG_CFGR3_SPI1_RX_DMA_RMP_0         ((uint32_t)0x00000001U) /*!< SPI1 RX DMA remap bit 0 */
#define SYSCFG_CFGR3_SPI1_RX_DMA_RMP_1         ((uint32_t)0x00000002U) /*!< SPI1 RX DMA remap bit 1 */
#define SYSCFG_CFGR3_SPI1_TX_DMA_RMP           ((uint32_t)0x0000000CU) /*!< SPI1 TX DMA remap */
#define SYSCFG_CFGR3_SPI1_TX_DMA_RMP_0         ((uint32_t)0x00000004U) /*!< SPI1 TX DMA remap bit 0 */
#define SYSCFG_CFGR3_SPI1_TX_DMA_RMP_1         ((uint32_t)0x00000008U) /*!< SPI1 TX DMA remap bit 1 */
#define SYSCFG_CFGR3_I2C1_RX_DMA_RMP           ((uint32_t)0x00000030U) /*!< I2C1 RX DMA remap */
#define SYSCFG_CFGR3_I2C1_RX_DMA_RMP_0         ((uint32_t)0x00000010U) /*!< I2C1 RX DMA remap bit 0 */
#define SYSCFG_CFGR3_I2C1_RX_DMA_RMP_1         ((uint32_t)0x00000020U) /*!< I2C1 RX DMA remap bit 1 */
#define SYSCFG_CFGR3_I2C1_TX_DMA_RMP           ((uint32_t)0x000000C0U) /*!< I2C1 RX DMA remap */
#define SYSCFG_CFGR3_I2C1_TX_DMA_RMP_0         ((uint32_t)0x00000040U) /*!< I2C1 TX DMA remap bit 0 */
#define SYSCFG_CFGR3_I2C1_TX_DMA_RMP_1         ((uint32_t)0x00000080U) /*!< I2C1 TX DMA remap bit 1 */
#define SYSCFG_CFGR3_ADC2_DMA_RMP              ((uint32_t)0x00000300U) /*!< ADC2 DMA remap */
#define SYSCFG_CFGR3_ADC2_DMA_RMP_0            ((uint32_t)0x00000100U) /*!< ADC2 DMA remap bit 0 */
#define SYSCFG_CFGR3_ADC2_DMA_RMP_1            ((uint32_t)0x00000200U) /*!< ADC2 DMA remap bit 1 */
#if defined(STM32F328xx) || defined(STM32F334x8)
#define SYSCFG_CFGR3_TRIGGER_RMP               ((uint32_t)0x00030000U) /*!< Trigger remap mask */
#define SYSCFG_CFGR3_DAC1_TRG3_RMP             ((uint32_t)0x00010000U) /*!< DAC1 TRG3 remap */
#define SYSCFG_CFGR3_DAC1_TRG5_RMP             ((uint32_t)0x00020000U) /*!< DAC1 TRG5 remap */
#endif
#endif
#if defined(STM32F303xE) || defined(STM32F398xx)
/*****************  Bit definition for SYSCFG_CFGR4 register  *****************/
#define SYSCFG_CFGR4_ADC12_EXT2_RMP            ((uint32_t)0x00000001U) /*!< ADC12 regular channel EXT2 remap */
#define SYSCFG_CFGR4_ADC12_EXT3_RMP            ((uint32_t)0x00000002U) /*!< ADC12 regular channel EXT3 remap */
#define SYSCFG_CFGR4_ADC12_EXT5_RMP            ((uint32_t)0x00000004U) /*!< ADC12 regular channel EXT5 remap */
#define SYSCFG_CFGR4_ADC12_EXT13_RMP           ((uint32_t)0x00000008U) /*!< ADC12 regular channel EXT13 remap */
#define SYSCFG_CFGR4_ADC12_EXT15_RMP           ((uint32_t)0x00000010U) /*!< ADC12 regular channel EXT15 remap */
#define SYSCFG_CFGR4_ADC12_JEXT3_RMP           ((uint32_t)0x00000020U) /*!< ADC12 injected channel JEXT3 remap */
#define SYSCFG_CFGR4_ADC12_JEXT6_RMP           ((uint32_t)0x00000040U) /*!< ADC12 injected channel JEXT6 remap */
#define SYSCFG_CFGR4_ADC12_JEXT13_RMP          ((uint32_t)0x00000080U) /*!< ADC12 injected channel JEXT13 remap */
#define SYSCFG_CFGR4_ADC34_EXT5_RMP            ((uint32_t)0x00000100U) /*!< ADC34 regular channel EXT5 remap */
#define SYSCFG_CFGR4_ADC34_EXT6_RMP            ((uint32_t)0x00000200U) /*!< ADC34 regular channel EXT6 remap */
#define SYSCFG_CFGR4_ADC34_EXT15_RMP           ((uint32_t)0x00000400U) /*!< ADC34 regular channel EXT15 remap */
#define SYSCFG_CFGR4_ADC34_JEXT5_RMP           ((uint32_t)0x00000800U) /*!< ADC34 injected channel JEXT5 remap */
#define SYSCFG_CFGR4_ADC34_JEXT11_RMP          ((uint32_t)0x00001000U) /*!< ADC34 injected channel JEXT11 remap */
#define SYSCFG_CFGR4_ADC34_JEXT14_RMP          ((uint32_t)0x00002000U) /*!< ADC34 injected channel JEXT14 remap */
#endif

/******************************************************************************/
/*                                                                            */
/*                                    TIM                                     */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for TIM_CR1 register  ********************/
#define  TIM_CR1_CEN                         ((uint32_t)0x00000001U)            /*!<Counter enable */
#define  TIM_CR1_UDIS                        ((uint32_t)0x00000002U)            /*!<Update disable */
#define  TIM_CR1_URS                         ((uint32_t)0x00000004U)            /*!<Update request source */
#define  TIM_CR1_OPM                         ((uint32_t)0x00000008U)            /*!<One pulse mode */
#define  TIM_CR1_DIR                         ((uint32_t)0x00000010U)            /*!<Direction */

#define  TIM_CR1_CMS                         ((uint32_t)0x00000060U)            /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define  TIM_CR1_CMS_0                       ((uint32_t)0x00000020U)            /*!<Bit 0 */
#define  TIM_CR1_CMS_1                       ((uint32_t)0x00000040U)            /*!<Bit 1 */

