HoaiTV/MCU/STM32F051R8T6/Doucuments/AN4834-IR_remote_transmit_receive_stm32cube/Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xxxxx.h
#define  TIM_BDTR_BKF                        ((uint32_t)0x000F0000U)            /*!<Break Filter for Break1 */
#define  TIM_BDTR_BK2F                       ((uint32_t)0x00F00000U)            /*!<Break Filter for Break2 */

#define  TIM_BDTR_BK2E                       ((uint32_t)0x01000000U)            /*!<Break enable for Break2 */
#define  TIM_BDTR_BK2P                       ((uint32_t)0x02000000U)            /*!<Break Polarity for Break2 */
#endif

/*******************  Bit definition for TIM_DCR register  ********************/
#define  TIM_DCR_DBA                         ((uint32_t)0x0000001FU)            /*!<DBA[4:0] bits (DMA Base Address) */
#define  TIM_DCR_DBA_0                       ((uint32_t)0x00000001U)            /*!<Bit 0 */
#define  TIM_DCR_DBA_1                       ((uint32_t)0x00000002U)            /*!<Bit 1 */
#define  TIM_DCR_DBA_2                       ((uint32_t)0x00000004U)            /*!<Bit 2 */
#define  TIM_DCR_DBA_3                       ((uint32_t)0x00000008U)            /*!<Bit 3 */
#define  TIM_DCR_DBA_4                       ((uint32_t)0x00000010U)            /*!<Bit 4 */

#define  TIM_DCR_DBL                         ((uint32_t)0x00001F00U)            /*!<DBL[4:0] bits (DMA Burst Length) */
#define  TIM_DCR_DBL_0                       ((uint32_t)0x00000100U)            /*!<Bit 0 */
#define  TIM_DCR_DBL_1                       ((uint32_t)0x00000200U)            /*!<Bit 1 */
#define  TIM_DCR_DBL_2                       ((uint32_t)0x00000400U)            /*!<Bit 2 */
#define  TIM_DCR_DBL_3                       ((uint32_t)0x00000800U)            /*!<Bit 3 */
#define  TIM_DCR_DBL_4                       ((uint32_t)0x00001000U)            /*!<Bit 4 */

/*******************  Bit definition for TIM_DMAR register  *******************/
#define  TIM_DMAR_DMAB                       ((uint32_t)0x0000FFFFU)            /*!<DMA register for burst accesses */

#if defined(STM32F373xC) || defined(STM32F378xx)
/*******************  Bit definition for TIM14_OR register  *********************/
#define TIM14_OR_TI1_RMP                     ((uint32_t)0x00000003U)            /*!<TI1_RMP[1:0] bits (TIM14 Input 4 remap) */
#define TIM14_OR_TI1_RMP_0                   ((uint32_t)0x00000001U)            /*!<Bit 0 */
#define TIM14_OR_TI1_RMP_1                   ((uint32_t)0x00000002U)            /*!<Bit 1 */

/*******************  Bit definition for TIM2_OR register  *********************/
#define TIM2_OR_ITR1_RMP                     ((uint32_t)0x00000C00U)            /*!<TI1_RMP[1:0] bits (TIM14 Input 4 remap) */
#define TIM2_OR_ITR1_RMP_0                   ((uint32_t)0x00000400U)            /*!<Bit 0 */
#define TIM2_OR_ITR1_RMP_1                   ((uint32_t)0x00000800U)            /*!<Bit 1 */

#else
/*******************  Bit definition for TIM16_OR register  *********************/
#if defined (STM32F302xE) ||  defined (STM32F303xE) || defined (STM32F398xx) || defined (STM32F334x8)  || defined (STM32F303xC) || defined (STM32F302x8)
#define TIM16_OR_TI1_RMP                     ((uint32_t)0x00000003U)            /*!<TI1_RMP[1:0] bits (TIM16 Input 1 remap) */
#define TIM16_OR_TI1_RMP_0                   ((uint32_t)0x00000001U)            /*!<Bit 0 */
#define TIM16_OR_TI1_RMP_1                   ((uint32_t)0x00000002U)            /*!<Bit 1 */
#else
#define TIM16_OR_TI1_RMP                     ((uint32_t)0x000000C0U)            /*!<TI1_RMP[1:0] bits (TIM16 Input 1 remap) */
#define TIM16_OR_TI1_RMP_0                   ((uint32_t)0x00000040U)            /*!<Bit 0 */
#define TIM16_OR_TI1_RMP_1                   ((uint32_t)0x00000080U)            /*!<Bit 1 */
#endif

/*******************  Bit definition for TIM1_OR register  *********************/
#define TIM1_OR_ETR_RMP                      ((uint32_t)0x0000000FU)            /*!<ETR_RMP[3:0] bits (TIM1 ETR remap) */
#define TIM1_OR_ETR_RMP_0                    ((uint32_t)0x00000001U)            /*!<Bit 0 */
#define TIM1_OR_ETR_RMP_1                    ((uint32_t)0x00000002U)            /*!<Bit 1 */
#define TIM1_OR_ETR_RMP_2                    ((uint32_t)0x00000004U)            /*!<Bit 2 */
#define TIM1_OR_ETR_RMP_3                    ((uint32_t)0x00000008U)            /*!<Bit 3 */

#if defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
/*******************  Bit definition for TIM8_OR register  *********************/
#define TIM8_OR_ETR_RMP                      ((uint32_t)0x0000000FU)            /*!<ETR_RMP[3:0] bits (TIM8 ETR remap) */
#define TIM8_OR_ETR_RMP_0                    ((uint32_t)0x00000001U)            /*!<Bit 0 */
#define TIM8_OR_ETR_RMP_1                    ((uint32_t)0x00000002U)            /*!<Bit 1 */
#define TIM8_OR_ETR_RMP_2                    ((uint32_t)0x00000004U)            /*!<Bit 2 */
#define TIM8_OR_ETR_RMP_3                    ((uint32_t)0x00000008U)            /*!<Bit 3 */

#endif
#if defined(STM32F303xE) || defined(STM32F398xx)
/*******************  Bit definition for TIM20_OR register  *******************/
#define TIM20_OR_ETR_RMP                     ((uint32_t)0x0000000FU)            /*!<ETR_RMP[3:0] bits (TIM20 ETR remap) */
#define TIM20_OR_ETR_RMP_0                   ((uint32_t)0x00000001U)            /*!<Bit 0 */
#define TIM20_OR_ETR_RMP_1                   ((uint32_t)0x00000002U)            /*!<Bit 1 */
#define TIM20_OR_ETR_RMP_2                   ((uint32_t)0x00000004U)            /*!<Bit 2 */
#define TIM20_OR_ETR_RMP_3                   ((uint32_t)0x00000008U)            /*!<Bit 3 */

#endif
/******************  Bit definition for TIM_CCMR3 register  *******************/
#define  TIM_CCMR3_OC5FE                     ((uint32_t)0x00000004U)            /*!<Output Compare 5 Fast enable */
#define  TIM_CCMR3_OC5PE                     ((uint32_t)0x00000008U)            /*!<Output Compare 5 Preload enable */

#define  TIM_CCMR3_OC5M                      ((uint32_t)0x00010070U)            /*!<OC5M[2:0] bits (Output Compare 5 Mode) */
#define  TIM_CCMR3_OC5M_0                    ((uint32_t)0x00000010U)            /*!<Bit 0 */
#define  TIM_CCMR3_OC5M_1                    ((uint32_t)0x00000020U)            /*!<Bit 1 */
#define  TIM_CCMR3_OC5M_2                    ((uint32_t)0x00000040U)            /*!<Bit 2 */
#define  TIM_CCMR3_OC5M_3                    ((uint32_t)0x00010000U)            /*!<Bit 3 */

#define  TIM_CCMR3_OC5CE                     ((uint32_t)0x00000080U)            /*!<Output Compare 5 Clear Enable */

#define  TIM_CCMR3_OC6FE                     ((uint32_t)0x00000400U)            /*!<Output Compare 6 Fast enable */
#define  TIM_CCMR3_OC6PE                     ((uint32_t)0x00000800U)            /*!<Output Compare 6 Preload enable */

